{"ages":"12+","list_price":97.5878,"num_reviews":142.0,"piece_count":898.0,"play_rating":3.9,"prod_desc":"Enjoy the holiday season with the Winter Toy Shop!","prod_long_desc":"Welcome to the Winter Toy Shop! The holiday season has arrived and the toymaker is busy finishing off his latest creations! Outside, children ski and snowboard, and a freshly built snowman sparkles in the light that shines from the toyshop tower. Help decorate the huge tree that stands at the center of the square, play with the curious kitten on the cozy wooden bench or join in with the carolers beneath the ornate streetlamp. This charming set also features a ladder, trees in various sizes, jack-in-the-box, a toy biplane, helicopter, rocket, train, race car, truck, robot, tugboat, teddy bear and a wrapped gift. Have fun building this enchanting winter wonderland! Includes a snowman and 8 minifigures with assorted accessories: a male caroler, female caroler, a woman, 2 men, 2 boys and a girl.\nIncludes 8 minifigures with assorted accessories: a male caroler, female caroler, a woman, 2 men, 2 boys and a girl\nFeatures a toyshop, large Christmas tree with decorations, ladder, bench, ornate streetlight, carrot-nosed snowman and a cat\nToyshop features a LEGO® light brick, cash register, clock, chair, table, tools and a ladder\nAccessories include a wrapped gift, snowboard, skis, 5 wreaths, 2 sets of strings lights, 2 top hats, 2 carol songbooks and 10 toys, including a jack-in-the-box, a toy biplane, helicopter, rocket, train, race car, truck, robot, tugboat and a teddy bear element\nAlso includes trees in various sizes and snow elements\nIncludes 898 assorted LEGO® elements\nGather the family for some festive LEGO® building fun!\nLight up the toyshop tower with the LEGO® light brick!\nDecorate the Christmas tree!\nEnjoy the holiday season with this fun, festive model!\nWinter Toy Shop measures over 6” high, 7” wide and 3” long\nChristmas tree measures over 5” high, 4” wide and 4” long","review_difficulty":"Average","set_name":"Winter Toy Shop","overall_rating":3.8,"theme_name":"Creator Expert","value_rating":3.7}