{"ages":"16+","list_price":215.952,"num_reviews":115.0,"piece_count":2382.0,"play_rating":4.5,"prod_desc":"Make a safe deposit at the Brick Bank!","prod_long_desc":"Make a secure deposit at the highly respected Brick Bank, featuring an array of intricate details and hidden surprises. Easy-to-remove building sections provide access to the detailed interior, comprising a bank with an atrium foyer, tiled floor, arched windows, ornate chandelier, lockable vault and a transaction counter with security glass; a laundrette with printed window, tiled floor and 4 washing machines; plus 2 second-floor offices with an array of detailed furniture, fixtures and accessories. The exterior of the building features a detailed sidewalk and an elaborate façade with carving and statue décor, decorative roofline, large arched windows, central balcony, clock and an accessible roof terrace featuring a large skylight. Collect and build an entire town with the LEGO® Creator Expert Modular Building series 10243 Parisian Restaurant and 10246 Detective's Office. Includes 5 minifigures: a bank manager, secretary, cashier, Mum and child.\nIncludes 5 minifigures: a bank manager, secretary, teller, and a mom and child.\nThe Brick Bank features a bank, secretary's office, bank manager's office, laundromat and a detailed façade and sidewalk.\nBank features an atrium foyer with wide, arched entrance, triangular-patterned floor tiling, ornate chandelier, oxidized-copper colored skylight, transaction counter with hidden alarm buttons and security glass, and a bank vault with safe deposit boxes and a large round door.\nLaundromatfeatures a printed window, tiled floor and 4 laundry machines.\nSecretary's office features a wall clock, desk, typewriter, cabinet with opening drawers, fireplace and an espresso machine.\nBank manager's office features a large desk with banker's lamp and approval stamp, leather-look chair, printed portrait, statue and a cabinet.\nAccessory elements include a mug, document, camera, candy, blank white paper, chrome-golden coins, 1 chrome- golden bar and banknotes.\nRemove the building sections to access the detailed interior.\nUnlock the bank vault to access the safe deposit boxes.\nVisit the laundromat for a spot of laundering.\nStack coins with the coin counting machine.\nWith over 2380 pieces, this model will put your LEGO® building skills to the test!\nSpecial elements include a printed prize check, printed ground-floor windows, a special printed portrait in the bank manager's office, plus rare, sand-blue and dark-green bricks, and sand-green window frames.\nCollect and build an entire town with the LEGO® Creator Expert Modular Building series 10243 Parisian Restaurant and 10246 Detective's Office.\nBrick Bank measures over 10” high, 10” wide and 10” long.","review_difficulty":"Challenging","set_name":"Brick Bank","overall_rating":4.7,"theme_name":"Creator Expert","value_rating":4.2}