{"ages":"12+","list_price":49.6929,"num_reviews":11.0,"piece_count":444.0,"play_rating":3.6,"prod_desc":"Celebrate Chicago with this LEGO® Architecture Skyline model!","prod_long_desc":"Recreate Chicago’s blend of historical and modern architecture with this realistic LEGO® brick model. The LEGO Architecture Skyline Collection offers models suitable for display in the home and office, and has been developed for all with an interest in travel, architectural culture, history and design. Each set is scaled to give an accurate representation of the comparative size of each structure, with true-to-life color depiction. This set features the Willis Tower™, John Hancock Center, Cloud Gate, DuSable Bridge, Wrigley Building and the Big Red, and is finished with a decorative “Chicago” nameplate.\nLEGO® Architecture interpretation of Chicago.\nFeatures the Willis Tower™, John Hancock Center, Cloud Gate, DuSable Bridge, Wrigley Building and the Big Red.\nThe Chicago River is represented in the tiled baseplate and the DuSable Bridge opens and closes.\nThe included booklet contains information about the designer, architecture and history of each structure, as well as historical facts about Chicago and its architectural heritage (English language only. Other languages available for download at LEGO.com\/architecture).\nIncludes a 4x32 tiled base with a decorative “Chicago” nameplate.\nRecreate the world's most beautiful cities with the LEGO® Architecture Skyline Collection.\nLEGO® Architecture celebrates the world of architecture through the medium of the LEGO brick, and is developed for all with an interest in travel, design, architecture and history.\nThis set includes over 440 LEGO® pieces and offers an age-appropriate building experience for ages 12+.\nMeasures over 7” high, 8” wide and 1” long.","review_difficulty":"Average","set_name":"Chicago","overall_rating":4.8,"theme_name":"Architecture","value_rating":4.5}