{"ages":"12+","list_price":60.9878,"num_reviews":23.0,"piece_count":468.0,"play_rating":3.6,"prod_desc":"Celebrate London with this LEGO® Architecture Skyline model!","prod_long_desc":"Celebrate the architectural diversity of London with this detailed LEGO® brick model. The LEGO Architecture Skyline Collection offers models suitable for display in the home and office, and has been developed for all with an interest in travel, architectural culture, history and design. Each set is scaled to give an accurate representation of the comparative size of each structure, with true-to-life color depiction. This set features the National Gallery, Nelson’s Column, London Eye, Big Ben (the Elizabeth Tower) and Tower Bridge, and is finished with a decorative “London” nameplate.\nLEGO® Architecture interpretation of London.\nFeatures the National Gallery, Nelson’s Column, London Eye, Big Ben (the Elizabeth Tower) and Tower Bridge.\nLondon’s Thames River is represented by transparent baseplate tiles.\nTower Bridge opens to greet the incoming ship.\nThe included booklet contains information about the designer, architecture and history of each building, as well as historical facts about London and its architectural heritage (English language only. Other languages available for download at LEGO.com\/architecture).\nIncludes a 4x32 tiled base with a decorative “London” nameplate.\nRecreate the world's most beautiful cities with the LEGO® Architecture Skyline Collection.\nLEGO® Architecture celebrates the world of architecture through the medium of the LEGO brick, and is developed for all with an interest in travel, design, architecture and history.\nThis set includes over 460 LEGO® pieces and offers an age-appropriate building experience for ages 12+.\nMeasures over 5” high, 11” wide and 3” long","review_difficulty":"Average","set_name":"London","overall_rating":4.7,"theme_name":"Architecture","value_rating":4.1}