{"ages":"7-12","list_price":19.99,"num_reviews":null,"piece_count":246.0,"play_rating":null,"prod_desc":"Take the 3-in-1 Airshow Aces to town!","prod_long_desc":"Enjoy a great day at the airshow with this amazing set, featuring a jet, propeller plane with foldup wings and a transport truck with detachable trailer, plus two buildable flags and a buildable windsock. This 3-in-1 LEGO® Creator set features a three-part modular design that enables quick model reconfiguration, and can be combined with the 31054 and 31055 LEGO Creator mini modular vehicle sets to create new vehicles for extended play. Rebuild to create a Construction Truck or two Race Cars.\nFeatures a supersonic jet, classic propeller plane and a transport truck with a long trailer, plus two buildable flags and a buildable windsock.\nTruck features a removable trailer and a yellow, gray and black color scheme.\nJet features a tinted cockpit and blue, white, red and black color scheme.\nPropeller plane features foldup wings, spinning propeller and an orange, white and black color scheme.\nUnload the aircraft from the transport truck and perform high-speed flybys and loop the loops with the Airshow Aces.\nEasy three-part modular design for quick model reconfiguration.\nThis set includes over 240 pieces and offers an age-appropriate build and play experience for ages 6+.\n3-in-1 model: rebuilds into a Construction Truck or two Race Cars.\nCombine with the 31054 and 31055 LEGO® Creator mini modular vehicle sets for extended play.\nJet measures over 1” high, 4” long and 3” wide.\nPropeller plane measures over 1” high, 3” long and 4” wide.\nTruck measures over 1” high, 3” long and 1” wide.\nTrailer measures over 1” high, 6” long and 1” wide.\nConstruction Truck measures over 1” high, 3” long and 1” wide.\nRace Cars Hot Rod measures over 2” long, 1” wide and under 1” high.\nRace Cars Dragster measures over 1” high, 5” long and 1” wide.\nRace Cars Traffic Lights measure over 2” high and under 1” wide and 1” long.","review_difficulty":null,"set_name":"Airshow Aces","overall_rating":null,"theme_name":"Creator 3-in-1","value_rating":null}