{"ages":"8-12","list_price":82.9478,"num_reviews":11.0,"piece_count":728.0,"play_rating":3.2,"prod_desc":"Build and enjoy the delightful 3-in-1 Family Villa!","prod_long_desc":"Enjoy urban adventures at the 3-level Family Villa, featuring a red-tiled roof, white facade with lots of windows and colorful details, plus a garden area with a basketball hoop, outdoor fireplace, mailbox, doghouse and a stairway that leads to a mid-level terrace with a sun lounger. Interior details include a bedroom and kitchen, tables and a sofa. Mix and match the buildable modules and easily swap the window, door and other modular sections to customize the house with the new-for-June-2017 LEGO® Creator modular system. Combine this set with the 31067 and 31068 modular-system sets to create a dream house with endless build and play opportunities! This 3‑in‑1 LEGO Creator model can also be rebuilt to create a Golf Hotel or a Summer Villa with a swimming pool. Includes 3 minifigures.\nIncludes 3 minifigures: a man, woman and a boy, plus a buildable dog figure.\nThe 3-level Family Villa features a red tiled roof and a white facade with lots of windows and colorful details, plus a garden area with a tree, basketball hoop, outdoor fireplace, mailbox, doghouse and an outdoor stairway that leads to a tiled, mid-level terrace with sun lounger.\nInterior details include a detailed kitchen, dining table, coffee table and a double bed.\nPlace a minifigure in the open-top car to activate the working headlights.\nMix and match the easy-to-connect, buildable modules and easily swap the window, door and other modular sections to customize the house with the new-for-June-2017 LEGO® Creator modular system.\nAccessory elements include a printed letter, bone and a bucket.\nBattery included.\nCombine with the 31067 and 31068 LEGO® Creator modular buildings to create a dream house with endless build and play opportunities!\n3-in-1 model: rebuilds into a Golf Hotel or a Summer Villa with a swimming pool.\nFamily Villa measures over 8” high, 14” wide and 5” long.\nGolf Hotel measures over 9” high, 11” wide and 5” long.\nSummer Villa measures over 5” high, 7” wide and 9” long.","review_difficulty":"Average","set_name":"Modular Family Villa","overall_rating":3.4,"theme_name":"Creator 3-in-1","value_rating":3.2}