{"ages":"8-12","list_price":121.38,"num_reviews":17.0,"piece_count":1124.0,"play_rating":4.8,"prod_desc":null,"prod_long_desc":"Push the LEGO® Friends Amusement Park Roller Coaster around the track, sit a mini-doll in the front carriage to activate the light brick, and activate the cool functions as you go! Turn the Ferris wheel with its swinging gondolas, then push the car to the top of the drop tower and release to watch it go spinning round. This set is full of detailed functions and accessories for a day at the iconic Amusement Park. Includes 4 mini-doll figures.\nIncludes 4 mini-dolls: Emma, Andrea, Matthew and Naya in summer outfits.\nFeatures a roller coaster, Ferris wheel, drop tower, entrance booth and a dining area.\nThe push-along roller coaster features 4 carriages (each sitting a mini-doll), functioning light brick, entrance area with opening safety barrier, control panel with levers, camera and a long track with various obstacles along the ride.\nThe rotating Ferris wheel features steps up to 6 hanging gondolas (each seating a mini-doll).\nThe drop tower features 2 cars with opening safety bars, exciting spinning function as it drops, and a camera.\nEntrance booth features a rotating turnstile and a ticket office where you can buy photos from the rides.\nDining area includes a popcorn cart with turning wheels, 2 tables, 4 stalls and an Amusement Park information stand with a map.\nAmusement Park accessory elements include 2 tickets, coin, bill, 2 photographs and a map.\nFood accessory elements include 2 boxes of popcorn, 2 w atermelon slices, apple, hot dog with bun, water bottle and a soda bottle.\nBeauty accessory elements include 2 pairs of sunglasses and a hair bow.\nSit a mini-doll in the front carriage to turn on the light brick and watch all the cool features you activate on your roller coaster ride!\nPush the car to the top of the drop tower and smile for the camera as you spin to the ground.\nGently turn the Ferris wheel and enjoy the amazing view from the top.\nGrab a delicious box of popcorn, hot dogor slice of watermelon from the dining area.\nThis set offers an age-appropriate building experience for ages 8-12.\nRoller coaster train with 4 carriages measures over 1” high, 6” long and 1” wide.\nRoller coaster track measures 27” long.\nFerris wheel measures over 12” high, 11” wide and 4” long.\nDrop tower measures over 12” high, 4” wide and 2” long.\nEntrance booth measures over 2” high, 4” wide and 1” ( 3cm) long.\nPopcorn cart measures over 1” high, 1” long and under 1” wide.\nCombine with the 41127 Amusement Park Arcade, 41128 Amusement Park Space Ride and 41129 Amusement Park Hot Dog Van to create the Heartlake Amusement Park.","review_difficulty":"Average","set_name":"Amusement Park Roller Coaster","overall_rating":4.8,"theme_name":"Friends","value_rating":4.5}