{"ages":"6-12","list_price":97.986,"num_reviews":3.0,"piece_count":585.0,"play_rating":4.3,"prod_desc":"Dine and dance at the Dream Castle with Disney Cinderella.","prod_long_desc":"LEGO® l Disney Cinderella’s Dream Castle is the ultimate set to play out your fairytales, whether recreating scenes from Disney’s Cinderella or creating new stories of your own. With a grand dining room, bedroom, dressing area, kitchen, fireplace and balcony, there's so much to explore and hidden secrets to discover in this popular toy for kids. Get creative using the modular design to easily move and swap sections within the model, or rearrange the rooms of the castle and integrate them with other compatible LEGO l Disney toys to build your own dream creations. Includes 2 mini-doll figures plus a foal and 2 mice figures.\nIncludes Cinderella and Prince Charming mini-doll figures, plus a foal and 2 mice figures.\nFeatures a modular 3-story castle, pumpkin patch, horse jump, and a cart that can be pulled by the foal.\nCastle features a dining area with table and chairs, bedroom with opening secret compartment in the bed, turning fireplace with secret hiding place, balcony with revolving dancefloor, kitchen, dressing area with vanity, and a lounge area with chaise longue.\nAccessory elements include a glass slipper tile, opening book, invitation tile, perfume bottles, jewel, hairbrush, hair bows, croissants, cookies, cheese, pumpkins, water bottle, cooking pot, pan and glasses.\nCustomize the set by easily swapping and rearranging internal features such as the throne, stove, vanity and bench.\nMove and rearrange the rooms to create a new castle every time, or combine, swap and mix this model with other compatible LEGO® l Disney toys to build your own dream creations.\nRecreate scenes from Disney's Cinderella with these much-loved characters, or create new role-play stories of your own.\nHelp Cinderella and Prince Charming dance all night on the revolving dancefloor, then head to the kitchen to wash the dishes.\nTake care of the foal and attach the cart to help him pull it along!\nThis popular toy for kids is suitable for ages 6-12.\nCinderella's Dream Castle measures over 13” high, 9” wide and 4” long.\nCart (without horse) measures over 1” high, 3” long and 1” wide.","review_difficulty":"Challenging","set_name":"Cinderella's Dream Castle","overall_rating":4.3,"theme_name":"Disney™","value_rating":3.3}