{"ages":"8-12","list_price":34.986,"num_reviews":2.0,"piece_count":360.0,"play_rating":4.0,"prod_desc":"Free the Guardian Fire Lion from the evil shadow bats’ chain!","prod_long_desc":"Seek the magic within to help Azari and the Guardian Fire Lion face the shadow bats! This thrilling LEGO® Elves construction toy features a buildable magic fire lion with movable legs, wings and tail, opening jaw and space for a mini-doll figure. There's also a bat capture vehicle with raising chain pole, catapult and detachable small glider, plus a small bat cave with opening spiderweb door, 2 bat beds and additional accessories. Includes a mini-doll figure, plus 2 bat figures and a spider figure.\nIncludes an Azari mini-doll figure plus Vespe and Molo shadow bat figures and a spider figure.\nFeatures a buildable Rowan the Guardian Fire Lion figure with space for a mini-doll figure on the back, plus posable legs, wings and tail, opening jaw, translucent orange, yellow and pink ‘fire' mane, and space on the head for a magic Fire ‘diamond'.\nAlso includes a bat vehicle with a capture function, catapult, detachable glider and space for 2 bats, plus a small bat cave with opening spiderweb door, fireplace with chicken leg and 2 bat beds.\nLaunch ‘water’ elements from the capture vehicle’s catapult at the Guardian Fire Lion and Azari to distract them.\nTurn the knob on the capture vehicle to drop the chain over the lion’s head.\nUse the glider from the vehicle to help the bat snatch the magical Fire ‘diamond' from the lion's forehead.\nGrab Azari's power-up hammer to help release the lion from the chain.\nAccessory elements include a bucket with ‘water', chicken leg, Azari's power-up hammer, pink cupcake, cherry cupcake, compass, map, 2 ‘water’ elements, cup and a magic Fire ‘diamond’.\nThis thrilling construction toy is suitable for ages 8-12.\nOther mischievous little bats can be collected in selected LEGO® Elves sets.\nGuardian Fire Lion measures over 3” high, 8” long and 5” wide.\nCapture vehicle with glider measures over 3” high, 4” long and 3” wide.","review_difficulty":"Average","set_name":"Azari & the Fire Lion Capture","overall_rating":4.0,"theme_name":"Elves","value_rating":3.5}