{"ages":"6-12","list_price":38.9922,"num_reviews":1.0,"piece_count":460.0,"play_rating":4.0,"prod_desc":"Show off your sporting prowess at the Sports Arena!","prod_long_desc":"LEGO® Friends Stephanie’s Sports Arena features 2 cool game functions to keep sports fans playing with this cool children’s toy all day long. There’s a tennis court with a moving ball function and a basketball arena with shooting function. In the main building, there's an entrance hall, souvenir shop, taco bar and a spectator stand, plus 2 floodlights. Includes 2 mini-dolls.\nIncludes Stephanie and Vicky mini-doll figures.\nFeatures a 2-story building with a scoreboard, main entrance downstairs, souvenir shop upstairs and a hinged spectator stand and taco bar to either side, a tennis game with moving ball function, a basketball game with shooting function, plus 2 non-functioning floodlights.\nAccessory elements include 2 tennis rackets, basketball, trophy, drinks bottle, ‘I love Heartlake City' mug, taco, sauce bottle, bill, coin, ticket, megaphone and a baseball cap.\nUse the cool functions on this great children’s toy to play basketball and tennis in the Sports Arena.\nBuy souvenirs and flags in your team colors from the shop.\nHelp Stephanie battle it out on the tennis court against her rival Vicky to win the trophy.\nSee how many times you can shoot the basketball into the net.\nHead to the bar to buy a delicious taco and a drink, then take them over to the spectator stand to enjoy the sporting action.\nSuitable for ages 6-12.\nSports arena with spectator stand and taco bar measures over 7” high, 8” wide and 3” long.\nTennis court measures over 1” high, 4” wide and 3” long.\nBasketball arena measures over 3” high, 3” wide and 5” long.\nCombine with 41330 Stephanie's Soccer Practice to extend the sporting action.","review_difficulty":"Average","set_name":"Stephanie's Sports Arena","overall_rating":4.0,"theme_name":"Friends","value_rating":1.0}