{"ages":"10-16","list_price":167.952,"num_reviews":7.0,"piece_count":1151.0,"play_rating":4.0,"prod_desc":"Prepare for vertical takeoffs and landings with the Air Race Jet!","prod_long_desc":"Reach supersonic speeds with this huge, aerodynamic LEGO® Technic Air Race Jet, featuring a blue, black and red color scheme with racing stickers and an array of intricate technical details and motorized functions, including an adjustable jet nozzle for vertical or horizontal takeoff position, hatch access to a spinning fan, opening fuselage, retractable undercarriage, and adjustable flaps. Manual functions include working front steering, movable tail rudders and an opening cockpit. This robust and highly detailed 2-in-1 model has been designed to provide an immersive and rewarding build-and-play experience and can be rebuilt to create a Private Jet.\nIncludes a LEGO® Power Functions motor for an array of motorized functions, including an adjustable jet nozzle, opening fuselage, retractable undercarriage and adjustable flaps, plus working front steering, movable tail rudders and an opening cockpit.\nCheck out the blue, black and red color scheme with cool racing stickers.\nActivate the LEGO® Power Functions and adjust the jet nozzle for vertical takeoff.\nOpen the fuselage doors, lower the undercarriage and prepare for landing.\nPerform supersonic aerial maneuvers.\nA uniquely decorated LEGO® Technic 40th Anniversary brick is included with this model.\nThis LEGO® Technic model is designed to provide an immersive and rewarding building experience.\nThis set includes over 1,100 pieces and offers an age-appropriate building experience for ages 10-16.\n2-in-1 model: rebuilds into a Private Jet.\nBatteries not included.\nAir Race Jet measures over 9” high, 22” long and 14” wide.\nPrivate Jet measures over 8” high, 24” long and 20” wide.","review_difficulty":"Challenging","set_name":"Air Race Jet","overall_rating":4.9,"theme_name":"Technic","value_rating":4.7}