{"ages":"6-12","list_price":155.87,"num_reviews":45.0,"piece_count":610.0,"play_rating":4.4,"prod_desc":"Get around LEGO® City fast in the High-speed Passenger Train!","prod_long_desc":"Travel around the city in no time with the motorized LEGO® City High-speed Passenger Train! Operate the 8-channel, 7-speed infrared remote control to power around the curved tracks at top speed. This streamlined, super-efficient train has a high-speed front profile and electricity contact points on top. Lift off the roof of the front car to place the driver inside at the cool dashboard and open the passenger cars to access the seats and tables. Wait for the train with the traveler at the way station, and pedal safely across the crossing with the cyclist once the train has gone past. Includes 3 minifigures: train driver, traveler and a cyclist.\nIncludes 3 minifigures: train driver, traveler and a cyclist\nFeatures motorized locomotive with 8-channel, 7-speed infrared remote control, high-speed front profile, removable roof with electricity contact point and driver’s cabin with dashboard, plus rear passenger car with removable roofs with electricity contact point, seats and tables, and a middle passenger car with removable roof, seats and tables\nWay station features small platform with 2 seats, map of train services, warning sign, lights and a crossing\nIncludes a full circular track with 16 curved rail tracks and 4 straight rail tracks\nAlso includes a bicycle\nLift off the roof to access the driver’s cabin with cool dashboard\nOperate the train with the 7-speed infrared remote control\nDrive to the way station and pick up passengers\nStop at the crossing with the cyclist and wait for the train to pass\nHigh-speed Passenger Train in total measures over 4” high, 30” long and 1” wide\nFront and rear cars each measure over 4” high, 10” long and 1” wide\nMiddle car measures 3” high, 8” long and 1” wide\nCurved rail tracks each measure over 5” long and 2” wide\nStraight rail tracks each measure over 5” long and 2” wide\nWay station measures 2” high, 7” wide and 5” long","review_difficulty":"Average","set_name":"High-speed Passenger Train","overall_rating":4.4,"theme_name":"City","value_rating":4.0}