{"ages":"8-12","list_price":116.9922,"num_reviews":9.0,"piece_count":824.0,"play_rating":5.0,"prod_desc":"Get busy with some serious scientific work!","prod_long_desc":"Take part in the big discoveries with the Volcano Exploration Base, featuring a volcano with eruption function, mobile operations center with detachable truck cab and side opening lab, large excavator with extendable hammer arm that moves up and down, drone with spinning rotors, wheeled dumper, ‘lava' boulders with crystal elements inside and various tools. Includes 6 minifigures.\nIncludes 6 minifigures: a female scientist, scientist with heatsuit, female worker, male worker and 2 adventurers.\nFeatures a mobile operations center, excavator, wheeled dumper, drone, boulder rack and a volcano with an eruption function.\nMobile operations center features a detachable truck cab with space in the back to carry a boulder, rolling wheels and a side that opens to reveal the operations center.\nExcavator features an extendable hammer arm.\nWheeled dumper features rolling wheels and a handle.\nDrone features spinning rotors.\nUse the lever to trigger the volcano eruption.\nSet the boulders in the boulder rack and use the excavator to crack them open and retrieve the crystals.\nAccessory elements include 4 boulders, 4 crystal elements, shovel, pickaxe, walkie-talkie, camera, crowbar, drill and a metal detector.\nHeadgear accessory elements include 3 hard hats, baseball cap, adventurer's hat and a heatsuit helmet.\nVolcano measures over 5” high, 6” wide and 6” long.\nBoulder rack measures over 2” wide, 2” long and under 1” high.\nMobile operations center with truck measures over 4” high, 12” long and 2” wide.\nExcavator measures over 5” high, 6” long and 3” wide.\nWheeled dumper measures over 1” high, 2” long and 1” wide.\nDrone measures over 2” long, 3” wide and under 1” high.","review_difficulty":"Average","set_name":"Volcano Exploration Base","overall_rating":4.6,"theme_name":"City","value_rating":4.6}