{"ages":"8-12","list_price":174.7924,"num_reviews":1.0,"piece_count":1250.0,"play_rating":5.0,"prod_desc":"Haul in fresh supplies at the exploration site!","prod_long_desc":"Keep your camp well-supplied in the LEGO® City jungle with the Jungle Air Drop Helicopter, featuring 2 spinning rotors, a clamp system to carry the pallet platform or truck, work tower with rotating crane, riverboat that holds 2 pallets or motorbikes, a temple, collapsible bridge, movable statue, buildable Venus flytrap and a 4x4 truck with winch. Includes 7 minifigures, plus tiger, crocodile and 2 spider figures.\nIncludes 7 minifigures: riverboat captain, helicopter pilot, 3 explorers and 2 base camp workers, plus tiger, crocodile and 2 spider figures.\nFeatures a side-by-side rotor helicopter, work tower, pallet transporter, 2 motorbikes, riverboat, buildable Venus flytrap, and a temple and bridge build.\nHelicopter features a switch-activated clamp system to carry the included pallet platform or 4x4 truck with winch.\nWork tower features a rotating and elevating crane arm.\nPallet transporter holds 3 pallets and\/or 2 motorbikes\nRiverboat features a minifigure cockpit and space for 2 pallets and\/or motorbikes.\nVenus flytrap build features a closing ‘mouth’ and space for a spider.\nTemple and bridge build features a moving statue that reveals a hiding space and lever-activated collapsing bridge.\nPush the switch on the helicopter’s tail to activate the clamp system and lift the pallet transporter or 4x4 truck.\nRotate the crane arm on the work tower to move the pallet transporter or pallets to and from the riverboat.\nHook the 4x4 truck’s winch to the statue to set it upright and find what’s hidden behind it.\nSlide the lever out on the temple and bridge section to collapse the bridge and send the explorer tumbling into the water.\nPush the top of the Venus flytrap down to trap the spider inside.\nAccessory elements include 3 pallets, mobile lab, fuel box, 2 fuel cans, treasure chest, gold-colored chalice, box, machete, working magnifying glass, camera and other tools.\nSide-by-side rotor helicopter including rotors measures over 5” high, 15” long and 22” wide.\nRiverboat measures over 2” high, 7” long and 3” wide.\n4x4 truck measures over 2” high, 4” long and 2” wide.\nWork tower measures over 7” high, 5” wide and 5” long.\nTemple and bridge build measures over 4” high, 12” wide and 5” long.\nPallet transporter measures over 2” high, 2” wide and 5” long.\nEach pallet measures over 1” high, 1” wide and 1” long.\nVenus flytrap build measures over 3” high, 2” wide and 3” long.\nCrocodile figure measures over4” long.\nTiger figure measures over 3” long.","review_difficulty":"Average","set_name":"Jungle Air Drop Helicopter","overall_rating":5.0,"theme_name":"City","value_rating":4.0}