{"ages":"6-12","list_price":91.698,"num_reviews":8.0,"piece_count":663.0,"play_rating":4.4,"prod_desc":"Stop the crooks from breaking their partner out of jail!","prod_long_desc":"Pick up your badge and make an arresting visit to the LEGO® City Mountain Police Headquarters! This exciting set features a 2-level police headquarters with a net shooter on the roof, jail cell with breakout wall\/door and a cave under the jail cell with a mountain lion pounce function. This cool toy for kids also includes a helipad with ladder, police helicopter with spinning rotors, crook helicopter with spinning rotors and chain with hook, police 4x4 and motocross bike. Includes 7 minifigures and a mountain lion figure.\nIncludes 7 minifigures: a police chief, pilot, 2 officers and 3 crooks, plus a mountain lion figure.\nFeatures a 2-level Mountain Police Headquarters with rotating satellite dish, net shooter, garage and ramp for a vehicle, jail cell with breakout wall\/door, escape ‘rope', office with desks and a cave under the jail cell with mountain lion pounce function, plus a separate helipad with ladder.\nAlso includes a police helicopter with spinning rotors and opening minifigure cockpit, crooks' helicopter with spinning rotors, opening minifigure cockpit and a chain with hook, police 4x4 with tall bubble light, and a police motocross bike.\nHook the chain from the crooks’ helicopter onto the jail cell wall to break out the crook.\nTake off in the police helicopter and 4x4 to chase after the crooks, then prep the net shooter and launch a net at the crooks' helicopter to force it to land.\nPush the lever behind the cave to pounce the mountain lion at the crooks.\nAccessory elements include 2 mugs, 2 golden bars, string net, binoculars, radio, flashlight, megaphone and 3 pairs of handcuffs.\nThis cool toy for kids is suitable for ages 5-12.\nPolice helicopter measures over 2” high, 7” long and 6” wide.\nCrooks' helicopter measures over 3” high, 8” long and 6” wide.\nPolice motocross bike measures over 1” high, 2” long and under 1” wide.\nPolice 4x4 measures over 2” high, 4” long and 2” wide.\nPolice headquarters measures over 9” high, 9” wide and 6” long.\nPolice helipad measures over 2” high, 2” wide and 2” long.\nAs seen in the LEGO® City Police TV commercial.","review_difficulty":"Average","set_name":"Mountain Police Headquarters","overall_rating":4.6,"theme_name":"City","value_rating":4.0}