{"ages":"8-14","list_price":49.99,"num_reviews":2.0,"piece_count":516.0,"play_rating":4.5,"prod_desc":"Tower over the enemy with the monstrous Siege Machine of Doom!","prod_long_desc":"Lift the back of General Magmar's 2-in-1 Siege Machine of Doom, featuring 2 platforms and giant wheels with spikes, to switch the vehicle into siege mode. Fire the dual catapults and disc shooter to knock Clay Moorington off his Hover Horse. Use the swords to play out battles on the ground as General Magmar and Flama take on Clay with his Claymore sword for the Book of Destruction. Comes with 3 scannable shields and 3 minifigures.\nIncludes 3 minifigures: General Magmar, Flama and Clay Moorington.\nGeneral Magmar's Siege Machine of Doom features 6 large wheels with translucent- red flame elements and spikes, monster teeth, cockpits for General Magmar and Flama, dual catapults and a disc shooter.\nThe Siege Machine of Doom's 2 catapults and disc shooter can be fired in both vehicle mode and siege machine mode.\nWeapons include General Magmar's sword, Flama's fiery sword and Clay's Claymore sword.\nAccessory elements include the Book of Destruction, General Magmar's cape, Flama's fire helmet, Clay's helmet, shield and NEXO Armor, 4 Globlin balls and 3 Globlin discs.\nThis set offers an age-appropriate building experience for ages 8-14.\nDownload the free LEGO® NEXO KNIGHTS™: MERLOK 2.0 app to your smartphone or tablet. Ask your parents' or guardians' permission before going online.\nScan shields for each of the 3 NEXO Powers (Giant Growth, Storm Dragon and Dynamighty) and power up in the LEGO® NEXOKNIGHTS™ game!\nWatch all your favorite NEXO KNIGHTS™ characters on Cartoon Network.\nGeneral Magmar's Siege Machine of Doom measures over 5” high, 6” long and 8” wide in vehicle mode, and over 9” high, 6” long and 8” wide in siege mode.\nThe Hover Horse measures over 1” high, 3” long and 1” wide.","review_difficulty":"Challenging","set_name":"General Magmar's Siege Machine of Doom","overall_rating":5.0,"theme_name":"NEXO KNIGHTS™","value_rating":4.5}