{"ages":"9-14","list_price":85.7922,"num_reviews":3.0,"piece_count":840.0,"play_rating":5.0,"prod_desc":"Help the heroic knights rescue Ava from Jestro’s head-shaped HQ!","prod_long_desc":"Stage a daring rescue mission and release Ava from Jestro’s Headquarters, featuring a giant face with hidden weapons, detachable Hatattacka with flick missiles, Mobile Stone Keep trailer with adjustable crane and cage with movable bars, and an ejecting Stone boat function. This feature-packed LEGO® NEXO KNIGHTS™ set also comes with Macy’s Underminer vehicle featuring a spinning drill, plus a Stone Wheeler vehicle with cannons to ramp up the rescue mission action. Includes five scannable shields and six minifigures.\nIncludes six minifigures: Jestro, Ava, Macy, Lance, a gargoyle and a Stone stomper.\nFeatures Jestro’s Headquarters and Macy’s Underminer vehicle.\nJestro’s Headquarters features a giant head with hidden surprises and detachable jester’s cap mini-flyer with minifigure cockpit and two flick missiles, flexible front rolling wheels, four stud shooters, dual flick missiles, detachable trailer with Stone Wheeler vehicle and secret Stone boat, adjustable crane with hook, cage, ladder, four cannons and an ammunition box.\nMacy’s Underminer features a spinning drill, minifigure cockpit, and a weapon and shield holder.\nUse the adjustable crane and hook to raise the cage holding Ava.\nOpen up the giant head to reveal the secret weapons!\nLift up the trailer's ladder, then push the button to eject the Stone boat.\nPush Macy's Underminer to activate the spinning drill.\nWeapons include Jestro's lightning staff, the gargoyle's Granite Blade, Macy's mace and Lance's lance.\nAccessory elements include two shield holders, Monstrox cloud and two lightning elements.\nDownload the free LEGO® NEXO KNIGHTS™: MERLOK 2.0 app to your smartphone or tablet. Ask your parents’ permission.\nScan shields for the NEXO Powers Ninja Strike, Mindbender, Tone of Power and Standing Ovation, and combine them to defeat Monstrox in the LEGO® NEXO KNIGHTS™ game!\nAlso includes the Forbidden Power Corrupting Crush.\nWatch all your favorite NEXO KNIGHTS™ characters on Cartoon Network.\nJestro's Headquarters measures over 7” high, 12” long and 8” wide.\nFront vehicle measures over 5” high, 7” long and 8” wide.\nJestro’s hat mini-flyer measures over 3” high, 4” long and 9” wide.\nTrailer measures over 7” high, 5” long and 6” wide.\nStone Wheeler measures over 1” high, 2” long and 1” wide.\nMacy's Underminer measures over 1” high, 5” long and 2” wide.","review_difficulty":"Average","set_name":"Jestro's Headquarters","overall_rating":5.0,"theme_name":"NEXO KNIGHTS™","value_rating":4.7}