{"ages":"9-14","list_price":79.99,"num_reviews":8.0,"piece_count":754.0,"play_rating":4.6,"prod_desc":"Launch a surprise attack on the sky pirates’ awesome HQ!","prod_long_desc":"Stage a sky pirates vs. Ninja battle with Misfortune's Keep, featuring rotating engines for launch and flight modes, fold-out cannons and disc shooters, plus a pirate jet and launchpad. Ninja Lloyd has a booster jet featuring a winch to lower Jay into battle for the golden Djinn Blade with ‘trapped Wu' element. Includes 6 minifigures: Jay, Lloyd, Kai, Bucko, Nadakhan and Flintlocke, plus Monkey Wretch.\nIncludes 6 minifigures: Jay, Lloyd, Kai, Bucko, Nadakhan and Flintlocke, plus Monkey Wretch.\nThe pirate's airship\/headquarters Misfortune's Keep features an opening minifigure cockpit, lever-operated rotating engines with turning Ninja-blade propellers for launch and flight modes, 2 hidden fold-out cannons, 2 disc shooters, rotating aircraft gun, a detachable escape boat, armor crate and a sky pirates flag.\nMisfortune's Keep also has a launchpad for the pirate jet. The jet features an opening minifigure cockpit, 2 stud shooters, fold-out wings and a spinning propeller.\nLloyd's booster jet features an attachment point for Lloyd, a spinning Ninjago rotor to raise and lower the winch, and golden Ninja blades.\nWeapons include a golden Djinn Blade with ‘trapped Wu' element, 2 golden katanas each for Jay and Lloyd, Kai's 2 silver katanas, Monkey Wretch's rifle and hammer, Bucko's pirate sword and Flintlocke's gun.\nRecreate and role-play epic scenes from the NINJAGO™: Mastersof Spinjitzu TV show.\nMisfortune's Keep measures over 9” high, 17” long and 17” wide.\nPirate flyer measures over 1” high, 4” long and 3” wide.\nDetachable escape boat measures over 4” long, 1” wide and under 1” high.\nLloyd's booster jet measures over 2” high, 4” long and 7” wide.","review_difficulty":"Average","set_name":"Misfortune’s Keep","overall_rating":4.5,"theme_name":"NINJAGO®","value_rating":4.1}