{"ages":"8-14","list_price":134.1878,"num_reviews":23.0,"piece_count":1047.0,"play_rating":4.7,"prod_desc":"Protect the Batcave from The Penguin’s invasion!","prod_long_desc":"Defend against The Penguin’s Duckmobile invasion of the Batcave in THE LEGO® BATMAN MOVIE: Batcave Break-in set. The highly detailed Batcave features a rotating transformation chamber for Bruce Wayne™ to ‘transform’ into Batman™, rotating Batcomputer control center with multiscreen elements and elevating platform function, and a prison with an exploding escape wall function. The Batcave also has a rotating wardrobe with alternative Scu-Batsuit, Raging Batsuit or the Bat-Pack Batsuit minifigure bodies for Batman. Dial up the conflict by using the Batboat’s spring-loaded missiles against the Duckmobile’s dual stud shooters and flick missiles. Includes four minifigures plus two Hench-Penguin figures.\nIncludes four minifigures: Batman™, The Penguin™, Bruce Wayne™ and Alfred Pennyworth™, plus two Hench-Penguin figures, each with robot-style hands.\nThis action-packed set features a highly detailed Batcave, Batboat and The Penguin’s Duckmobile.\nThe Batcave features a rotating transformation chamber, raised and rotating control center with bat-shaped Batcomputer with multiscreen elements, rotating chair, elevating platform function, two cabinets to hide Batman’s Batarangs, plus Batman™ logo tile, prison with exploding escape wall function and a rotating wardrobe with three different Batsuits (minifigure bodies) for Batman.\nPut the Bruce Wayne™ minifigure in one side of the transformation chamber and rotate to reveal the hidden Batman™ minifigure.\nActivate the elevating platform to move a minifigure from the ground to the Batcomputer control center.\nSelect Scu-Batsuit, Raging Batsuit or the Bat-Pack Batsuit minifigure bodies for Batman™ from the rotating wardrobe.\nThe Batboat has a minifigure cockpit, two spring-loaded missiles with secret trigger, four stud shooters and rear batwings.\nThe Penguin’s Duckmobile features a minifigure cockpit with adjustable lever, two dual stud shooters, 2 flick missiles and a rotating propeller.\nWeapons include Batman’s two Batarangs and the Hench-Penguins’ buzzsaws.\nAccessory elements include Batman’s cape and new-for-spring-2017 molded utility belt, breathing device, flippers, microphone and gold-colored cowl, The Penguin’s fur-style collar, umbrella and top hat, and Bruce Wayne’s glass.\nThis set offers an age-appropriate build and play experience for ages 8+.\nBatcave measures over 8” high, 15” (40 cm) wide and 7” long.\nBatboat measures over 2” high, 7” long and 4” wide.\nDuckmobile measures over 3” high, 4” long and 3” wide.","review_difficulty":"Average","set_name":"Batcave Break-in","overall_rating":4.7,"theme_name":"THE LEGO® BATMAN MOVIE","value_rating":4.3}