{"ages":"14+","list_price":280.539,"num_reviews":52.0,"piece_count":2294.0,"play_rating":3.3,"prod_desc":"Discover the secrets of the Silent Mary!","prod_long_desc":"Bring the magic of Disney’s Pirates of the Caribbean to your home with this impressive replica of the Silent Mary ghost ship. This highly detailed LEGO® model with over 2,200 pieces features a hinged bow section, opening skeleton hull with decay and destruction detailing, movable rudder, collapsible main mast and two further masts, long bowsprit with crow’s nest and mast, tattered sails, detailed quarterdeck, plus a rowboat with two oars and an array of weapons and accessory elements. This model provides a rewarding build and play experience, and the integrated stand makes it suitable for display in the home or office. Also includes eight minifigures: Captain Jack Sparrow, Henry, Carina, Lieutenant Lesaro, Captain Salazar, Officer Magda, Officer Santos and the Silent Mary Masthead, plus two detachable ghost sharks.\nIncludes eight minifigures: Captain Jack Sparrow, Henry, Carina, Lieutenant Lesaro, Captain Salazar, Officer Magda, Officer Santos and the Silent Mary Masthead, plus two detachable ghost sharks.\nFeatures a hinged bow section, opening skeleton hull with decay and destruction detailing, movable rudder, three masts including a collapsible main mast, long bowsprit with crow’s nest and mast, tattered sails, detailed quarterdeck, plus a rowboat with two oars.\nWeapons include two gray swords, three black swords and a pistol.\nAlso includes the Silent Mary Masthead’s shield and sword elements.\nAccessory elements include a compass, sextant, monocular, two brooms and a ship-in-a-bottle.\nSpecial elements include Captain Salazar’s hairpiece and a decorated Galileo Diary with printed cover and astronomy page.\nRaise the hinged bow section and open the skeleton hull to switch from sailing mode to attack mode.\nOpen the mid-hull section to access and release the ghost sharks.\nThis set includes over 2,200 pieces.\nThe Silent Mary with the main mast in vertical position measures over 18” high, 26” long and 8” wide, and over 14” wide with the main mast collapsed.","review_difficulty":"Average","set_name":"Silent Mary","overall_rating":4.5,"theme_name":"Disney™","value_rating":4.3}