{"ages":"7-14","list_price":23.3922,"num_reviews":11.0,"piece_count":96.0,"play_rating":3.4,"prod_desc":"Go retro with the LEGO® DIMENSIONS™ Midway Arcade™ Level Pack!","prod_long_desc":"Power-up your LEGO® DIMENSIONS™ experience with the Midway Arcade™ Level Pack, featuring a buildable Gamer Kid minifigure. Attach him to his LEGO® Toy Tag and place him on the LEGO® Toy Pad to bring him to life in the game, helping him to put the rogue Midway Arcade characters back where they belong. Add Gamer Kid's 3-in-1 G-6155 Spy Hunter or Arcade Machine to boost your gameplay, and rebuild them into alternative models for upgraded in-game abilities. This set includes a buildable Gamer Kid minifigure with his coin and soda can.\nIncludes a buildable Gamer Kid minifigure, coin and soda can along with decorations.\nAlso includes rebuildable 3-in-1 G-6155 Spy Hunter and Arcade Machine models.\nUnlocks over 20 Classic Arcade Games from Midway Arcade™ as an exclusive level.\nAll characters and models include a detachable LEGO® Toy Tag.\nRebuild the G-6155 Spy Hunter into The Interdiver and Aerial Spyhunter.\nRebuild the Arcade Machine into an 8-Bit Shooter and The Pixilator Pod.\nPlace each character and modelon the LEGO® Toy Pad and join the action in the game.\nActivate Gamer Kid's Stealth, Laser, Speed, Invulnerability and Super Strength abilities to solve puzzles and overpower enemies.\nCollect your favorite LEGO® DIMENSIONS™ characters and use them in-game together for a crazy mash-up multiverse.\nVisit LEGO.com\/DIMENSIONS for more information on this exciting LEGO® building and video-gaming experience. Ask your parents' permission before going online.\nLEGO® DIMENSIONS™ Starter Pack and internetconnection required.\nLEGO® DIMENSIONS™ expansion packs unlock additional content.\nLEGO® DIMENSIONS™ characters and vehicles are required to interact with the LEGO DIMENSIONS™ video game.\nG-6155 Spy Hunter stands over 1” high, 2” long and 1” wide (alternative 3-in-1 builds vary in size).\nArcade Machine measures over 2” high, 1” wide and 1” long (alternative 3-in-1 builds vary in size).","review_difficulty":"Average","set_name":"Midway Arcade™ Level Pack","overall_rating":3.2,"theme_name":"DIMENSIONS™","value_rating":3.7}