{"ages":"7-14","list_price":18.2878,"num_reviews":1.0,"piece_count":57.0,"play_rating":5.0,"prod_desc":"Fight crime in the night with the bold and brave Excalibur Batman™!","prod_long_desc":"Join Excalibur Batman™ from THE LEGO® BATMAN MOVIE in an epic quest to save the LEGO DIMENSIONS™ multiverse! Simply attach the minifigure to his LEGO Toy Tag and place him on the LEGO Toy Pad to bring him to life in the game, and then activate his special abilities to solve puzzles and battle enemies. Add the Bionic Steed and then rebuild it into the Bat-Raptor and Ultrabat to enhance your gameplay. This set includes an Excalibur Batman minifigure, 3-in-1 vehicle, and THE LEGO BATMAN MOVIE Adventure World with a Battle Arena.\nIncludes a buildable Excalibur Batman™ minifigure and rebuildable 3-in-1 Bionic Steed vehicle.\nCharacter and model includes a detachable LEGO® Toy Tag.\nRebuild the Bionic Steed into the Bat-Raptor and Ultrabat.\nPlace Excalibur Batman™ and his vehicle on the LEGO® Toy Pad to bring them to life in the game.\nActivate Excalibur Batman’s Batarang, Stealth and Sword Switching abilities.\nUnlocks THE LEGO BATMAN MOVIE Adventure World and Battle Arena.\nCollect your favorite LEGO® DIMENSIONS™ characters and use them in-game together for a mash-up multiverse of your favorite characters.\nVisit LEGO.com\/DIMENSIONS for more information on this exciting LEGO® building and video-gaming experience. Ask your parents’ permission.\nLEGO® DIMENSIONS™ Starter Pack and internet connection required.\nLEGO® DIMENSIONS™ expansion packs unlock additional content.\nLEGO® DIMENSIONS™ characters and vehicles are required to interact with the LEGO DIMENSIONS video game.\nBionic Steed measures over 3” high, 2” long and 1” wide (alternative 3-in-1 vehicle builds vary in size).","review_difficulty":"Average","set_name":"Excalibur Batman™ Fun Pack","overall_rating":5.0,"theme_name":"DIMENSIONS™","value_rating":5.0}