{"ages":"8-14","list_price":121.939,"num_reviews":71.0,"piece_count":717.0,"play_rating":4.7,"prod_desc":"Go on daring missions with Poe's X-Wing Fighter!","prod_long_desc":"Battle the forces of the First Order with Poe's X-Wing Fighter. This customized starfighter is packed with features, like the 4 spring-loaded shooters, 2 stud shooters, retractable landing gear, opening wings, opening cockpit with space for a minifigure and space behind for the BB-8 Astromech Droid. There's even a loader with weapon rack, extra missiles and ammunition, and a seat for a minifigure. So climb the access ladder, strap in and get ready to recreate your own great scenes from Star Wars: The Force Awakens! Includes 3 minifigures with assorted weapons and accessories: Poe Dameron, Resistance ground crew and a Resistance X-Wing Pilot, plus a BB-8 Astromech Droid.\nIncludes 3 minifigures with assorted weapons and accessories: Poe Dameron, Resistance ground crew and a Resistance X-Wing Pilot, plus a BB-8 Astromech Droid\nFeatures Poe's X-Wing Fighter, loader and an access ladder\nX-Wing Fighter features 4 spring-loaded shooters, 2 stud shooters, retractable landing gear, opening wings, opening cockpit with space for a minifigure and space behind for the BB-8 Astromech Droid\nLoader features a weapon rack, missiles, ammunition and a seat for a minifigure\nWeapons include 2 blaster pistols and a wrench\nAccessories include 3 helmets\nOpen the wings and get ready for combat!\nResupply with the loader\nFire up the engines, retract the landing gear and launch!\nIconic design\nRecreate fantastic scenes from Star Wars: The Force Awakens\nThe perfect addition to any LEGO® Star Wars collection\nPlay out exciting snow-planet battles against the 75100 First Order Snowspeeder\nMeasures over 4” high, 14” long and 12” wide with wings open and over 3” high with wings closed","review_difficulty":"Average","set_name":"Poe's X-Wing Fighter™","overall_rating":4.7,"theme_name":"Star Wars™","value_rating":4.1}