{"ages":"7-14","list_price":48.7878,"num_reviews":5.0,"piece_count":406.0,"play_rating":5.0,"prod_desc":"Power up for battle against the Lex Luthor™ Mech!","prod_long_desc":"Team up with the Justice League heroes to grab the Energy Infuser back from Cheetah™, with this LEGO® DC Super Heroes Lex Luthor™ Mech Takedown set. The mech features an opening minifigure cockpit\/escape pod, adjustable 6-stud rapid shooter and attachment points for 3 collectible Energy Infusers. This superhero toy for boys and girls also includes Batman's Bat-Glider with 2 stud shooters, the buildable green Energy Infuser, 5 minifigures, plus assorted translucent-orange Power Burst elements to customize your builds and minifigures.\nIncludes 5 minifigures: Lex Luthor™, Batman™ (in Rebirth Batsuit), Wonder Woman™, Firestorm™ and Cheetah™.\nLex Luthor™ Mech features an opening minifigure cockpit\/escape pod, posable legs, arms and fingers, adjustable 6-stud rapid shooter, buildable axe, attachment points for 3 collectible Energy Infusers, plus an attachment point for the Kryptonite prison featured in 76096 Superman™ & Krypto™ Team-Up.\nMech escape pod has foldout wings, an attachment point for an Energy Infuser and 2 detachable guns.\nBat-Glider features an attachment point for the Batman™ minifigure, 2 stud shooters and translucent-yellow light-style elements.\nIncludes 10 assorted translucent-orange Power Burst elements to customize your builds and minifigures.\nAlso includes the buildable green Energy Infuser.\nAttach the buildable red and blue Energy Infusers from the 76096 Superman™ & Krypto™ Team-up and 76098 Speed Force Freeze Pursuit sets to the Lex Luthor™ Mech.\nWeapons include Batman's Batarang, Wonder Woman’s lasso and Cheetah’s spear.\nBatman™ (in Rebirth Batsuit) minifigure is new for January 2018.\nConnect the 76096 Superman™ & Krypto™ Team-up Kryptonite prison to the Lex Luthor™ Mech for even more Justice League action.\nThis superhero toy for boys and girls is suitable for ages 7-14.\nLex Luthor™ Mech measures over 7” high, 1” long and 4” wide.\nEscape pod measures over 2” high, 1” long and 1” wide.\nBat-Glider measures over 2” high, 1” long and 4” wide.","review_difficulty":"Average","set_name":"Lex Luthor™ Mech Takedown","overall_rating":4.8,"theme_name":"DC Comics™ Super Heroes","value_rating":4.8}