{"ages":"8-14","list_price":129.1924,"num_reviews":8.0,"piece_count":1004.0,"play_rating":4.9,"prod_desc":"Stop Cull Obsidian and Ebony Maw stealing the Infinity Stone!","prod_long_desc":"Stage a LEGO® Marvel Super Heroes 76108 Sanctum Sanctorum Showdown between Iron Spider-Man, Iron Man and Doctor Strange and the super villains. This all-action set features a foldable, 3-level New York City building including Doctor Strange’s Sanctum Sanctorum, with an exploding wall function and hidden Infinity Stone element, plus a pizzeria and Peter Parker's apartment, both with exploding window functions. The rooftop has a minifigure-launch function and a water tower with minifigure-winch function for Iron Spider-Man. This superhero toy also includes a detachable street corner scene, plus 4 minifigures and a big figure with weapons and 20 Power Burst elements.\nIncludes 4 minifigures: Iron Spider-Man, Iron Man, Doctor Strange and Ebony Maw, plus a Cull Obsidian big figure.\nThis set features a 3-level New York City building including the Sanctum Sanctorum, pizzeria, Peter Parker’s apartment, 2 fire escapes, rooftop water tower, plus a detachable street corner scene.\nFold the building in or out and attach the street corner in different places for alternative formations.\nSanctum Sanctorum features an entrance hall with an opening door, weapon rack with an axe and sword, and an armchair; library with an exploding wall function, hidden Infinity Stone element and stand, bookshelves, opening chest with 2 daggers inside and weapon rack with a staff and spear; and Doctor Strange’s top-floor office with a new-for-March-2018 decorated Sanctum Sanctorum window, desk, bookshelves and buildable candlestick.\nExplode the wall to reveal the Infinity Stone.\nPeter Parker's apartment features an office with a desk and assorted elements including a computer, lamp and boxes, and a bedroom with a trapdoor function, exploding window function, bed and pizza element.\nExplode the window to reveal the spider web on the building wall.\nPizzeria features an opening door, exploding window function, pizza oven, buildable shawarma and assorted elements including a pizza, pizza peel and fire extinguisher.\nRooftop features a minifigure-launch function and water tower with winch function to send Iron Spider-Man in and out of battle on a ‘spider web string’.\nStreet corner features a newspaper stand with newspaper elements, trash can and assorted elements including a spider web with Iron Spider-Man’s cell phone and a pizza slice.\nThe new-for-March-2018 Cull Obsidian big figure comes with 2 buildable hammers.\nWeapons include Iron Spider-Man's Power Blast and Ebony Maw's Power Blast.\nIron Spider-Man comes with a backplate with 4 leg elements.\nAlso includes 10 assorted translucent-blue and 10 assorted translucent-orange Power Burst elements to customize your builds and minifigures.\nThe Iron Man, Iron Spider-Man and Ebony Maw minifigures are new for March 2018.\nRecreate thrilling scenes from the Marvel Super Heroes Avengers: Infinity War movie.\nMeasures over 11” high, 7” wide and 8” long.","review_difficulty":"Average","set_name":"Sanctum Sanctorum Showdown","overall_rating":5.0,"theme_name":"Marvel Super Heroes","value_rating":4.9}