{"ages":"6-12","list_price":231.9971,"num_reviews":35.0,"piece_count":888.0,"play_star_rating":4.7,"prod_short_desc":"Move heavy goods across LEGO® City with the Cargo Train!","prod_id":60052.0,"prod_long_desc":"Move heavy goods – and animals! – around the city with the super-powerful LEGO® City Cargo Train! This awesome motorized train with 4-channel, 7-speed, infrared remote control can transport almost anything. So it’s your job to make sure the cargo is in the right place at the right time to keep the city running smoothly. Attach the cattle wagon and 2 cargo wagons together and pull them around the circular rail track with the locomotive. Operate the forklift to move the pallets safely between the wagons and truck. Keep track of all the cargo leaving and arriving in the office at the impressive cargo train station. There you can use the sliding overhead crane with hook to move heavy cargo between vehicles or onto the ground. With so many play functions and cool features, this really is the ultimate set for train enthusiasts! Includes 4 minifigures: forklift driver, train driver, farmer and a truck driver.\nIncludes 4 minifigures: forklift driver, train driver, farmer and a truck driver\nCargo Train features a motorized locomotive with 8-channel, 7-speed infrared remote control, driver’s cabin with opening doors and dashboard, plus a cattle wagon and 2 cargo wagons\nCattle wagon features a cow, trough, bales of straw, bucket of milk and a strong fence with 2 gates\nFuel wagon features a fuel tank with chain, pallet with wheelbarrow and a forklift\nCable drum wagon features 2 large cable drums in holders and a lifting chain\nTruck features a driver’s cab with cup and a large flatbed for the fuel tank\nCargo train station features a sliding overhead crane with hook to load and unload heavy-duty cargo, office with computer and cup, sack barrow, trash bin and a fire extinguisher\nIncludes a full circular track with 20 curved rail tracks and 8 straight rail tracks\nAlso includes a forklift\nOperate the Cargo Train with the 7-speed infrared remote control\nAttach the wagons and drive the train around the curved track\nLoad and unload the cargo with the powerful forklift\nMove cargo from the train wagons to the truck at the cargo train station","review_difficulty":"Average","set":"Cargo Train","star_rating":4.4,"theme":"City","val_star_rating":3.8,"country":"PL"}