{"ages":"9-14","list_price":231.9971,"num_reviews":4.0,"piece_count":1413.0,"play_star_rating":4.0,"prod_short_desc":"Jump to lightspeed in the Millennium Falcon!","prod_id":75212.0,"prod_long_desc":"Travel with Han Solo, Chewbacca and their friends with the LEGO® Star Wars Kessel Run Millennium Falcon. This LEGO brick version of the iconic Corellian freighter from the Han Solo movie features a 2-minifigure cockpit with detachable canopy, 2 spring-loaded shooters, sensor dish, ramp, rotating top and bottom laser turrets with 2 gunner seats, plus a detachable escape craft. This amazing Star Wars toy also features opening hull plates for easy access to the detailed interior, which includes a cargo area with couch and Dejarik hologame table, bar, bunk, missile storage compartment, and a buildable hyperdrive with repair tools. Also includes 6 minifigures and a DD-BD droid.\nIncludes 6 minifigures: Han Solo, Chewbacca, Qi’ra, Lando Calrissian, Quay Tolsite and a Kessel Operations Droid, plus a DD-BD droid.\nFeatures a 2-minifigure cockpit with detachable canopy, 2 spring-loaded shooters, sensor dish, ramp, rotating top and bottom laser turrets with 2 minifigure gunner seats, detachable escape craft and opening hull plates for easy access to the detailed interior.\nInterior includes a cargo area with 2 containers, navigation computer, couch and Dejarik hologame table, a bar, bunk, missile storage compartment, and a hyperdrive with repair tools.\nWeapons include 2 blaster pistols, a blaster rifle and Lando’s blaster.\nAlso includes electrobinoculars.\nOpen up the hull plates and play out adventures from the Han Solo movie inside.\nPlay Chewbacca at Dejarik… but remember he's a sore loser!\nThis LEGO® Star Wars toy is suitable for ages 9-14.\nMeasures over 4” high, 18” long and 11” wide.","review_difficulty":"Average","set":"Kessel Run Millennium Falcon™","star_rating":4.0,"theme":"Star Wars™","val_star_rating":3.8,"country":"PL"}