{"ages":"11-16","list_price":189.9924,"num_reviews":22.0,"piece_count":2595.0,"play_star_rating":4.5,"prod_short_desc":"Discover innovative design with the Mack Anthem truck and trailer!","prod_id":42078.0,"prod_long_desc":"Explore state-of-the-art engineering and design with this authentic LEGO® Technic replica of the Mack Anthem truck and trailer. Developed in partnership with Mack® Trucks Inc., this model comes with an array of realistic technical details and functions, including front-axle steering, rear wheel drive and a 6 cylinder straight engine with working pistons and spinning radiator fan. The detachable trailer has extendable outriggers, working landing legs, synchronized crane arms with side loading capability, and a loadable container with lockable doors, while the accessible driver’s cab has opening doors, adjustable seats, detailed dashboard, steering wheel, sun visors and a bunk bed. This 2-in-1 advanced building set also features a Mack bulldog hood ornament, and can be rebuilt into a detailed replica of the iconic Mack LR garbage truck.\nFeatures authentically designed bodywork, front-axle steering, rear wheel drive, 6 cylinder straight engine with moving pistons and spinning radiator fan, detailed driver’s cab with opening doors, adjustable seats, steering wheel, dashboard, sun visors and a bunk bed, and adjustable wing mirrors.\nAlso features a detachable trailer with extendable outriggers, landing legs, synchronized crane arms and a container with lockable doors.\nIncludes special decorated elements and manufacturer´s logo, plus an iconic Mack® bulldog hood ornament and a collection of authentic stickers.\nCheck out the authentic gray, black, white and green color scheme.\nSteer the truck into position, lower the landing legs, extend the outriggers and operate the synchronized crane arms to side-load the container onto the trailer.\nLift the hood to reveal a detailed 6 cylinder straight engine with moving pistons and spinning radiator fan.\nOpen the side panels to access the fuel tanks.\nThis LEGO® Technic advanced building set is designed to provide an immersive and rewarding building experience.\nThis set includes over 2,590 pieces and is suitable for ages 11-16.\n2-in-1 model: rebuilds into a replica of the iconic Mack LR garbage truck.\nBuilding instructions for the Mack LR garbage truck are available at LEGO.com\/technic.\nMack Anthem truck and trailer with crane boom and landing legs extended measures over 10” high, 32” long and 7” wide, and over 8” high and 5” wide with the crane boom and landing legs retracted.\nMack LR measures over 7” high, 22” long and 6” wide with forks and container lowered, and over 12” high with forks and container raised.","review_difficulty":"Average","set":"Mack Anthem","star_rating":4.7,"theme":"Technic","val_star_rating":4.7,"country":"AU"}