{"ages":"7-14","list_price":54.8878,"num_reviews":5.0,"piece_count":259.0,"play_star_rating":4.8,"prod_short_desc":"Get spooky with Abby Yates and the Ghostbusters™!","prod_id":71242.0,"prod_long_desc":"Add more gameplay to your LEGO® DIMENSIONS™ experience with the Ghostbusters™ Story Pack, featuring Abby Yates. Simply attach the minifigure to her LEGO Toy Tag and place her on the LEGO Toy Pad to bring her to life in the game. Then use her special abilities to solve puzzles and battle enemies. Add the 3-in-1 Ecto-1 to boost your gameplay, rebuild it into the Ectozer and The PerfEcto for upgraded abilities in the game. This set includes a buildable Abby Yates minifigure with her Proton Blaster, a 3-in-1 vehicle, Zhu’s Chinese Restaurant gateway build, six new game levels, and an Adventure World with a Battle Arena.\nIncludes a buildable Abby Yates minifigure with her Proton Blaster, rebuildable 3-in-1 Ecto-1, and Zhu’s Chinese Restaurant gateway build.\nUnlocks six levels of action-packed Ghostbusters™ gameplay and an Adventure World with a Battle Arena.\nAll characters and vehicles include a detachable LEGO® Toy Tag.\nRebuild the Ecto-1 into the Ectozer and The PerfEcto.\nPlace Abby and her vehicle on the LEGO® Toy Pad and join the action in the game.\nActivate Abby's Charge Transfer and Intelligence Access abilities to move electricity between conduits and solve puzzles.\nCollect your favorite LEGO® DIMENSIONS™ characters and use them in-game together for a crazy mash-up multiverse.\nVisit LEGO.com\/DIMENSIONS for more information on this exciting LEGO® building and video-gaming experience. Ask your parents' permission.\nLEGO® DIMENSIONS™ Starter Pack and internet connection required.\nLEGO® DIMENSIONS™ expansion packs unlock additional content.\nLEGO® DIMENSIONS™ characters and vehicles are required to interact with the LEGO DIMENSIONS video game.\nThe Ecto-1 measures over 1” high, 2” long and 1” wide (alternative 3-in-1 vehicle builds vary in size).","review_difficulty":"Average","set":"Ghostbusters™ Story Pack","star_rating":4.2,"theme":"DIMENSIONS™","val_star_rating":3.6,"country":"NL"}