{"ages":"4-7","list_price":36.5878,"num_reviews":2.0,"piece_count":175.0,"play_star_rating":5.0,"prod_short_desc":"Tear it down and build it again!","prod_id":10734.0,"prod_long_desc":"Grab your hard hat and get to work on the LEGO® City construction site, featuring Easy to Build vehicles including a dump truck, digger with rotating back arm, and a demolition crane with wrecking ball, plus a building under construction. Designed for those new to construction play, LEGO Juniors sets are age-appropriate build and play experiences for children 4-7. Includes three minifigures.\nIncludes three construction crew minifigures.\nFeatures a dump truck, digger and demolition crane, plus a building under construction.\nDump truck features a minifigure cab and tilting open-box bed.\nDigger features an elevating front bucket and lifting back arm, and an opening cage on the minifigure cab.\nDemolition crane features a stand with a ladder at the back, rotating seat for a minifigure and a rotating arm with wrecking ball.\nBuilding includes a door with frame, roof and wall that can be knocked down with the demolition crane.\nTilt the dump truck back to unload the building materials.\nSwing the wrecking ball on the demolition crane to bring down the old building wall.\nLoad the dump truck with the digger.\nAccessory elements include tools, two roadblock signs, cones, building bricks and a walkie-talkie.\nWith bigger pieces and a simple guide, these Easy to Build models get kids building and playing quickly.\nThis set offers an age-appropriate build and play experience for children 4-7.\nBuilding measures over 3” high, 1” wide and 1” long.\nDump truck with open-box bed down measures over 3” high, 5” long and 2” wide.\nDigger with arm raised measures over 5” high, 7” long and 2” wide.\nDemolition crane with ball retracted measures over 5” high, 3” long and 1” wide.","review_difficulty":null,"set":"Demolition Site","star_rating":5.0,"theme":"Juniors","val_star_rating":4.0,"country":"NL"}