{"ages":"14+","list_price":609.9878,"num_reviews":85.0,"piece_count":4016.0,"play_star_rating":4.5,"prod_short_desc":"Win the battle for the Empire with the awesome Death Star!","prod_id":75159.0,"prod_long_desc":"Reenact amazing scenes from the Star Wars saga with the Empire’s ultimate planet-zapping weapon—the Death Star! With over 4,000 pieces, this fantastic model has a galaxy of intricate and authentic environments, including a superlaser control room, Imperial conference chamber, hangar bay with moving launch rack and Lord Vader’s TIE Advanced with space for Vader inside, Emperor Palpatine’s throne room, Droid maintenance room, detention block, trash compactor, tractor beam, cargo area, turbo laser with spring-loaded shooters and seats for the 2 Death Star Gunners, and 2 movable turbo laser towers. This fantastic set also includes 23 iconic minifigures and 2 Droids to ensure hours of Star Wars battle fun.\nIncludes 23 minifigures: Grand Moff Tarkin, Darth Vader, Emperor Palpatine, Imperial Navy Officer, Imperial Officer, 2 Stormtroopers, 2 Death Star Troopers, 2 Emperor's Royal Guards, 2 Death Star Gunners, Death Star Droid, Obi-Wan Kenobi, Chewbacca, Princess Leia, C-3PO, Han Solo, Han Solo (disguise), Luke Skywalker (Tatooine), Luke Skywalker (disguise) and Luke Skywalker (final duel), plus R2-D2, an Imperial Astromech and a Dianoga trash compactor monster.\nFeatures a superlaser control room, Imperial conference chamber, hangar bay with moving launch rack and detachable TIE Advanced with space for Lord Vader inside, Emperor Palpatine’s throne room, Droid maintenance room, detention block, trash compactor, tractor beam, cargo area, turbo laser with spring-loaded shooters and seats for the 2 Death Star gunners, and 2 movable turbo laser towers.\nWeapons include 3 Lightsabers, 4 blasters, 3 blaster pistols, 4 blaster rifles, 2 force pikes, 2 Force Lightning elements and a bowcaster.\nLoad up and fire the turbo laser’s spring-loaded shooters to keep the rebels at bay.\nManeuver Lord Vader’s TIE Advanced into position and prepare for launch.\nBattle the Royal Guard in the throne room and then take on Palpatine himself!\nHelp Leia escape from the detention block and swing to safety with Luke across the chasm!\nWill Obi-Wan shut down the tractor beam and help the rebels defeat the Empire?\nCan you spot the Dianoga trash compactor monster?\nRecreate other unforgettable scenes from the classic Star Wars films.\nThe perfect addition to any LEGO® Star Wars collection.\nThis set offers an age-appropriate building experience for ages 14 and over.\nMeasures over 16” high, and 16” wide.","review_difficulty":"Challenging","set":"Death Star™","star_rating":3.9,"theme":"Star Wars™","val_star_rating":3.5,"country":"PT"}