{"ages":"6-12","list_price":120.6929,"num_reviews":3.0,"piece_count":792.0,"play_star_rating":3.3,"prod_short_desc":"Sail the high seas and make a thrilling rescue!","prod_id":60167.0,"prod_long_desc":"Strap on your life vest as part of the LEGO® City crew at the Coast Guard Headquarters with 2 levels, office rooms and a moving radar dish. There’s also a ship with opening bridge and deck, moving radar dish and searchlight, medical area and a rescue craft with launch function, as well as a helicopter with helipad, speedboat and a buildable buoy. Includes 7 minifigures, plus shark and octopus figures.\nIncludes 7 minifigures: 6 coast guard members (three shipmates, 2 helicopter crewmates, one headquarters crewmate) and a sailor, plus 2 animal figures: a shark and an octopus.\nFeatures a 2-level observation headquarters, coast guard ship, helicopter with helipad, speedboat and a buildable buoy.\nHeadquarters features a moving radar dish, antennas and office rooms.\nCoast guard ship features an opening deck and bridge, moving radar and searchlight, medical area below the deck with stretcher and equipment, and a rescue craft with launch function.\nHelicopter features spinning rotors, pontoons, opening 3-minifigure cockpit, plus a helipad.\nSpeedboat features dual drop-down motors and 2 water elements.\nBoth boats float!\nFire the ‘flare’ element from the flare launcher by pushing down the small lever.\nSpin the rotors on the helicopter to take off from the helipad.\nLift the hook attached to the rescue craft to launch it from the ship..\nAccessory elements include a flare launcher with red ‘flare’ element, several life preservers, life vests, 2 walkie-talkies, binoculars, 2 coffee mugs, coffee machine and computers.\nCoast Guard ship measures over 8” high, 16” long and 3” wide.\nSpeedboat measures over 2” high, 10” long and 2” wide.\nHelicopter with rotors measures over 3” high, 9” long and 7” wide.\nHelipad measures over 1” high, 7” wide and 6” long.\nObservation headquarters measures over 8” high, 7” wide and 5” long.\nBuoy measures over 3” high, 1” wide and 1” long.\nShark figure measures over 2” long.\nOctopus figure measures over 2” long.","review_difficulty":"Average","set":"Coast Guard Head Quarters","star_rating":3.7,"theme":"City","val_star_rating":3.3,"country":"NZ"}