{"ages":"10-16","list_price":174.7924,"num_reviews":18.0,"piece_count":1456.0,"play_star_rating":4.6,"prod_short_desc":"Divide the 4-in-1 Ultimate Batmobile and conquer the Super-Villains!","prod_id":70917.0,"prod_long_desc":"Team up with THE LEGO® BATMAN MOVIE characters Batman™, Batgirl™, Robin™ and Alfred Pennyworth™ (in Batsuit) to give the Super-Villains quadruple trouble with The Ultimate Batmobile! This amazing model divides into 4 separate vehicles: the Batmobile, Batwing, Bat-Tank and Batcycle. The Batmobile features foldout boosters and 4 stud shooters, while the Batwing has foldout wings and 2 spring-loaded shooters. The Batcycle has foldable wheels and the heavily-armored Bat-Tank boasts 2 hidden 6-stud rapid shooters. The set also includes the rotating Bat-Signal with a LEGO® light brick, Polka-Dot Man’s flying disc, plus 8 minifigures with assorted weapons and accessories to inspire endless role-play action.\nIncludes eight minifigures: Batman™, Robin™, Batgirl™, Polka-Dot Man™, Alfred Pennyworth™ (in Batsuit), Wicked Witch of the West and two Flying Monkeys.\nThis set features the 4-in-1 Ultimate Batmobile which divides into four separate vehicles: the Batmobile, Batwing, Bat-Tank and Batcycle. Also includes a buildable Bat-Signal.\nBatmobile features an opening minifigure cockpit, four stud shooters, two foldout boosters, two hidden non-shooting cannons, and translucent light-style elements.\nBatwing features an opening minifigure cockpit with dashboard details, two spring-loaded shooters, foldout wings, Bat-shaped tail wings, and translucent light-style elements.\nBat-Tank features an opening minifigure cockpit with dashboard details, big wheels, two hidden six-stud rapid shooters, opening armory compartment with control panel details, and translucent light-style elements.\nBatcycle features foldable wheels for riding and parking inside The Ultimate Batmobile.\nAlso includes Polka-Dot Man’s new-for-June-2017 flying disc.\nActivate the Bat-Signal’s LEGO® light brick to project the Bat symbol.\nWeapons include Batman™ and Batgirl’s Batarangs, Polka-Dot Man’s two polka dots and Alfred Pennyworth’s two swords.\nAccessory elements include Batman™, Robin™, Batgirl™, Alfred Pennyworth™ and Wicked Witch of the West’s capes, Batman and Batgirl’s molded utility belt, Polka-Dot Man’s helmet, Alfred Pennyworth’s hat, and Wicked Witch of the West’s hat and broomstick.\nThe Ultimate Batmobile measures over 4” high, 14” long and 6” wide.\nBat-Tank measures over 2” high, 6” long and 5” wide.\nBatwing measures over 3” high, 7” long and 7” wide.\nBatcycle measures over 1” high, 4” long and 1” wide.\nBatmobile measures over 3” high, 9” long and 4” wide.\nPolka-Dot Man’s flying disc measures over 1” in diameter.\nBat-Signal measures over 3” high, 2” wide and 2” long.","review_difficulty":"Average","set":"The Ultimate Batmobile","star_rating":4.6,"theme":"THE LEGO® BATMAN MOVIE","val_star_rating":4.6,"country":"AU"}