{"ages":"8-14","list_price":63.8929,"num_reviews":2.0,"piece_count":556.0,"play_star_rating":4.5,"prod_short_desc":"Get weaponized for a dynamic Killow vs. Samurai X duel!","prod_id":70642.0,"prod_long_desc":"Match Killow’s Oni Chopper against the Samurai X Mech in a battle for the Oni Mask of Deception, with this action-packed LEGO® NINJAGO® set. The Oni Chopper features a spinning front saw blade, flip-out blades and detachable skateboards for Killow, while the posable Samurai X Mech has a dual stud shooter, spinning blade and a detachable Samurai X blade. This cool toy for kids also includes 2 minifigures and a big figure with weapons to bolster the role-play battles.\nIncludes Samurai X and Jay minifigures, plus a Killow big figure.\nOni Chopper features a driver’s seat for Killow, spinning front saw blade, 2 flip-out blades, 2 detachable skateboards and a storage compartment with a spiked baseball bat.\nAttach the skateboards to Killow's feet and skate into battle.\nSamurai X Mech features an opening minifigure cockpit, posable arms and legs, gripping hands, dual stud shooter, spinning blade and a detachable Samurai X blade.\nDetach the Samurai X blade from the back of the mech and place it the mech’s gripping hand to attack.\nKillow big figure comes with a booster pack featuring 2 stud shooters, a booster and a flag element.\nAttach the Oni Mask of Deception transformation element to the Killow big figure to make him even more evil!\nWeapons include Jay's nunchucks and 2 katanas, and Samurai X's 2 katanas.\nSamurai X minifigure is new for January 2018.\nRecreate and role-play epic scenes from the NINJAGO® Masters of Spinjitzu TV show.\nThis cool toy for kids is suitable for ages 8-14.\nOni Chopper measures over 3” high, 12” long and 3” wide.\nSamurai X Mech measures over 5” high, 2” long and 3” wide, and 8” wide with arms spread.\nKillow big figure stands over 2” tall.\nKillow's booster pack measures over 3” high, 2” wide and 1” long.\nAs seen in the LEGO® Ride Ninja TV commercial.","review_difficulty":"Average","set":"Killow vs. Samurai X","star_rating":4.0,"theme":"NINJAGO®","val_star_rating":4.5,"country":"NZ"}