{"ages":"12+","list_price":79.2878,"num_reviews":7.0,"piece_count":597.0,"play_star_rating":3.7,"prod_short_desc":"Celebrate Shanghai with this LEGO® Architecture Skyline set!","prod_id":21039.0,"prod_long_desc":"Recreate Shanghai in China's blend of historical and modern architecture with this realistic 21039 LEGO® Architecture Skyline Collection model. This LEGO brick collectible toy features the city's iconic points of interest, including Chenghuang Miao Temple, Longhua Temple and Pagoda, Radisson Blu Hotel, Bund area, Oriental Pearl, World Financial Center, the Shanghai Tower and Huangpu River, and is finished with a decorative Shanghai nameplate. The LEGO Architecture Skyline Collection offers models suitable for display in the home and office, and has been developed for all with an interest in travel, architectural culture, history and design. Each set is scaled to give an accurate representation of the comparative size of each structure, with realistic color depiction.\nLEGO® Architecture interpretation of Shanghai, China.\nFeatures iconic attractions Chenghuang Miao Temple, Longhua Temple and Pagoda, Radisson Blu Hotel, Bund area, Oriental Pearl, World Financial Center and the Shanghai Tower.\nThe Huangpu River is represented in the tiled baseplate.\nThe included booklet contains information about the designer, architecture and history of each structure, as well as historical facts about Shanghai and its architectural heritage (English language only. Other languages available for download at LEGO.com\/architecture. Ask your parents before going online).\nIncludes a 4x32 tiled base with decorative Shanghai nameplate.\nRecreate the world's most dynamic cities with the LEGO® Architecture Skyline Collection.\nLEGO® Architecture celebrates the world of architecture through the medium of the LEGO brick, and is developed for all with an interest in travel, design, architecture and history.\nThis collectible souvenir toy includes over 595 pieces and is suitable for ages 12+.\nMeasures over 9” high, 11” wide and 2” long.","review_difficulty":"Average","set":"Shanghai","star_rating":4.9,"theme":"Architecture","val_star_rating":4.4,"country":"BE"}