{"ages":"7-12","list_price":63.8929,"num_reviews":null,"piece_count":488.0,"play_star_rating":null,"prod_short_desc":"Set up camp with Mia’s luxury camper van!","prod_id":41339.0,"prod_long_desc":"LEGO® Friends Mia’s Camper Van makes camping with friends a dream! Lift off the roof of this cool toy for kids for easy access to the kitchen and bathroom inside, flip open the lid of the upstairs sleeping area, put up the canopy and get to work on the tent with 2 beds inside. There's also a picnic table, an inflatable dinghy and a friendly horse for endless outdoor adventures! Includes 2 mini-dolls and a horse figure.\nIncludes Mia and Stephanie mini-doll figures, plus an Aria the horse figure.\nFeatures a camper van with opening roof, a cab to fit 2 mini-dolls, bathroom with toilet and basin, kitchen with refrigerator, cooker, sink and dining area, folding canopy, upstairs sleeping area with opening roof, a separate tent with 2 beds, plus a picnic bench and an outside area with tree, signposts and feeding station for the horse.\nAccessory elements include an inflatable dinghy, riding helmet, 2 walkie-talkies, 2 hot dogs, fruit bowl with fruit, ‘I love Heartlake City’ mug, cup, drinking bottle, frying pan, hairbrush, perfume bottle and a basket.\nDrive the camper van and find the perfect spot to set up camp with Mia and Stephanie.\nRemove the camper van roof for easy play inside.\nPrepare delicious hot dogs in the kitchen and enjoy them outside under the folding canopy of this cool toy for kids.\nTuck the mini-dolls into their beds in the sleeping area or tent camp beds.\nPut on the helmet and take the horse on an adventure through the surrounding countryside, or take the inflatable dinghy out for a ride!\nSuitable for ages 6-12.\nCamper van measures over 5” high, 8” long and 4” wide.\nTent measures over 1” high, 2” wide and 2” long.\nInflatable dinghy measures over 3” wide, 1” long and under 1” high.","review_difficulty":null,"set":"Mia's Camper Van","star_rating":null,"theme":"Friends","val_star_rating":null,"country":"NZ"}