{"ages":"7-14","list_price":121.9878,"num_reviews":6.0,"piece_count":267.0,"play_star_rating":4.7,"prod_short_desc":"With LEGO® Dimensions™, you're gonna need a bigger imagination!","prod_id":71171.0,"prod_long_desc":"The LEGO® DIMENSIONS™ Starter Pack has everything you need to set out on epic mash-up adventures filled with iconic worlds and unlikely allies as you've never seen them before. Build Batman™, Wyldstyle™ and Gandalf™, then attach them to the special LEGO Toy Tags and place them on the LEGO Toy Pad with buildable LEGO Gateway to bring them to life in the game. Add the buildable 3-in-1 Batmobile™ for extra in-game fun, and rebuild it into The Batblaster or a Sonic Batray to boost its in-game abilities. There's a whole multiverse of puzzles to solve, plus challenges and enemies to face, and when you're ready for more, collect Level, Team and Fun Packs from fan-favorite brands featuring buildable characters and rebuildable gadgets. This Starter Pack includes buildable Batman, Wyldstyle and Gandalf minifigures.\nIncludes buildable Batman™, Wyldstyle™ and Gandalf™ minifigures and 3-in-1 Batmobile™, each with a detachable LEGO® Toy Tag.\nRebuild the 3-in-1 Batmobile™ into The Batblaster and Sonic Batray for extra in-game abilities.\nAlso includes Batman's Batarang, Wyldstyle´s relic scanner and Gandalf's staff.\nActivate Batman's special Grapple, Boomerang and Stealth abilities; Wyldstyle's Relic Detector, Acrobat and Master Build abilities; and Gandalf's Magic, Magical Shield and Illumination abilities to crack puzzles and overpower enemies.\nPlace up to 7 LEGO® DIMENSIONS™ toys on the LEGO Toy Pad simultaneously and set out on exciting in-game adventures.\nCollect your favorite LEGO® DIMENSIONS™ characters and use them in-game together for a crazy mash-up multiverse.\nVisit LEGO.com\/DIMENSIONS for more information on this exciting LEGO® building and video gaming experience. Ask your parents' or guardians' permission before going online.\nPLAYSTATION® 4 game system with a minimum of 20GB available hard disk space and Internet connection required.\nCollect LEGO® DIMENSIONS™ Team, Level and Fun Packs to unlock additional content.\nLEGO® DIMENSIONS™ characters and vehicles are required to interact with the LEGO DIMENSIONS video game.\nLEGO® Toy Pad with Gateway measures over 6” high, 7” wide and 4” long.\nBatmobile™ measures over 1” high, 2” long and 1” wide (alternative 3-in-1 vehicle builds vary in size).","review_difficulty":"Average","set":"Starter Pack PLAYSTATION® 4","star_rating":4.3,"theme":"DIMENSIONS™","val_star_rating":4.0,"country":"AT"}