{"ages":"8-12","list_price":54.8878,"num_reviews":4.0,"piece_count":422.0,"play_star_rating":4.0,"prod_short_desc":"Enjoy awesome activities at the 3-in-1 Modular Skate House!","prod_id":31081.0,"prod_long_desc":"Create your dream location with the 3-in-1 Modular Skate House, featuring a detailed interior with radio, TV and sofa, plus a large outdoor skateboard ramp, monkey bars, climbing wall and a basketball hoop. You can also take a ride on a scooter or try your hand at some graffiti art. Mix and combine the buildable modules and easily swap the windows, door and other modular sections to customize the Modular Skate House with the LEGO® Creator modular system. This 3-in-1 construction toy also rebuilds into a Games Arcade with machines and a corner café or a Skate Park complete with an exciting skateboard track, and includes 2 minifigures, both ready for fun and adventure.\nIncludes 2 minifigures: a boy and a girl, both set for adventure.\nFeatures a detailed interior, skateboard ramp, monkey bars, climbing wall and a basketball hoop, plus a skateboard and scooter.\nThe Modular Skate House interior includes a TV, radio, sofa, and a poster featuring the LEGO® Creator Rocket Rally Car.\nFeatures a colorful facade with a red, beige, yellow, green, brown and gray color scheme.\nTake the scooter for a flying leap on the huge ramp, try your hand at wall climbing, swing on the monkey bars, display your skateboarding skills, shoot some hoops or catch some TV and hang out with your friends.\nMix and combine the easy-to-connect, buildable modules to create a rooftop skateboard ramp, and easily swap the windows, door and other modular sections to customize the Skate House with the LEGO® Creator modular system.\nContinue the adventure with this 3-in-1 model. Rebuild to create a Games Arcade with machines and a corner café or a Skate Park complete with a super skateboard track and TV camera.\nThis construction toy is suitable for ages 8-12.\nModular Skate House measures over 6” high, 9” wide and 5” long.\nGames Arcade measures over 2” high, 8” wide and 6” long.\nSkate Park measures over 2” high, 7” long and 7” wide.","review_difficulty":"Average","set":"Modular Skate House","star_rating":4.8,"theme":"Creator 3-in-1","val_star_rating":4.3,"country":"BE"}