{"ages":"2-5","list_price":27.2922,"num_reviews":null,"piece_count":39.0,"play_star_rating":null,"prod_short_desc":"Help toys feel better in Doc McStuffins’™ Backyard Clinic!","prod_id":10606.0,"prod_long_desc":"The Doc is in! Help Doc McStuffins™ and friends Lambie and Stuffy look after all her toys in the Backyard Clinic! Susie Sunshine is sick and needs Doc to make her feel better. Time for check-up with the medical tools to find out what the problem is. Lambie is on hand to pass a blanket or a bandage if they are needed. The special two-sided decorated brick can be turned around to show Susie sick and then when she is cured. When Doc’s work is done for the day, it’s time to play on the slide with allher friends! This LEGO® DUPLO® brand Doc McStuffins set provides endless role-play opportunities for young children to treat injured toys, while encouraging early construction skills through building and rebuilding the clinic.\nIncludes 1 LEGO DUPLO figure: Doc McStuffins with stethoscope plus Lambie and Stuffy\nFeatures an easy-to-build Backyard Clinic with a drawer, sink, window and a door\nAccessories include a blanket and a bandage\nIncludes bricks decorated with medical tools and Susie Sunshine as story starters\nTurn the double-sided decorated brick to first show Susie Sunshine while she is sick and then flip it over to magically make her better!\nHelp your child master basic building skills with this simple model\nBe creative, building and rebuilding the clinic however you like\nHelp Doc look after all the sick toys\nPlay on the slide with Lambie and Stuffy!\nDUPLO products are specially designed to be fun and easy for little hands\nCombine with 10605 Doc McStuffins Rosie the Ambulance for toys who need further treatment\nBackyard Clinic measures over 7\" high, 8\" wide and 6\" long","review_difficulty":null,"set":"Doc McStuffins™ Backyard Clinic","star_rating":null,"theme":"DUPLO®","val_star_rating":null,"country":"CA"}