{"ages":"7-14","list_price":24.99,"num_reviews":2.0,"piece_count":105.0,"play_star_rating":3.5,"prod_short_desc":"Fight off villains with Raven and Beast Boy in the Teen Titans Go!™ Team Pack!","prod_id":71255.0,"prod_long_desc":"Enjoy more LEGO® DIMENSIONS™ gameplay with the Teen Titans Go!™ Team Pack featuring Raven and Beast Boy! Simply attach the minifigures to their LEGO Toy Tags and place them on the LEGO Toy Pad to bring them to life in the game. Then use their special abilities to solve puzzles and battle enemies. Add the T-Car and Spellbook of Azarath to boost your gameplay, and then rebuild them into the Forklift and T-Plane or Raven Wings and Giant Hand for upgraded abilities in the game. This set includes buildable Raven and Beast Boy minifigures and their accessories, two 3-in-1 rebuildable vehicles, and an Adventure World with a Battle Arena.\nIncludes buildable Raven and Beast Boy minifigures, and rebuildable T-Car and Spellbook of Azarath.\nAll characters and models include a detachable LEGO® Toy Tag.\nRebuild the T-Car into the Forklift and T-Plane.\nRebuild the Spellbook of Azarath into the Raven Wings and Giant Hand.\nPlace each character and their vehicle on the LEGO® Toy Pad and join the action in the game.\nActivate Raven's telekinetic powers and jump into action with Beast Boy's transform abilities.\nUnlocks the Teen Titans Go!™ Adventure World and Battle Arena.\nCollect your favorite LEGO® DIMENSIONS™ characters and use them in-game together for a crazy mash-up multiverse.\nVisit LEGO.com\/DIMENSIONS for more information on this exciting LEGO® building and video-gaming experience. Ask for your parents' permission before going online.\nLEGO® DIMENSIONS™ Starter Pack and internet connection required.\nLEGO® DIMENSIONS™ expansion packs unlock additional content.\nLEGO® DIMENSIONS™ characters and vehicles are required to interact with the LEGO DIMENSIONS video game.\nThe Spellbook of Azarath measures over 3” high, 2” long and 2” wide (alternative 3-in-1 vehicle builds vary in size).\nThe T-Car measures over 1” high, 1” long and 1” wide (alternative 3-in-1 vehicle builds vary in size).","review_difficulty":"Easy","set":"Teen Titans Go!™ Team Pack","star_rating":4.0,"theme":"DIMENSIONS™","val_star_rating":3.5,"country":"US"}