{"ages":"7-14","list_price":11.6922,"num_reviews":4.0,"piece_count":59.0,"play_star_rating":4.0,"prod_short_desc":"Team up with LEGO® Chima’s™ Eris to outsmart the competition!","prod_id":71232.0,"prod_long_desc":"Let creativity be your guide to a building and gaming adventure—journey through unexpected worlds and team up with unlikely allies on a quest to defeat the evil Lord Vortech. Join Chima’s™ tactical warrior in a crazy mash-up multiverse of your favorite characters! Build and place Eagle Princess Eris on the LEGO® Toy Pad to launch her into the game, then activate her special Super Strength, CHI, Target and Flying abilities to solve puzzles and defeat enemies. Send in the Eagle Interceptor to helpher on her quest and rebuild it into an Eagle Skyblazer and Eagle Swoop Diver for upgdraded powers in the game!\nIncludes a buildable Eris minifigure with her axe and 3-in-1 Eagle Interceptor, both with a detachable LEGO Toy Tag.\nRebuild the 3-in-1 Eagle Interceptor into an Eagle Skyblazer and Eagle Swoop Diver for upgraded in-game abilities.\nPlace Eris and her 3-in-1 vehicle on the LEGO Toy Pad and set out on exciting in-game adventures.\nActivate Eris’ special Super Strength, CHI, Target and Flying abilities to solve puzzles and defeat enemies.\nCollect your favorite LEGO DIMENSIONS™ characters and use them in-game together for a crazy mash-up multiverse.\nVisit LEGO.com\/dimensions for more information on this exciting LEGO building and video-gaming experience.\nLEGO DIMENSIONS Starter Pack and internet connection required.\nLEGO DIMENSIONS expansion packs unlock additional content.\nLEGO DIMENSIONS characters and vehicles are required to interact with the LEGO DIMENSIONS video game.\nEagle Interceptor measures over 1” high, 2” long and 3” wide(alternative 3-in-1 vehicle builds vary in size).","review_difficulty":"Average","set":"LEGO® DIMENSIONS™ Eris Fun Pack","star_rating":3.8,"theme":"DIMENSIONS™","val_star_rating":3.0,"country":"CA"}