{"ages":"12+","list_price":101.3922,"num_reviews":77.0,"piece_count":734.0,"play_star_rating":4.3,"prod_short_desc":"Climb aboard the magical Winter Holiday Train!","prod_id":10254.0,"prod_long_desc":"Gather the family for some festive LEGO® building fun with this charming model featuring a full circle of track, boarding platform with bench and lamppost, a Power Functions upgradable train engine with brick-built smoke bellowing from its stack, coal tender, flatbed wagon with a rotating holiday tree, toys and gifts, and a red caboose with a detailed interior and table. The train engine also features large and small red-colored locomotive wheels and the train is decorated with green wreathes, string lights and white tree elements. This LEGO® Creator Expert set includes 5 minifigures.\nIncludes 5 minifigures: a locomotive driver, ticket collector, grandmother, boy and a girl.\nThe Winter Holiday Train includes 16 curved pieces of track, engine, coal tender, flatbed wagon with holiday tree, toys and gifts, caboose, boarding platform, bench and a lamppost.\nDecorate the Christmas tree and drive the train to see the tree rotate.\nJoin the ticket collector in the cozy caboose for a delicious cup of cocoa.\nGather the family for some festive LEGO® building fun!\nIncludes dual building instructions for a perfect family build.\nAccessory elements include green wreathes, decorative lights and white tree pieces, plus wrapped gift elements and tiny brick-built toys, including a micro train, wind-up car, fire truck, remote controlled robot, sailboat and a spaceship.\nUpgrade with LEGO® Power Functions (not included) for a motorized engine.\nTo motorize the engine, purchase items 8879, 8884, 88000, and 88002. Instructions can be found in the back of your building instructions.\nSpecial elements include small and large red train wheels, dark tan windows, train buffers, cow catcher, white tree elements and roller skates.\nThis set includes over 700 LEGO® pieces, including 16 curved tracks.\nThis set offers an age-appropriate building experience for ages 12+.\nThe Holiday Train in total measures over 4” high, 20” long and 2” wide.\nCurved rail track diameter measures over 27” .","review_difficulty":"Average","set":"Winter Holiday Train","star_rating":4.3,"theme":"Creator Expert","val_star_rating":4.1,"country":"CA"}