{"ages":"12+","list_price":77.9922,"num_reviews":51.0,"piece_count":902.0,"play_star_rating":3.8,"prod_short_desc":"Head home for the holidays with the Winter Village Station!","prod_id":10259.0,"prod_long_desc":"Head for home with the festive Winter Village Station holiday set, featuring a snowy railroad station with wreath adorned lampposts and clock tower, platform, mailbox, green trees, snowy grade crossing with twin barriers and lights, and a beautiful, festively decorated bus with opening doors and a luggage rack with removable luggage and gift wrapped packages. This LEGO® Creator Expert model also includes a ticket counter with a timetable and a transaction counter window with room for sliding out tickets to travelers, plus a coffee shop with a serving hatch and a detailed interior with an espresso machine, cups, cash register and a menu. Includes 5 minifigures.\nIncludes 5 minifigures: a bus driver, barista, grandmother, child and a ticket agent.\nThe festively adorned Winter Village Station features a snowy train station with a clock tower, platform, coffee shop, ticket counter, grade crossing with twin barriers and lights, lampposts, mailbox and green trees, plus a bus.\nTicket counter features a timetable and a transaction counter window with room for sliding out tickets.\nCoffee shop features a serving hatch and a detailed interior with espresso machine, cups, cash register and a menu.\nBus features festive decoration, opening doors, luggage rack with removable luggage and gift wrapped packages, and a removable roof for accessing the detailed interior.\nDrive the happy passengers to the station.\nRaise the barriers to cross the track.\nGrab a newspaper and relax with a warm espresso from the cozy coffee shop.\nMan the ticket booth, serve the travelers and slide the tickets under the serving window.\nGather the family for some festive LEGO® building!\nAccessories elements include buildable wreaths and wrapped gifts, plus 2 mugs, ticket, newspaper and an envelope.\nSpecial elements include new-for-October-2017 1x1 round plate with horizontal shaft, 4x6 roof element in dark blue, gray microphone element, printed ticket element and shield elements with printed clock-faces.\nThis set includes more than 900 pieces.\nIncludes 4 straight track pieces to connect with the LEGO® Creator Expert 10254 Winter Holiday Train.\nWinter Village Station measures over 7” high, 11” wide and 5” long.\nGrade Crossing when closed measures over 2” high, 5” wide and 5” long.\nBus measures over 3” high, 5” long and 2” wide.","review_difficulty":"Average","set":"Winter Village Station","star_rating":3.8,"theme":"Creator Expert","val_star_rating":3.4,"country":"CA"}