{"ages":"7-14","list_price":14.99,"num_reviews":1.0,"piece_count":56.0,"play_star_rating":5.0,"prod_short_desc":"It’s showtime! Bring Beetlejuice™ to life in the LEGO® DIMENSIONS™ multiverse for an eerie adventure!","prod_id":71349.0,"prod_long_desc":"Turn on the juice to see what shakes loose! Get ready for some spirited fun in the LEGO® DIMENSIONS™ multiverse with the Beetlejuice™ fun pack featuring Beetlejuice! Simply attach the minifigure to his LEGO Toy Tag and place him on the LEGO Toy Pad to bring him to life in the game, and then activate his special abilities to solve puzzles and battle enemies. Add the Saturn’s Sandworm for more ghostly powers, and then rebuild it into the Haunted Vacuum and Spooky Spider for additional combat abilities. This set includes a Beetlejuice minifigure, 3-in-1 Saturn’s Sandworm vehicle, and a Beetlejuice Adventure World with a Battle Arena.\nIncludes a buildable Beetlejuice™ minifigure and rebuildable 3-in-1 Saturn’s Sandworm vehicle.\nCharacter and model includes a detachable LEGO® Toy Tag.\nRebuild the Saturn’s Sandworm into the Haunted Vacuum and Spooky Spider.\nPlace Beetlejuice and his vehicle on the LEGO® Toy Pad to bring them to life in the game.\nActivate Beetlejuice's supernatural powers like Mind Control, Telekinesis and Spike Attack to scare away the living!\nUnlocks the Beetlejuice™ Adventure World and Battle Arena.\nCollect your favorite LEGO® DIMENSIONS™ characters and use them in-game together for a mash-up multiverse of your favorite characters.\nVisit LEGO.com\/DIMENSIONS for more information on this exciting LEGO® building and video-gaming experience. Ask for your parents' permission before going online.\nLEGO® DIMENSIONS™ Starter Pack and internet connection required.\nLEGO® DIMENSIONS™ expansion packs unlock additional content.\nLEGO® DIMENSIONS™ characters and vehicles are required to interact with the LEGO DIMENSIONS video game.\nSaturn’s Sandworm measures over 2” high, 1” long and 1” wide (alternative 3-in-1 vehicle builds vary in size).","review_difficulty":"Easy","set":"Beetlejuice™ Fun Pack","star_rating":5.0,"theme":"DIMENSIONS™","val_star_rating":5.0,"country":"US"}