{"ages":"7-14","list_price":14.99,"num_reviews":2.0,"piece_count":46.0,"play_star_rating":5.0,"prod_short_desc":"Help stop crime in the LEGO® DIMENSIONS™ multiverse with LEGO® City’s Fun Pack","prod_id":71266.0,"prod_long_desc":"Help save the LEGO® DIMENSIONS™ multiverse with Chase McCain from LEGO City! Simply attach the minifigure to his LEGO Toy Tag and place him on the LEGO Toy Pad to bring him to life in the game, and then activate his special abilities to solve puzzles and battle enemies. Add the Police Helicopter to boost your gameplay, and then rebuild it into the Police Hovercraft and Police Plane for upgraded in-game powers. This set includes a Chase McCain minifigure, 3-in-1 Police Helicopter vehicle, and a LEGO City Adventure World with a Battle Arena.\nIncludes a buildable Chase McCain minifigure and rebuildable 3-in-1 Police Helicopter vehicle.\nCharacter and model includes a detachable LEGO® Toy Tag.\nRebuild the Police Helicopter into the Police Hovercraft and Police Plane.\nPlace Chase McCain and his vehicle on the LEGO® Toy Pad to bring them to life in the game.\nActivate Chase McCain's LEGO® City Detective Scanner to track down bad guys.\nUnlocks the LEGO® City Adventure World and Battle Arena.\nCollect your favorite LEGO®DIMENSIONS™ characters and use them in-game together for a mash-up multiverse of your favorite characters.\nVisit LEGO.com\/DIMENSIONS for more information on this exciting LEGO® building and video-gaming experience. Ask your parents’ permission.\nLEGO® DIMENSIONS™ Starter Pack and internet connection required.\nLEGO® DIMENSIONS™ expansion packs unlock additional content.\nLEGO® DIMENSIONS™ characters and vehicles are required to interact with the LEGO DIMENSIONS video game.\nPolice Helicopter measures over 2.1” (5.5cm) high, 3.3” (8.5cm) long and 1.7” (4.5cm) wide (alternative 3-in-1 vehicle builds vary in size).","review_difficulty":"Average","set":"LEGO® City Fun Pack","star_rating":5.0,"theme":"DIMENSIONS™","val_star_rating":5.0,"country":"US"}