{"ages":"9-12","list_price":99.99,"num_reviews":null,"piece_count":1078.0,"play_star_rating":null,"prod_short_desc":"Rescue The Flash™ from Eclipso’s evil plans!","prod_id":41239.0,"prod_long_desc":"Join in the action-packed LEGO® DC Super Hero Girls™ world as Wonder Woman™ battles Eclipso™ to save The Flash™! This great set features a cool foldout palace with 2 levels, 4 ‘power drain’ tubes, planning room, vanity and weapons cabinets, Eclipso’s Jewel Jet, Wonder Woman’s Invisible Jet, loads of accessory elements, plus 3 orange Kryptomites.\nIncludes 3 mini-doll figures: Wonder Woman™, Eclipso™ and The Flash™, plus 3 orange Kryptomite™ figures.\nFeatures a foldout palace, opening tubes to hold The Flash™, Wonder Woman™ and other LEGO® DC Super Hero Girls™ characters, powering station in the center, planning room, vanity cabinet, weapons cabinet, a Kryptomite™ creation section and a separate Kryptomite training station.\nAlso includes Wonder Woman’s Invisible Jet with opening 2-mini-doll cockpit and Eclipso’s Jewel Jet with opening mini-doll cockpit.\nOpen the gate and unfold the palace to access the inside rooms and tubes.\nTrain the Kryptomites on the training station to help in the fight.\nOpen the tube to rescue The Flash™ before his powers are completely drained.\nUse the vanity cabinet or weapons cabinet and get ready for the battle.\nLift the Jewel Jet from the top of the palace to help Eclipso™ escape.\nAccessory elements include a staff, sword, flail, sai, Wonder Woman’s Lasso of Truth, Wonder Woman’s shield, laboratory bottles, lipstick, brush, perfume bottles, pickaxe, hammer and anvil, and 3 crystals.\nCombine with the 41237 Batgirl™ Secret Bunker and expand your Super Hero play!\nCute but evil Kryptomites are included in every LEGO® DC Super Hero Girls™ set.\nEclipso™ Dark Palace measures over 14” high, 10” wide and 5” long.\nKryptomite™ training station measures over 2” high, 1” wide and 1” long.\nInvisible Jet measures over 1” high, 6” long and 8” wide.\nEclipso’s Jewel Jet measures over 1” high, 7” long and 3” wide.","review_difficulty":null,"set":"Eclipso™ Dark Palace","star_rating":null,"theme":"DC Super Hero Girls","val_star_rating":null,"country":"US"}