{"ages":"4-7","list_price":27.438,"num_reviews":1.0,"piece_count":125.0,"play_star_rating":5.0,"prod_short_desc":"Swing into action with Spider-Man and catch the Scorpion!","prod_id":10754.0,"prod_long_desc":"Buckle up and join Spider-Man as he chases after the Scorpion in his Easy to Build Spidey-car with movable spider legs. This Spider-Man vs. Scorpion Street Showdown set also features a Scorpion car with movable pincers and tail, plus an alley wall with opening window, ramp that connects 2 ways, big web, flexible web ‘string' and a buildable catapult. The building toy set also includes a simple guide to build and play, with bigger starter pieces to help build confidence in younger children. Includes 2 minifigures.\nIncludes Spider-Man and Scorpion minifigures.\nFeatures an alley wall with rooftop, satellite dish and antenna, opening window, connections for the large web element and wall climbing, plus a detachable ramp that works both ways and a small buildable catapult.\nAlso includes 2 vehicles – a Spidey-car with extra legs, large rear spoiler and a connector on the front and back to attach the web ‘string', and a Scorpion-car with movable pincers and tail.\nClimb up the side of the alley wall to look for Scorpion’s car.\nHop in the Spidey-car and launch yourself up the ramp out of the alley to race after Scorpion.\nTurn the ramp around and chase the villain back into the alley.\nLaunch the web ‘balls’ at Scorpion’s car before you sling the big web and stop him.\nAccessory elements include 2 web ‘balls', trash can, stack of newspapers, large web element, a banana and a flexible web ‘string' that connects to the Spidey-car or Spider-Man's hand.\nThis exciting building toy is an age-appropriate build and play experience for ages 4-7.\nIncludes Easy to Build models with bigger starter pieces and Quick-Start bases, plus a simple guide to get children building and playing quickly.\nLEGO® Juniors sets are fully compatible with LEGO Marvel Super Heroes franchise sets.\nAlley measures over 4” high, 3” wide and 2” long.\nSpidey-car measures over 1” high, 3” long and 2” wide.\nScorpion car with tail raised measures over 3” high, 4” long and 2” wide.","review_difficulty":null,"set":"Spider-Man vs. Scorpion Street Showdown","star_rating":4.0,"theme":"Juniors","val_star_rating":4.0,"country":"CH"}