{"ages":"7-14","list_price":18.258,"num_reviews":3.0,"piece_count":55.0,"play_star_rating":4.0,"prod_short_desc":"Carry on your crime-fighting adventure with Michael Knight and K.I.T.T.!","prod_id":71286.0,"prod_long_desc":"Help save the LEGO® DIMENSIONS™ multiverse with Michael Knight from the classic 80s TV series, Knight Rider™! Simply attach the minifigure to his LEGO Toy Tag and place him on the LEGO Toy Pad to bring him to life in the game, and then activate his special abilities to solve puzzles and battle enemies. Add K.I.T.T. to boost your gameplay, and then rebuild it into the K.I.T.T. Jet and Goliath Armored Semi for upgraded in-game powers. This set includes a Michael Knight minifigure, 3-in-1 K.I.T.T. vehicle, and a Knight Rider™ Adventure World with a Battle Arena.\nIncludes a buildable Michael Knight minifigure and rebuildable 3-in-1 K.I.T.T. vehicle.\nCharacter and model includes a detachable LEGO® Toy Tag.\nRebuild K.I.T.T. into the K.I.T.T. Jet and Goliath Armored Semi.\nPlace Michael Knight and his vehicle on the LEGO® Toy Pad to bring them to life in the game.\nActivate Michael Knight’s hacking, dodging and dash abilities to solve puzzles and overpower enemies.\nUnlocks the Knight Rider™ Adventure World and Battle Arena.\nCollect your favorite LEGO® DIMENSIONS™ characters and use them in-game together for a mash-up multiverse of your favorite characters.\nVisit LEGO.com\/DIMENSIONS for more information on this exciting LEGO® building and video-gaming experience. Ask your parents’ permission.\nLEGO® DIMENSIONS™ Starter Pack and internet connection required.\nLEGO® DIMENSIONS™ expansion packs unlock additional content.\nLEGO® DIMENSIONS™ characters and vehicles are required to interact with the LEGO DIMENSIONS video game.\nK.I.T.T. measures over 2” high, 2” long and 1” wide (alternative 3-in-1 vehicle builds vary in size).","review_difficulty":"Easy","set":"Knight Rider™ Fun Pack","star_rating":4.0,"theme":"DIMENSIONS™","val_star_rating":3.7,"country":"CH"}