{"ages":"8-14","list_price":58.4922,"num_reviews":1.0,"piece_count":598.0,"play_star_rating":5.0,"prod_short_desc":"Run rings around the Krakenbeast with Aaron’s 3-in-1 Rock Climber!","prod_id":70355.0,"prod_long_desc":"Summon your courage for a beastly LEGO® NEXO KNIGHTS™ encounter and drive the futuristic 3-in-1 Rock Climber with detachable crossbow and mini-flyer after Lord Krakenskull on the buildable Krakenbeast monster with posable limbs and tail weapon. Includes 3 scannable shields, 3 minifigures, buildable Krakenbeast, plus Bouldron and Brickster figures.\nIncludes 3 minifigures: Aaron, an Aaron Bot and Lord Krakenskull, plus buildable Krakenbeast and a Bouldron and Brickster figure.\nAaron's Rock Climber features a detachable mini-flyer, detachable crossbow at the rear, 2 flick missiles, 2 minifigure cockpits, 4 large wheels with suspension system, weapon holder and a shield holder.\nKrakenbeast features posable limbs, opening jaw with monster teeth, movable tail, 2 wing elements, minifigure cockpit and a shield holder.\nDetach the rear crossbow machine, flip out the arms and fire the flick missiles at the enemy!\nRelease the mini-flyer and place the Aaron Bot in the cockpit for extra support.\nAttach the Bouldron to the tip of the Krakenbeast’s tail and use as a weapon.\nWeapons include Aaron’s crossbow, the Aaron Bot’s crossbow and Lord Krakenskull’s lightning sword.\nDownload the free LEGO® NEXO KNIGHTS™: MERLOK 2.0 app to your smartphone or tablet. Ask your parents’ permission.\nScan shields for the NEXO Powers Battle Cry and Slime Slugs and Forbidden Power Devastating Decay, and power up in the LEGO® NEXO KNIGHTS™ game!\nWatch all your favorite NEXO KNIGHTS™ characters on Cartoon Network.\nCombine the detachable crossbow with a LEGO® NEXO KNIGHTS™ Battle Suit to create an ultimate battle suit.\nAaron's Rock Climber measures over 4” high, 11” long and 6” wide in stealth mode, and over 9” wide and 7” high in attack mode.\nDetachable crossbow measures over 3” high, 3” long and 9” wide.\nMini-flyer measures over 1” high, 3” long and 3” wide.\nKrakenskull beast measures over 3” high, 7” long and 4” wide.","review_difficulty":"Average","set":"Aaron's Rock Climber","star_rating":5.0,"theme":"NEXO KNIGHTS™","val_star_rating":4.0,"country":"CA"}