{"ages":"5-12","list_price":76.752,"num_reviews":9.0,"piece_count":561.0,"play_star_rating":3.9,"prod_short_desc":"Protect the bank and stop the crooks!","prod_id":60140.0,"prod_long_desc":"Be part of the action with the LEGO® City police as they protect the bank’s safe and ATM from the crooks and their bulldozer, with a high security truck loaded with accessories, helicopter with searchlight, spinning rotors, plus the crooks’ bulldozer with chains and hooks. Includes five minifigures plus a police dog figure.\nIncludes five minifigures: a police officer, pilot, police specialist and two crooks, plus a police dog figure.\nFeatures a bank building, helicopter, truck and bulldozer.\nBank features two levels with a safe and ATM that can both be pulled from the walls, a waiting area on the first level and barred security gate on the second level that opens, drainpipe on the side of the building to climb up, entrance on the roof through a trapdoor, opening front door and a teller's desk. The safe has two compartments to hold money bills and the ATM opens on the back to hold money bills.\nPolice truck features opening rear doors and space in the back for gear.\nCrooks’ bulldozer features a front blade plow, moving tracks, chain and a hook.\nPolice helicopter features spinning rotors, rotating searchlight and a rope to hold a minifigure.\nClimb up the drainpipe and enter the bank through the trapdoor on the roof.\nAttach the hook and chain from the bulldozer to the safe and rip it out of the wall.\nAccessory elements include four money bills, a mug, two sets of handcuffs, flashlight, crowbar and a hammer.\nThis set offers an age-appropriate build and play experience for ages 5-12.\nBank measures over 6” high, 5” wide and 2” long.\nHelicopter measures over 2” high, 6” long and 5” wide.\nPolice truck measures over 3” high, 6” long and 2” wide.\nBulldozer measures over 2” high, 4” long and 2” wide.","review_difficulty":"Easy","set":"Bulldozer Break-in","star_rating":3.3,"theme":"City","val_star_rating":3.6,"country":"CZ"}