{"ages":"7-14","list_price":18.258,"num_reviews":7.0,"piece_count":40.0,"play_star_rating":4.5,"prod_short_desc":"Set out on time-traveling adventures with Cyberman™ from Doctor Who!","prod_id":71238.0,"prod_long_desc":"Upgrade your LEGO® DIMENSIONS™ gameplay experience with the buildable Cyberman™ Fun Pack. Place the drone-like humanoid on the LEGO® Toy Pad to bring him to life in the game, then activate his hi-tech abilities to solve puzzles and take on the enemies in true Doctor Who style. Add the 3-in-1 Dalek to boost your gameplay, and rebuild it into a Fire ‘n Ride Dalek and Silver Shooter Dalek for upgraded in-game abilities. This set includes a buildable Cyberman minifigure.\nIncludes a buildable Cyberman™ minifigure and 3-in-1 Dalek with a detachable LEGO® Toy Tag.\nRebuild the 3-in-1 Dalek and rebuild it into a Fire ‘n Ride Dalek and Silver Shooter Dalek for upgraded in-game abilities.\nPlace Cyberman™ and his 3-in-1 model on the LEGO® Toy Pad and set out on exciting in-game adventures.\nActivate Cyberman’s special Mind Control, Hacking, Drone, X-Ray Vision, Silver LEGO Blowup, Technology and Dive abilities to solve puzzles and battle enemies.\nCollect your favorite LEGO® DIMENSIONS™ characters and use them in-game together for a crazy mash-up multiverse.\nVisit LEGO.com\/DIMENSIONS for more information on this exciting LEGO® building and video-gaming experience. Ask your parents’ permission before going online.\nLEGO® DIMENSIONS™ Starter Pack and internet connection required.\nLEGO® DIMENSIONS™ expansion packs unlock additional content.\nLEGO® DIMENSIONS™ characters and vehicles are required to interact with LEGO DIMENSIONS video game.\nDalek stands over 2” tall (alternative 3-in-1 builds vary in size).","review_difficulty":"Easy","set":"Cyberman™ Fun Pack","star_rating":4.6,"theme":"DIMENSIONS™","val_star_rating":4.3,"country":"CH"}