{"ages":"11-16","list_price":179.3922,"num_reviews":18.0,"piece_count":1977.0,"play_star_rating":4.3,"prod_short_desc":"Harness the awesome power of the CLAAS XERION 5000 TRAC VC","prod_id":42054.0,"prod_long_desc":"Explore the high-tech world of industrial farm machines with this authentic LEGO® Technic replica of the CLAAS XERION 5000 TRAC VC. This highly detailed 2-in-1 model has been designed to provide an immersive and rewarding build and play experience, and comes with an array of motorized functions including a rotating operator's cab, working crane arm and extendable outriggers. Manual functions include front-wheel, 4-wheel and crab steering, and a working crane claw. The model comes with the trademarked green, gray and red color scheme, detailed operator's cab, 4 huge tractor tires and a tree trunk element for extended play scenarios. It can also be rebuilt to create a CLAAS XERION 5000 TRAC VC with Silage Plow.\nFeatures a LEGO® Power Functions motor for an array of motorised functions, including a rotating cab, extendable outriggers and automated crane arm, plus huge tractor tyres, working crane claw and front-wheel, 4-wheel and crab steering.\nCheck out the authentic green, gray and red colour scheme.\nActivate the LEGO® Power Functions to operate the crane arm and extend the outriggers.\nTurn the motorised cab through 180° for reversed driving position.\nOpen and close the crane claw to grab and lift the huge tree trunk!\nThis LEGO® Technic model is designed to provide an immersive and rewarding building experience.\nThis set includes over 1,950 pieces and offers an age-appropriate building experience for ages 11-16.\n2-in-1 model: rebuilds into a CLAAS XERION 5000 TRAC VC with Silage Plow.\nCLAAS XERION 5000 TRAC VC with crane arm lowered measures over 11” high, 24” long and 7” wide, and over 14\" high with crane arm raised.\nCLAAS XERION 5000 TRAC VC with Silage Plow measures over 8” high, 20” long and 13” wide.","review_difficulty":"Challenging","set":"CLAAS XERION 5000 TRAC VC","star_rating":4.8,"theme":"Technic","val_star_rating":4.6,"country":"CA"}