{"ages":"9-14","list_price":101.3922,"num_reviews":17.0,"piece_count":1140.0,"play_star_rating":4.9,"prod_short_desc":"Roll into action with the NEXO KNIGHTS™ 2-in-1 battle castle!","prod_id":70317.0,"prod_long_desc":"Fold out the 2-in-1 Fortrex's walls to switch into the detailed headquarters play set, featuring a round table, training area, prison, kitchen and more. Includes 7 minifigures: Clay Moorington, Aaron Fox, Axl, Chef Eclair, Ash Attacker and 2 Scurriers.\nIncludes 7 minifigures: Clay Moorington, Aaron Fox, Axl, Chef Eclair, Ash Attacker and 2 Scurriers.\nThe Fortrex features 2 rapid-fire stud shooters on the front; a disc shooter concealed under the drawbridge; 2 stud shooters on the drawbridge and 2 movable double laser cannon stud shooters.\nWeapons include Clay Moorington's grey sword and Techalibur, Aaron Fox's Blazer Bow stud shooter, Axl's Big Power Axe, Scurriers' spear and dynamite, and Ash Attacker's Magma Blade.\nAccessory elements include the Book of Evil, Merlok 2.0 character, Techalibur sword, shooting target, robot trainer with movable arms, ladders, toolkit, frying pan, cup, chicken leg, 3 helmets and Chef Eclair's chef hat!\nAaron Fox's Aero-Striker V1 flyer features a missile shooter and movable wings.\nAsh Attacker's Firesquito features a Globlin disc shooter.\nLower the drawbridge to launch Clay Moorington's Knight Cycle and pop up Aaron Fox's Aero-Striker V1.\nDetach the Aero-Striker V1 from The Fortrex.\nCapture the enemy and secure them in The Fortrex's prison.\nCastle walls easily open out to reveal the feature-packed LEGO® NEXO KNIGHTS™ headquarters, featuring a round table, training area, prison, kitchen and more.\nPlace Merlok 2.0 in the centre of the round table, and push him down to release 4 chairs, featuring shield holders.\nHelp Chef Eclair prepare a tasty snack for Axl and the hungry knights in the kitchen.\nPractice swordsmanship skills and improve your aim in the weapon training area.\nRepair Aaron Fox's Aero-Striker V1with the toolset and tools.\nThe Fortrex measures over 9” high, 8” wide and 9” long, and over 9” high, 14” wide and 9” long with walls folded out.\nClay's Knight Cycle measures over 1” high, 3” long and 2” wide.\nAaron Fox's Aero-Striker V1 measures over 2” high, 3” long and 5” wide.\nAsh Attacker's Firesquito measures over 1” high, 3” long and 1” wide.\nCombine with the attachable 70324 Merlok Library 2.0 for extra reinforcements!\nDownload the free LEGO® NEXO KNIGHTS™: MERLOK 2.0 app to your smartphone or tablet. Ask your parents' permission first.\nScan shields for each of the 5 NEXO Powers (Ground Pound, Super Human Speed, Hawk Holler, Chicken Power and Charging Attack) and power up in the LEGO® NEXO KNIGHTS™ game!\nWatch all your favorite NEXO KNIGHTS™ episodes on Cartoon Network.","review_difficulty":"Challenging","set":"The Fortrex","star_rating":4.9,"theme":"NEXO KNIGHTS™","val_star_rating":4.9,"country":"CA"}