{"ages":"8-14","list_price":69.5278,"num_reviews":null,"piece_count":569.0,"play_star_rating":null,"prod_short_desc":"Drop in for a surprise attack with Aaron’s X-bow!","prod_id":72005.0,"prod_long_desc":"Launch an attack on VanByter No. 307 and the CyberByter with Aaron’s X-bow, featuring rotating blades, crossbow and dual flick missiles. Use the X-bow’s dropship function to release Robin’s Knight Raider featuring dual stud shooters, and then rescue him from the battlefield for a speedy escape. This fun toy for kids includes 3 minifigures, a CyberByter figure and 3 scannable shields.\nIncludes 3 minifigures: Aaron, Robin and VanByter No. 307, plus a CyberByter figure.\nAaron's X-bow features a dropship function, dual rotating blades, minifigure cockpit, dual flick missiles and a shield holder.\nRobin’s Knight Raider features dual stud shooters and a shield holder.\nCritter Flyer features 2 movable wings and dual critter shooters.\nPlace Aaron's X-bow on Robin's Knight Raider and press the tail button to activate the dropship function.\nWeapons include Aaron's crossbow, Robin’s hammer, the CyberByter’s infection-spreading crossbow shooter and a spear.\nPlace the Merlok Power in the shield holder to upgrade your knight or vehicle in the battle against the bad guys!\nDownload the free LEGO® NEXO KNIGHTS™: MERLOK 2.0 app to your smartphone or tablet. Ask your parents before going online.\nScan shields for the NEXO Powers Manic Pumpkin and Goose Bumps, and Merlok Power The Hammer of Merlok, and power up in the LEGO® NEXO KNIGHTS™ game!\n7 Merlok Powers to collect to stop Monstrox and his army from spreading their digital infection across Knighton.\nThis fun toy for kids is suitable for ages 8-14.\nAaron’s X-bow measures over 3” high, 12” long and 16” wide.\nRobin’s Knight Raider measures over 1” high, 5” long and 1” wide.\nCritter Flyer with minifigure measures over 1” high, 1” long and 3” wide.","review_difficulty":null,"set":"Aaron's X-bow","star_rating":null,"theme":"NEXO KNIGHTS™","val_star_rating":null,"country":"DE"}