{"ages":"4-7","list_price":38.352,"num_reviews":1.0,"piece_count":151.0,"play_star_rating":5.0,"prod_short_desc":"Swoop in with Batman™ and take on the Joker™!","prod_id":10753.0,"prod_long_desc":"Suit up and join Batman™ and Robin™ as they battle The Joker™ with an Easy to Build Batwing jet, featuring shooting functions in the wings, the Joker’s wacky hotrod, plus a Batcave with docking for the Batwing, jail cell and a control center. This fun construction toy set includes a simple guide to build and play, with bigger starter pieces to help build confidence in younger children. Includes 3 minifigures.\nIncludes Batman™, The Joker™ and Robin™ minifigures.\nFeatures the Batcave with viewscreen and integrated docking for the Batwing, small jail with opening door, plus a control center, as well as space for the grappling hook gun and Batarang, which can be attached to the Batcave.\nAlso includes the Batwing jet with shooting functions in the wings and an open cockpit, plus The Joker's hotrod with flame elements and a ball and chain element.\nConnect the jail and control center to the launchpad any way you like.\nSet the Batwing jet on top of the control center to dock it in the Batcave.\nPush the discs through the disc shooters on the wings to launch them at The Joker™.\nUse the grappling hook gun to hook onto The Joker’s mallet and take it away.\nIncludes Easy to Build models with bigger pieces and Quick-Start bases, plus a simple guide to get children building and playing quickly.\nLEGO® Juniors sets are fully compatible with all other LEGO sets.\nWeapons include Robin's grappling hook gun and The Joker’s mallet.\nAccessory elements include 3 Batdiscs, a Batarang and 2 sets of dynamite.\nThis fun construction toy is an age-appropriate build and play experience for ages 4-7.\nBatcave measures over 5” high, 6” wide and 3” long.\nBatwing jet measures over 1” high, 6” long and 6” wide.\nThe Joker's hotrod measures over 2” high, 3” long and 1” wide.","review_difficulty":"Easy","set":"The Joker™ Batcave Attack","star_rating":5.0,"theme":"Juniors","val_star_rating":5.0,"country":"CZ"}