{"ages":"8-14","list_price":36.5878,"num_reviews":null,"piece_count":369.0,"play_star_rating":null,"prod_short_desc":"Jet off with Macy for a Berserker Bomber battle!","prod_id":72003.0,"prod_long_desc":"Prepare for high-flying action with the Berserker Bomber, featuring a detachable winged eye, dual 6-stud tech infection shooters and movable wings, plus a detachable Vyro Suit for the MechaByter. Attach the jet pack to Macy and send Berserker flying back to Monstrox! This popular kids toy includes 2 minifigures, a MechaByter figure and 2 scannable shields.\nIncludes 2 minifigures: Macy and Berserker, plus a MechaByter figure.\nBerserker Bomber features dual 6-stud tech infection shooters, 2 movable wings, detachable eyeball element with translucent-green wings, weapon holders and a shield holder, plus the detachable and posable Vyro Suit with cockpit and 2 critter shooter arms.\nWeapons include Macy's Mace, Berserker's cleaver and the MechaByter's spear.\nAlso includes The Mace of Merlok shield holder.\nPlace the Merlok Power in the shield holder to upgrade your knight in the battle against the bad guys!\nDetach the Berserker Bomber’s winged eye and chase after Macy!\nPlace the MechaByter in the Vyro Suit, attach it to the base of the Berserker Bomber, and fly into battle.\nDownload the free LEGO® NEXO KNIGHTS™: MERLOK 2.0 app to your smartphone or tablet. Ask your parents' permission.\nScan shields for the NEXO Power Orbital Strike and Merlok Power The Mace of Merlok, and power up in the LEGO® NEXO KNIGHTS™ game!\n7 Merlok Powers to collect to stop Monstrox and his army from spreading their digital infection across Knighton.\nThis popular kids toy is suitable for ages 8-14.\nBerserker Bomber measures over 3” high, 9” long and 8” wide.\nVyro Suit stands over 3” high.\nMacy's Jet Pack measures over 2” high, 2” wide and 1” long.","review_difficulty":null,"set":"Berserker Bomber","star_rating":null,"theme":"NEXO KNIGHTS™","val_star_rating":null,"country":"DE"}