{"ages":"12+","list_price":48.7878,"num_reviews":14.0,"piece_count":386.0,"play_star_rating":4.1,"prod_short_desc":"Experience the grandeur of the Arc de Triomphe!","prod_id":21036.0,"prod_long_desc":"Capture the architectural elegance of one of the world’s best-known monuments with this impressive LEGO® Architecture interpretation of the Arc de Triomphe. This detailed model faithfully reproduces Paris’ iconic masterpiece, with statue-adorned pillars, sculptural reliefs and subtle coloring that adds warmth while emphasizing the model’s bold lines, curves and contours. It also includes a golden plate to represent the Tomb of the Unknown Soldier, a LEGO interpretation of the eternal flame and a decorative “Arc de Triomphe” nameplate. This LEGO brick model has been designed to deliver a pleasantly challenging and rewarding building experience for all with an interest in architecture, travel, history and design, and makes a perfect display piece for the home or office.\nLEGO® Architecture interpretation of the real-world architectural landmark, the Arc de Triomphe.\nFeatures statue-adorned pillars, sculptural reliefs and subtle coloring that adds warmth and emphasis to the model’s bold lines, curves and contours. Also includes a golden plate to represent the Tomb of the Unknown Soldier and a buildable LEGO® interpretation of the eternal flame.\nIncludes a decorative “Arc de Triomphe” nameplate.\nThe included booklet contains information about the design, architecture and history of the monument (French and English languages only. Other languages available for download at LEGO.com\/architecture\/booklet).\nLEGO® Architecture celebrates the world of architecture through the medium of the LEGO brick, and is developed for all with an interest in travel, architecture, history and design.\nDelivers a pleasantly challenging and rewarding building experience.\nMeasures over 4” high, 5” wide and 3” long.","review_difficulty":"Average","set":"Arc de Triomphe","star_rating":4.4,"theme":"Architecture","val_star_rating":3.6,"country":"DE"}