{"ages":"16+","list_price":215.952,"num_reviews":177.0,"piece_count":2262.0,"play_star_rating":4.4,"prod_short_desc":"Discover hidden clues and surprises at the Detective's Office!","prod_id":10246.0,"prod_long_desc":"Discover a world of mystery and adventure with the LEGO® Creator Expert Detective’s Office! Step through the open archway and into the barbershop, where seated customers are pampered in the reflection of a large wall mirror, while next door, competitors play pool and darts beneath the comforting whir of a rotating ceiling fan. Venture to the first floor and you’ll find the detective’s office, his desk strewn with clues, a safe containing valuable evidence and a concealed wall compartment. Then visit the adjacent bathroom, featuring a classic pull-chain toilet, before taking the stairway to the well-equipped kitchen, from where you can access the roof terrace, complete with large water tower. This latest addition to the LEGO Modular Building series is packed with unsurpassed detail and hidden surprises. Easy-to-remove roof and ceilings provide access to the delightful interior, while the exterior of the building features a decorative roofline and a beautifully designed façade. Can you solve the smuggling mystery? Includes 6 minifigures with assorted accessories: Detective Ace Brickman, Al the barber, dart player, pool player, police woman and a mysterious lady in red.\nIncludes 6 minifigures with assorted accessories: Detective Ace Brickman, Al the barber, dart player, pool player, police woman and a mysterious lady in red\nFeatures a pool hall, barbershop, detective’s office, bathroom, kitchen, water tower and a cat\nDetective’s office features a desk, assorted clues, brick-built lamp, filing cabinet, fan, safe, painting, concealed wall compartment, newspaper, menu, wanted poster and a wall lamp\nPool hall features a hinged, rotatable ceiling fan, pool table, printed dartboard, pool cues, pool balls and a drinking glass\nBarbershop features never-before-seen scissors and reflective mirror element, 2 wall lamps, barber’s chair, hinged cabinet, 2 mannequin heads and a broom\nBathroom features a detailed pull-chain toilet\nKitchen features a stove, barrel, table, cabinet, refrigerator, wall clock and a rolling pin\nAccessories include Ace Brickman’s brimmed hat, briefcase, magnifying glass and a police hat\nDetach the roof and floorsfor easy access\nSearch for hidden clues\nHelp Ace Brickman solve the mystery!\nSpecial elements include never-before-seen scissors and reflective mirror element, printed dartboard, wanted poster, 1x1 round plate with hole in black, painter’s roller in black, designing element 1x2x2 in dark gray, 1x2 bricks in light blue, 1x3 tiles in brown and a 32x32 base plate in brown\nDetective’s Office measures over 10” high, 9” wide and 9” long\nCollect and build an entiretown with the LEGO® Creator Expert Modular Building series: 10232 Palace Cinema and 10243 Parisian Restaurant","review_difficulty":"Challenging","set":"Detective’s Office","star_rating":4.6,"theme":"Creator Expert","val_star_rating":4.4,"country":"CZ"}