{"ages":"4-7","list_price":24.3878,"num_reviews":null,"piece_count":131.0,"play_star_rating":null,"prod_short_desc":"Race against Chopper Maroon for the treasure map!","prod_id":10755.0,"prod_long_desc":"Get your ninja on and help Zane recover the map! This thrilling set features Easy to Build pieces including a floating boat with turning steering wheel and a chain with hook, a motorbike, plus a temple with spinning obstacles, secret weapons and a map. This fun children's toy also includes a simple guide to build and play, with bigger starter pieces to help build confidence in younger children. Includes 2 minifigures.\nIncludes Zane and Chopper Maroon minifigures.\nFeatures a temple with ramps, a dock, spinning knives and snake obstacles, treasure map with stand and decorative staffs above the archway that double as secret weapons.\nAlso includes a motorbike and a boat with turning wheel, chain with hook, ice bolts and golden staff elements that double as secret weapons.\nThe boat floats!\nSpin the snakes and knives to slow down Chopper Maroon's bike.\nConnect the hook to the motorbike to stop Chopper Maroon from getting away with the map.\nPlace the map on the steering wheel of the boat to help lead you to the mask.\nWeapons include Zane’s golden katanas and Chopper Maroon’s red katana.\nIncludes 2 ‘floating’ firebombs and a treasure map element.\nThis fun children's toy is an age-appropriate build and play experience for ages 4-7.\nIncludes Easy to Build models with bigger starter pieces and Quick-Start bases, plus a simple guide to get children building and playing quickly.\nAll LEGO® Juniors sets are fully compatible with all other LEGO sets.\nBoat with golden staffs measures over 1” high, 7” long and 2” wide.\nTemple measures over 3” high, 7” wide and 3” long.\nMotorbike measures over 1” high, 3” long and under 1” wide","review_difficulty":null,"set":"Zane's Ninja Boat Pursuit","star_rating":null,"theme":"Juniors","val_star_rating":null,"country":"DE"}