{"ages":"6-12","list_price":77.88,"num_reviews":4.0,"piece_count":740.0,"play_star_rating":5.0,"prod_short_desc":"Load up the truck and deliver the goods!","prod_id":60169.0,"prod_long_desc":"Join the crew keeping the citizens of LEGO® City supplied with goods from the Cargo Terminal, featuring a truck with trailer, forklift with moving blades, telehandler with an opening cockpit and telescopic arm, gatehouse with raising barrier and sliding window, and a pallet storage rack plus 4 pallets of items, including a lawnmower and water scooter, and other fun accessories. Includes 4 minifigures.\nIncludes 4 minifigures: office worker, 2 cargo center workers and a truck driver.\nFeatures a truck with minifigure cab, trailer and space for 4 containers, a working forklift with minifigure cab and a telehandler with rotating, telescopic arm and minifigure cab.\nAlso includes a gatehouse with raising barrier and sliding window, a pallet storage rack that holds up to 4 pallets, plus a buildable lawn mower and water scooter.\nRaise the gatehouse barrier to let the truck in and out of the Cargo Terminal.\nPush down the lever on the back of the forklift blades to raise them.\nLoad the pallets into the containers or storage area with the forklift.\nTurn the knob on the back of the telehandler to raise the arm.\nHook the telehandler arm to a container to load it on the trailer.\nAccessory items include several LEGO® boxes, lawnmower attachments (shovel and mower blade), hand truck, broom, wrench, walkie-talkie, coffee machine and 4 mugs.\nTruck with trailer measures over 3” high, 15” long and 2” wide.\nForklift measures over 3” high, 4” long and 1” wide.\nTelehandler with arm extended measures over 5” high, 7” long and 2” wide.\nGatehouse with barrier lowered measures over 3” high, 5” wide and 5” long.\nStorage area measures over 4” high, 5” wide and 2” long.\nEach container measures over 2” high, 1” wide and 2” long.\nLawnmower measures over 1” high, 1” long and 1” wide.\nWater scooter measures over 1” long, 1” wide and under 1” high.\nLEGO® boxes combined measure over 1” wide, 1” long and under 1” high.","review_difficulty":"Average","set":"Cargo Terminal","star_rating":5.0,"theme":"City","val_star_rating":4.3,"country":"DN"}