{"ages":"8-14","list_price":69.99,"num_reviews":3.0,"piece_count":670.0,"play_star_rating":5.0,"prod_short_desc":"Protect the spell book from Burnzie in Axl's Tower Carrier!","prod_id":70322.0,"prod_long_desc":"Stage a battle between the highly posable Burnzie and Axl's Tower Carrier. Rotate the turret to target Burnzie and fire the dual spring-loaded shooters and disc shooter, then detach the turret to fold out the Tower Carrier's catapult, and access the storage vault with the Book of Fear and the Axl Bot in the control room. Also includes 4 scannable shields and 4 minifigures.\nIncludes 4 minifigures: Axl, 2 Axl Bots and an Ash Attacker, plus a buildable Burnzie big figure.\nAxl's Tower Carrier features a rotating, detachable gun turret with wheels plus dual spring-loaded shooters and a disc shooter, storage vault for the Book of Fear, hidden catapult, control room, plus 2 cockpits for Axl and an Axl Bot, and 4 concealed side storage areas for the Axl Bot weapons and tools.\nDetach the turret to place the Book of Fear inside the storage vault, reveal the control room and unfold the catapult.\nLift up the 4 wheel flaps to reveal the Axl Bots' repair tools and weapons.\nWeapons include Burnzie's hammer and disc shooter, Axl's axe, 2 Axl Bot axes and the Ash Attacker's sword.\nAccessory elements include the Book of Fear, 3 Globlin discs, 3 knight discs, Axl's helmet and shield, 2 Axl Bot helmets, the Ash Attacker's helmet and armor, and a hammer and wrench.\nThis set offers an age-appropriate building experience for ages 8-14.\nDownload the freeLEGO®NEXO KNIGHTS™: MERLOK 2.0 app to your smartphone or tablet. Ask your parents' or guardians' permission before going online.\nScan shields for each of the 4 NEXO Powers (Rock Throw, Incinerate, Stone Stun and Force Field) and power up in the LEGO® NEXO KNIGHTS™ game!\nWatch all your favorite NEXO KNIGHTS™ characters on Cartoon Network.\nAxl's Tower Carrier measures over 7” high, 9” long and 6” wide.\nAxl's Tower Carrier's detachable turret measures over 7” high , 4” long and 6” wide.\nBurnzie stands over 5” tall.","review_difficulty":"Average","set":"Axl's Tower Carrier","star_rating":5.0,"theme":"NEXO KNIGHTS™","val_star_rating":5.0,"country":"US"}