{"ages":"6-12","list_price":85.3878,"num_reviews":5.0,"piece_count":575.0,"play_star_rating":5.0,"prod_short_desc":"Train for the next big horse show at the Heartlake Riding Club!","prod_id":41126.0,"prod_long_desc":"Train and care for horses at the LEGO® Friends Heartlake Riding Club with rotating exerciser and adjustable-height jump. There's a stable for each horse, a changing room, cafeteria, loft bedroom and a range of riding and horse-care accessory elements. Includes Mia and Stephanie mini-doll figures, plus 2 horses and a mouse.\nIncludes Mia and Stephanie mini-doll figures in riding gear, plus a mouse and 2 horses: 1 black and 1 white with brown markings.\nFeatures a 2-story stable building with turning weather vane and a yard with rotating horse exerciser, practice jump with 2 height options, feeding and drinking trough, and a grooming station.\nFirst floor features 2 stables with opening doors, archway with trophy display, and a changing room with swing doors, toilet, sink and a helmet stand.\nSecond floor features opening windows, a cafeteria with table and benches for mealtimes, a loft area with 2 beds and a mouse house.\nRiding accessory elements include helmets, bridles, saddles, horse blankets and trophies.\nGrooming and feeding accessory elements include brushes, combs, 3 horse soap bottles, hair bows, bucket, fork, hay, apple and a carrot.\nDining accessory elements include cups, plate, bowl, 4 cherry pie slices, 2 watermelon slices, water bottle and cheese for the mouse.\nTurn the revolvingexerciser to warm up the horses, then set the practice jump to the right height.\nTake off the saddles and bridles and put blankets on the horses after a hard day of training.\nRelax with friends in the cafeteria and enjoy a slice of cherry pie and a cup of hot chocolate.\nThis set offers an age-appropriate building experience for ages 6-12.\nHorse Stables measure over 6” high, 12” wide and 5” long.\nCombine with the 41123 Foal's Washing Station and 41125 Horse Vet Tra iler to add to the Riding Club's facilities.","review_difficulty":"Average","set":"Heartlake Riding Club","star_rating":5.0,"theme":"Friends","val_star_rating":5.0,"country":"ES"}