{"ages":"7-14","list_price":23.88,"num_reviews":4.0,"piece_count":119.0,"play_star_rating":5.0,"prod_short_desc":"Bring the Wizarding World to life with Harry and Voldemort!","prod_id":71247.0,"prod_long_desc":"Enhance your LEGO® DIMENSIONS™ experience with the Harry Potter™ Team Pack, featuring Harry Potter and Lord Voldemort™. Simply attach the minifigures to their LEGO Toy Tags and place them on the LEGO Toy Pad to bring them to life in the game. Then use their special abilities to solve puzzles and battle enemies. Add the 3-in-1 Hogwarts™ Express and Enchanted Car to boost your gameplay, and then rebuild them into the Steam Warrior and Soaring Steam Plane or Shark Sub and Monstrous Mouth for upgraded abilities in the game. This set includes buildable Harry Potter and Lord Voldemort and their wands, two 3-in-1 vehicles, and an Adventure World with a Battle Arena.\nIncludes buildable Harry Potter™ and Lord Voldemort™ minifigures, and rebuildable Hogwarts™ Express and Enchanted Car.\nAll characters and models include a detachable LEGO® Toy Tag.\nRebuild the Hogwarts™ Express into the Steam Warrior and Soaring Steam Plane.\nRebuild the Enchanted Car into the Shark Sub and Monstrous Mouth.\nPlace each character and their vehicle on the LEGO® Toy Pad and join the action in the game.\nActivate Harry's magical spells such as Leviosa, Stupify and Expelliarmus to solve puzzles and fight off Death Eaters or Lord Voldemort’s Dark Arts spells.\nUnlocks the Harry Potter™ Adventure World and Battle Arena.\nCollect your favorite LEGO® DIMENSIONS™ characters and use them in-game together for a crazy mash-up multiverse.\nVisit LEGO.com\/DIMENSIONS for more information on this exciting LEGO® building and video-gaming experience. Ask your parents' permission.\nLEGO® DIMENSIONS™ Starter Pack and internet connection required.\nLEGO® DIMENSIONS™ expansion packs unlock additional content.\nLEGO® DIMENSIONS™ characters and vehicles are required to interact with the LEGO DIMENSIONS video game.\nThe Hogwarts™ Express measures over 1” high, 2” long and 1” wide (alternative 3-in-1 vehicle builds vary in size).\nThe Enchanted Car measures over 1” high, 2” long and 1” wide (alternative 3-in-1 vehicle builds vary in size).","review_difficulty":"Easy","set":"Harry Potter™ Team Pack","star_rating":5.0,"theme":"DIMENSIONS™","val_star_rating":4.3,"country":"DN"}