{"ages":"8-14","list_price":77.88,"num_reviews":6.0,"piece_count":765.0,"play_star_rating":3.8,"prod_short_desc":"Explore the mysterious Temple of Resurrection!","prod_id":70643.0,"prod_long_desc":"Help the ninja protect the Temple of Resurrection and prevent Lord Garmadon’s rebirth with this highly detailed LEGO® NINJAGO® set. The temple features an entrance gangway, opening walls, spider prison, revolving walls with hidden Oni masks and 2 trapdoor functions. Activate the roof's good-to-evil transformation function to reveal Lord Garmadon's resurrection chamber. This construction toy also includes 7 minifigures—and a ‘mysterious baby' element—to role-play battle scenes between the ninja and the Sons of Garmadon.\nIncludes 7 minifigures: Cole, Lloyd, Harumi, Hutchins, Mr. E, Chopper Maroon and Lord Garmadon, plus a ‘mysterious baby’ element.\nTemple of Resurrection features 2 levels, a roof with good-to-evil transformation function and Lord Garmadon’s resurrection chamber.\nLower level has blue water-style baseplates, reed elements, an entrance gangway, opening walls, buildable skeleton, opening minifigure-sized spider prison with spider element, crate with spear, sai, sword and kendo mask, plus 2 exterior flag elements.\nUpper level has a balcony with railings, 2 exterior lantern-style decorations, the 3 Oni masks—the Mask of Hatred, Mask of Deception and Mask of Vengeance—with 2 of the masks hidden behind revolving walls, and 2 trapdoor functions.\nActivate the good-to-evil roof transformation function to give the temple an evil facade and reveal Lord Garmadon's resurrection chamber with a plinth for the Lord Garmadon minifigure, plus 2 translucent flame elements.\nWeapons include Cole’s hammer and 2 katanas, Lloyd’s sword and 2 katanas, Hutchins’ stick, Mr. E’s 2 katanas and Chopper Maroon’s katana and wrench.\nRecreate and role-play epic scenes from the NINJAGO® Masters of Spinjitzu TV show.\nThis construction toy is suitable for ages 7-14.\nMeasures over 10” high, 7” wide and 6” long.\nAs seen in the LEGO® Ride Ninja TV commercial.","review_difficulty":"Average","set":"Temple of Resurrection","star_rating":4.2,"theme":"NINJAGO®","val_star_rating":4.2,"country":"DN"}