{"ages":"8-14","list_price":39.99,"num_reviews":null,"piece_count":530.0,"play_star_rating":null,"prod_short_desc":"Attack the Sons of Garmadon underground dojo in Spinjitzu style!","prod_id":70640.0,"prod_long_desc":"Crash into the S.O.G. Headquarters with the Lloyd Spinjitzu spinner and claim the Oni Mask of Hatred, with this action-packed LEGO® NINJAGO® set. The dojo features spinning weapons, movable sides and an Oni Bike to attack the spinner. Unleash the spinner to knock over rivals or the ATM and to smash through the dojo entrance to release the Oni Mask of Hatred element. This building toy also has 5 minifigures, including Zane as his undercover persona, Snake Jaguar.\nIncludes 5 minifigures: Lloyd, Snake Jaguar, Ultra Violet, Nails and Skip Vicious.\nS.O.G. Headquarters features movable sides for action play, an explode-function entrance with the Oni Mask of Hatred element and a ramp, spinning blade, spinning wheel with an attachment point for a minifigure, spinning hammers, ATM, ‘Sons of Garmadon' sign element, and a bike workshop with an Oni Bike.\nSpinjitzu spinner features a buildable LEGO® brick handle, spinner element with minifigure capsule and a rip cord.\nPlace a minifigure in the capsule, attach the spinner and pull the rip cord to spin or roll.\nGrab the handles on each side of the dojo to attack the spinner.\nUse the spinner to smash through the dojo entrance and release the Oni Mask of Hatred element.\nAttach the Oni Mask of Hatred transformation element to the Ultra Violet minifigure to make her even more evil!\nWeapons include Lloyd's shurikens, Snake Jaguar's 2 katanas, Ultra Violet's 2 sai, Nails' katana and Skip Vicious' katana and crowbar.\nSnake Jaguar minifigure is new for January 2018.\nRecreate and role-play epic scenes from the NINJAGO® Masters of Spinjitzu TV show.\nThis building toy is suitable for ages 8-14.\nS.O.G. Headquarters measures over 5” high, 12” wide and 8” long, and 27” wide when opened out fully.\nOni Bike measures over 1” high, 4” long and 1” wide.\nSpinjitzu spinner (without rip cord) measures over 5” high, 3” wide and 1” long.\nAs seen in the LEGO® Ride Ninja TV commercial.","review_difficulty":null,"set":"S.O.G. Headquarters","star_rating":null,"theme":"NINJAGO®","val_star_rating":null,"country":"US"}