{"ages":"7-14","list_price":36.5878,"num_reviews":3.0,"piece_count":308.0,"play_star_rating":5.0,"prod_short_desc":"Stage a high-speed bike showdown!","prod_id":70639.0,"prod_long_desc":"Match Zane’s bike against Mr. E’s Oni Bike and battle for the Oni Mask of Vengeance, with this exciting LEGO® NINJAGO® Street Race of Snake Jaguar set. Zane’s bike features 2 foldout gold-colored blades, 2 hidden stud shooters on a foldout detachable drone for ground-level or aerial attacks, while the Oni Bike is armed with chopping blades and 2 stud shooters. This cool toy for kids also includes a podium with Oni Mask of Vengeance and Demon Torso elements for the Mr. E minifigure to wear, plus 2 minifigures with weapons to intensify the role-play conflict.\nIncludes 2 minifigures: Zane and Mr. E.\nZane’s bike features a minifigure seat, 2 stud shooters on a foldout, detachable drone, 2 foldout gold-colored blades, a flag element and translucent, ice-blue elements.\nOni Bike features a minifigure seat, 2 chopping blades with spikes, 2 stud shooters, front wheel with spikes, 2 detachable swords and a ‘Sons of Garmadon' flag element.\nPush the Oni Bike along to make the blades chop.\nAlso includes a podium with the Oni Mask of Vengeance and Demon Torso transformation elements for Mr. E, plus 2 katanas.\nAttach the Demon Torso (with 2 extra arms) and Oni Mask of Vengeance to Mr. E to make him even more evil!\nIncludes Zane’s bow-and-arrow weapon.\nRecreate and role-play epic scenes from the NINJAGO® Masters of Spinjitzu TV show.\nThis cool toy for kids is suitable for ages 7-14.\nZane's bike measures over 3” high, 6” long and 2” wide.\nDetachable drone measures over 4” long and 3” wide, and under 1” high.\nOni Bike measures over 3” high, 7” long and 2” wide.\nPodium (including mask and torso) measures over 1” high, 1” wide and 1” long.\nAs seen in the LEGO® Ride Ninja TV commercial.","review_difficulty":"Average","set":"Street Race of Snake Jaguar","star_rating":4.7,"theme":"NINJAGO®","val_star_rating":4.3,"country":"ES"}