{"ages":"7-12","list_price":109.7878,"num_reviews":1.0,"piece_count":577.0,"play_star_rating":null,"prod_short_desc":"Escape from the rampaging Carnotaurus!","prod_id":75929.0,"prod_long_desc":"Flee the flying lava rocks and a deadly dinosaur on Isla Nublar, with this dramatic Carnotaurus Gyrosphere Escape play set inspired by Jurassic World™. Help Owen, Claire and Franklin make their escape in the Gyrosphere or truck, featuring a 2-seater cab with sunroof, stud shooter, mobile control center and Gyrosphere trailer with launch function. The overgrown Gyrosphere station has an exploding lava rocks function, Gyrosphere launcher and a dinosaur nest. This fun toy includes 3 minifigures and 2 dinosaur figures.\nIncludes 3 minifigures: Owen, Claire and Franklin, plus 2 dinosaur figures.\nFeatures a truck with a trailer and mobile control center, plus an overgrown Gyrosphere station.\nTruck features a 2-seater cab with sunroof and stud shooter, attached to a mobile control center with computer and cabinets, plus a detachable trailer with Gyrosphere launch function.\nOvergrown Gyrosphere station features 5 lava rocks, eruption function, dinosaur nest and a Gyrosphere launcher.\nCarnotaurus features posable limbs and snapping jaws.\nActivate the erupting lava function and help the heroes dodge the falling rocks!\nLaunch the Gyrosphere from the trailer or overgrown Gyrosphere launcher, and send it racing to escape the chasing Carnotaurus!\nAlso includes a tranquilizer gun.\nAccessory elements include a shovel and 3 dinosaur eggs.\nThis fun toy is suitable for ages 7-12.\nTruck measures over 4” high, 5” long and 3” wide.\nTrailer measures over 3” high, 5” long and 3” wide.\nCarnotaurus stands over 5” tall.\nOvergrown Gyrosphere station measures over 6” high, 4” wide and 7” long.\nGyrosphere measures over 2” across.","review_difficulty":null,"set":"Carnotaurus Gyrosphere Escape","star_rating":5.0,"theme":"Carnotaurus Gyrosphere Escape","val_star_rating":null,"country":"FR"}