{"ages":"10+","list_price":48.739,"num_reviews":31.0,"piece_count":230.0,"play_star_rating":4.1,"prod_short_desc":"Reimagine Disney’s TRON: Legacy movie scenes with LEGO® bricks!","prod_id":21314.0,"prod_long_desc":"Build, play and display with this futuristic LEGO® Ideas 21314 TRON: Legacy set from Disney, featuring 2 Light Cycles, each with minifigure seats and translucent-colored light-style elements, plus a divisible TRON grid with attachment points for the vehicles. Use the grid as a display base for the Light Cycles or split it in 2 to recreate the chase scene from Disney's TRON: Legacy movie. Alternatively, stage an Identity Disc battle between the 3 included LEGO minifigures—Sam Flynn, Quorra and Rinzler—on the grid. This construction toy includes a booklet with information about its fan creator and LEGO designers, plus the lowdown on Disney’s TRON: Legacy movie and its main characters.\nIncludes 3 LEGO® minifigures: Sam Flynn, Quorra and Rinzler.\nFeatures 2 buildable Light Cycles for Sam Flynn and Rinzler, and a TRON grid\/display base.\nSam Flynn’s Light Cycle features a minifigure seat, authentic features and assorted translucent-blue light-style elements, including power stream effects.\nRinzler's Light Cycle features a minifigure seat, authentic features and assorted translucent-orange light-style elements, including power stream effects.\nTRON grid\/display base features 2 detachable parts, attachment points for the 2 Light Cycles and translucent-blue elements.\nDivide the grid to recreate the Light Cycle chase scene from Disney’s TRON: Legacy movie, or use it to role-play the disc battle scene with the minifigures.\nIncludes Quorra's sword.\nAccessory elements include Sam Flynn and Quorra's blue Identity Discs, and Rinzler's 2 orange Identity Discs.\nAttach the discs to the back of each minifigure.\nThis construction toy includes a booklet with building instructions, information about the set’s fan creator and LEGO designers, and the lowdown on Disney’s TRON: Legacy movie and its main characters.\nEach Light Cycle measures over 1\" high, 6” long and 1” wide.\nTRON grid\/display base measures over 8” wide and 3” long.","review_difficulty":"Easy","set":"TRON: Legacy","star_rating":4.4,"theme":"Ideas","val_star_rating":3.7,"country":"FI"}