{"ages":"7-14","list_price":20.986,"num_reviews":7.0,"piece_count":38.0,"play_star_rating":4.1,"prod_short_desc":"Unleash magical powers with the Wicked Witch™ of the West from The Wizard of Oz™!","prod_id":71221.0,"prod_long_desc":"Add a touch of magic to your LEGO® DIMENSIONS™ gameplay with the buildable Wicked Witch™ Fun Pack. Place the infamous sorceress on the LEGO Toy Pad to bring her to life in the game, then activate her special abilities to solve puzzles and weave her magic over enemies. Use her 3-in-1 Winged Monkey™ to boost your gameplay, and rebuild it into a Battle Monkey and Commander Monkey for upgraded in-game abilities. Includes a buildable Wicked Witch minifigure with her broom.\nIncludes a buildable Wicked Witch™ minifigure with her broom and 3-in-1 Winged Monkey™, both with a detachable LEGO® Toy Tag.\nRebuild the 3-in-1 Winged Monkey™ into a Battle Monkey and Commander Monkey for upgraded in-game abilities.\nPlace the Wicked Witch™ and her 3-in-1 Winged Monkey™ on the LEGO® Toy Pad and set out on exciting in-game adventures.\nActivate the Wicked Witch's special Silver LEGO® Blow-up, Flying, Magic, Illumination, Mind Control and Magical Shield abilities to solve puzzles and battle enemies.\nCollect your favorite LEGO® DIMENSIONS™ characters and use them in-game together for a crazy mash-up multiverse.\nVisit LEGO.com\/DIMENSIONS for more information on this exciting LEGO® building and video-gaming experience. Ask your parents' or guardians' permission before going online.\nLEGO® DIMENSIONS™ Starter Pack and internet connection required.\nLEGO® DIMENSIONS™ expansion packs unlock additional content.\nLEGO® DIMENSIONS™ characters and vehicles are required to interact with the LEGO DIMENSIONS video game.\nWinged Monkey™ stands over 2” high (alternative 3-in-1 vehicle builds vary in size).","review_difficulty":"Easy","set":"Wicked Witch™ Fun Pack","star_rating":4.3,"theme":"DIMENSIONS™","val_star_rating":3.7,"country":"GB"}