{"ages":"10+","list_price":27.986,"num_reviews":33.0,"piece_count":231.0,"play_star_rating":4.4,"prod_short_desc":"Build, play and learn from inspiring women of NASA!","prod_id":21312.0,"prod_long_desc":"Explore the professions of some of the groundbreaking women in science, technology, engineering and mathematics (STEM) with the LEGO® Ideas Women of NASA set. It features minifigures of 4 pioneering women of NASA— astronomer and educator Nancy Grace Roman, computer scientist and entrepreneur Margaret Hamilton, astronaut, physicist and entrepreneur Sally Ride and astronaut, physician and engineer Mae Jemison—and 3 builds illustrating their areas of expertise. Role-play space exploration from planning to moon landing, beginning with the iconic scene from Massachusetts Institute of Technology in 1969 of Hamilton with software that she and her team programmed. Build the posable Hubble Space Telescope and launch a LEGO version of the Space Shuttle Challenger with 3 removable rocket stages. The set also includes a booklet about the 4 featured women of NASA, and the fan creator and LEGO designers of this fun and educational set.\nIncludes 4 minifigures: Nancy Grace Roman, Margaret Hamilton, Sally Ride and Mae Jemison.\nFeatures 3 LEGO® builds illustrating the areas of expertise of the 4 featured women of NASA.\nNancy Grace Roman’s build features a posable Hubble Space Telescope with authentic details and a projected image of a planetary nebula.\nMargaret Hamilton's build features a stack of book elements, representing the books of listings of Apollo Guidance Computer (AGC) onboard flight software source code.\nSally Ride and Mae Jemison’s build features a launchpad and Space Shuttle Challenger with 3 removable rocket stages.\nAlso includes printed nameplates for each of the 4 women featured in this set.\nGreat for role-playing space exploration missions.\nIncludes a booklet with building instructions, plus information about the 4 featured women of NASA, the set's fan creator and the LEGO designers.\nNancy Grace Roman's build measures over 2\" high, 3” wide and 2” long.\nMargaret Hamilton’s build measures over 2\" high, 3” wide and 1” long.\nSally Ride and Mae Jemison’s build measures over 4\" high, 3” wide and 2” long.","review_difficulty":"Easy","set":"Women of NASA","star_rating":4.6,"theme":"Ideas","val_star_rating":4.5,"country":"GB"}