{"ages":"7-14","list_price":41.986,"num_reviews":13.0,"piece_count":85.0,"play_star_rating":4.1,"prod_short_desc":"Puzzle through LEGO® DIMENSIONS™ Portal® 2 with Chell!","prod_id":71203.0,"prod_long_desc":"Take your LEGO® DIMENSIONS™ gameplay to the next level with this challenging Portal® 2 Level Pack. Build the game's iconic protagonist, Chell, and place her on the LEGO Toy Pad to bring her to life in an instantly recognizable Aperture Science Test Labs level filled with mind-bending puzzles, Thermal Discouragement Beams, Neurotoxins and GLaDOS, the antagonistic artificial life form. Add the 3-in-1 Companion Cube and Sentry Turret to boost your gameplay, and rebuild each into 2 alternative models for upgraded in-game abilities that might be just enough to help Chell escape the confines of her portal-filled world. Includes a buildable Chell minifigure with her portal gun.\nIncludes a buildable Chell minifigure with her portal gun and rebuildable 3-in-1 Sentry Turret and Companion Cube.\nUnlocks the exclusive Portal® 2 “A Portal 2 Adventure” level.\nMinifigure and models include a detachable LEGO® Toy Tag.\nRebuild the Companion Cube into a Laser Deflector and Gold Heart Emitter.\nRebuild the Sentry Turret into a Turret Striker and Flying Turret Carrier.\nPlace Chell and models on the LEGO® Toy Pad and join the action in the game.\nUse Chell's Acrobatand Portal Gun abilities to solve puzzles and battle enemies.\nPlay this exclusive level with any of your LEGO® DIMENSIONS™ characters.\nVisit LEGO.com\/DIMENSIONS for more information on this exciting LEGO® building and video-gaming experience. Ask your parents' or guardians' permission before going online.\nLEGO® DIMENSIONS™ Starter Pack and internet-connected console required to play this Level Pack.\nLEGO® DIMENSIONS™ expansion packs unlock additional content.\nLEGO® DIMENSIONS™ characters and vehicles are required to interact with the LEGO DIMENSIONS video game.\nSentry Turret measures over 2” high, 1” wide and 1” long (alternative 3-in-1 builds vary in size).\nCompanion Cube measures over 1” high, 1” wide and 1” long (alternative 3-in-1 vehicle builds vary in size).","review_difficulty":"Average","set":"Portal® 2 Level Pack","star_rating":4.1,"theme":"DIMENSIONS™","val_star_rating":3.9,"country":"GB"}