{"ages":"7-12","list_price":34.986,"num_reviews":2.0,"piece_count":374.0,"play_star_rating":4.0,"prod_short_desc":"Hit the slopes with the 3-in-1 Modular Winter Vacation set!","prod_id":31080.0,"prod_long_desc":"Enjoy active adventures with the Modular Winter Vacation set, featuring a cozy ski cabin with a rooftop ski slope, slalom flags, balcony with open fire, outdoor picnic bench and a shop with a detailed interior, cash register and a serving hatch from where customers can purchase ski equipment and drinks. You can mix and combine the buildable modules and easily swap the window, door and other modular sections to customize the ski cabin with the LEGO® Creator modular system. This 3-in-1 construction toy also rebuilds into a Bobsleigh Track with bobsleigh and camera or a Yeti Surprise, and includes 2 minifigures, both dressed for adventures in the winter landscape.\nIncludes 2 minifigures: a woman and a man, both dressed for adventures in the winter landscape.\nThe Modular Winter Vacation set features a cozy ski cabin with a rooftop ski slope, slalom flags, balcony with open fire, and a shop with a detailed interior, cash register and serving hatch, plus an outdoor picnic bench.\nFeatures an authentic white, brown and blue color scheme.\nPut on the helmet and skis and race down the slope to perform amazing jumps.\nCall at the ski cabin to buy equipment or a mug of cocoa, and then relax in the warmth of an open fire on the rooftop terrace.\nMix and combine the easy-to-connect, buildable modules to create a double ski slope, and easily swap the window, door and other modular sections to customize the Ski Cabin with the LEGO® Creator modular system.\nThis construction toy is suitable for ages 7-12.\nContinue the adventure with this 3-in-1 model. Rebuild it to create a Bobsleigh Track with bobsleigh, or a Yeti Surprise where a yeti is roaming near a toilet cabin.\nSki Cabin measures over 5” high, 21” wide and 7” long.\nBobsleigh Track measures over 4” high, 8” wide and 7” long.\nYeti Surprise measures over 3” high, 7” wide and 5” long.","review_difficulty":"Easy","set":"Modular Winter Vacation","star_rating":3.5,"theme":"Creator 3-in-1","val_star_rating":4.0,"country":"GB"}