{"ages":"7-12","list_price":30.4878,"num_reviews":8.0,"piece_count":356.0,"play_star_rating":4.0,"prod_short_desc":"Play all day on a 3-in-1 Poolside Holiday!","prod_id":31067.0,"prod_long_desc":"Enjoy a wealth of summer activities with the Poolside Holiday set, featuring a house with a red and tan color scheme, rooftop terrace with flowers and barbecue, and a garden area with trees, greenery, swimming pool and a table tennis table with rackets. Interior details include a guitar amplifier, flat-screen TV and a sofa. Mix and match the buildable modules to create a rooftop pool or a rooftop garden, and easily swap the window, door and other modular sections to customize the house with the new-for-June-2017 LEGO® Creator modular system. Combine this set with the 31068 and 31069 modular-system sets to create a dream house with endless build and play opportunities! This 3‑in‑1 LEGO Creator model can also be rebuilt to create a Skate Park Holiday or a Music Garage Holiday. Includes 2 minifigures.\nIncludes 2 minifigures: a girl and a boy.\nThe Poolside Holiday set features a colorful house with 2 large windows, red awnings, blue front door, rooftop terrace with pot plants and barbecue, and a garden area with fountain, trees, greenery, swimming pool, parasol, garden table, and a table tennis table with rackets.\nInterior details include a buildable flat-screen TV, sofa and guitar amplifier.\nTry your hand at the outdoor activities, including a pool, table tennis or skateboarding.\nMix and match the easy-to-connect, buildable modules to create a rooftop pool or a rooftop garden, and easily swap the window, door and other modular sections to customize the house with the new-for-June-2017 LEGO® Creator modular system.\nAccessory elements include a guitar and a buildable ice cream and swimming aid.\nCombine with the 31068 and 31069 LEGO® Creator modular buildings to create a dream house with endless build and play opportunities!\n3-in-1 model: rebuild to create a Skate Park Holiday or a Music Garage Holiday.\nPoolside Holiday measures over 4” high, 7” wide and 5” long.\nSkate Park Holiday measures over 5” high, 6” wide and 4” long.\nMusic Garage Holiday measures over 5” high, 5” wide and 4” long.","review_difficulty":"Average","set":"Modular Poolside Holiday","star_rating":4.6,"theme":"Creator 3-in-1","val_star_rating":4.9,"country":"IE"}