{"ages":"7-14","list_price":20.986,"num_reviews":1.0,"piece_count":56.0,"play_star_rating":4.0,"prod_short_desc":"Save the world before bedtime in the LEGO® DIMENSIONS™ multiverse with Buttercup™, the toughest fighter!","prod_id":71343.0,"prod_long_desc":"Fight crime and come just in time in the LEGO® DIMENSIONS™ multiverse with Buttercup™, the toughest fighter! Simply attach the minifigure to her LEGO Toy Tag and place her on the LEGO Toy Pad to bring her to life in the game, and then activate her special abilities to solve puzzles and battle enemies. Add the Mega Blast Bot to crush your foes, and then rebuild it into the Ka-Pow Cannon and Slammin’ Guitar for extra-awesome combat abilities. This set includes a Buttercup minifigure, 3-in-1 Mega Blast Bot vehicle, and The Powerpuff Girls™ Adventure World with a Battle Arena.\nIncludes a buildable Buttercup™ minifigure and rebuildable 3-in-1 Mega Blast Bot vehicle.\nCharacter and model includes a detachable LEGO® Toy Tag.\nRebuild the Mega Blast Bot into the Ka-Pow Cannon and Slammin’ Guitar.\nPlace Buttercup and her vehicle on the LEGO® Toy Pad to bring them to life in the game.\nActivate Buttercup's Super Strength and Flight to battle sinister evildoers.\nUnlocks The Powerpuff Girls™ Adventure World and Battle Arena.\nCollect your favorite LEGO® DIMENSIONS™ characters and use them in-game together for a mash-up multiverse of your favorite characters.\nVisit LEGO.com\/DIMENSIONS for more information on this exciting LEGO® building and video-gaming experience. Ask for your parents’ permission before going online.\nLEGO® DIMENSIONS™ Starter Pack and internet connection required.\nLEGO® DIMENSIONS™ expansion packs unlock additional content.\nLEGO® DIMENSIONS™ characters and vehicles are required to interact with the LEGO DIMENSIONS video game.\nMega Blast Bot measures over 2” high, 1” long and 2” wide (alternative 3-in-1 vehicle builds vary in size).","review_difficulty":"Easy","set":"The Powerpuff Girls™ Fun Pack","star_rating":5.0,"theme":"DIMENSIONS™","val_star_rating":5.0,"country":"GB"}