{"ages":"8-14","list_price":103.6878,"num_reviews":9.0,"piece_count":643.0,"play_star_rating":4.4,"prod_short_desc":"Launch a space mission from the Batcave!","prod_id":70923.0,"prod_long_desc":"Take off from the Batcave in The Bat-Space Shuttle with this fun-packed THE LEGO® BATMAN MOVIE set. The shuttle has a detachable triple-booster pack, 4 stud shooters and an opening rear compartment with a Bat-Moon Buggy for a minifigure to drive. The Batcave features a dock for the shuttle, Bat-Kayak with a rotating display stand, and a sliding costume rail with 3 detachable costume minifigures. This LEGO Batman™ toy also includes 6 minifigures with weapons to role-play, recreate and reimagine your favorite scenes from the smash-hit movie.\nIncludes 6 minifigures: Batman™, Dick Grayson™, Catwoman™, Reggae Man Batsuit, Space Batsuit and Firestarter Batsuit.\nThis action-packed set features The Bat-Space Shuttle, Bat-Moon Buggy, Batcave and Bat-Kayak.\nBat-Space Shuttle features a detachable triple-booster pack, a shuttle with an opening minifigure cockpit, 2 stud shooters on each wing, and an opening rear compartment containing the Bat-Moon Buggy with an adjustable antenna and minifigure seat.\nThe Batcave has a dock for the Bat Space Shuttle, Bat-Kayak with a rotating display stand, sliding costume rail with detachable Reggae Man Batsuit, Space Batsuit and Firestarter Batsuit minifigures, computer keyboard and screen elements, weapon rack with 2 Batarangs, 3 arrows and a grapple hook for the grappling gun, plus rotating ‘reflectors'.\nSlide the costume rail and choose from 3 different costume minifigures.\nWeapons include Batman's grappling gun and Catwoman's whip.\nReggae Man Batsuit, Space Batsuit and Firestarter Batsuit costume minifigures are new for January 2018.\nAdd this set to 70909 Batcave Break-in to create an extended Batcave.\nThis LEGO® Batman™ toy is suitable for ages 8-14.\nThe Bat-Space Shuttle measures over 4” high, 11” long and 7” wide.\nBat-Moon Buggy measures over 1” high, 1” long and 1” wide.\nBatcave measures over 5” high, 13” wide and 6” long.\nBat-Kayak measures over 1” high, 4” long and under 1” wide.","review_difficulty":"Average","set":"The Bat-Space Shuttle","star_rating":4.8,"theme":"THE LEGO® BATMAN MOVIE","val_star_rating":3.5,"country":"IE"}