{"ages":"7-12","list_price":109.7878,"num_reviews":4.0,"piece_count":871.0,"play_star_rating":5.0,"prod_short_desc":"Look after the sick and injured people of Heartlake City!","prod_id":41318.0,"prod_long_desc":"The LEGO® Friends Heartlake Hospital has 3 floors of medical rooms and equipment to help care for patients. There’s a nursery with crib and weighing scales, an x-ray suite with scanner and lightbox, and an examination room with a bed and microscope for checking samples. The downstairs waiting room has a reception desk and vending machine as well as an emergency entrance for those arriving by ambulance or helicopter. Includes 3 mini-doll figures plus a newborn baby figure.\nIncludes 3 mini-doll figures: Olivia in a nurse’s uniform, Henry and Dr. Patel, plus a newborn baby Ola figure.\nFeatures a 3-story, modular hospital, helicopter with stretcher, ambulance with wheeled stretcher, wheelchair, stroller, medical cart and a bicycle.\nHospital features a waiting room with sliding doors, reception desk, seating area, vending machine, water cooler and an aquarium; an emergency entrance with swing doors; an x-ray suite with a revolving bed, scanner, lightbox and skeleton; a nursery with rocking crib, weighing scales and bathroom area with changing table; an examination room with bed, heart monitor and microscope; and a helipad.\nAccessory elements include an arm cast, x-ray tiles, magnifying glass, sample bottles, scissors, wet floor sign and a feeding bottle.\nJump into action as the ambulance arrives and rush the patient through the emergency entrance.\nTake an x-ray of Henry’s arm and put his arm in a cast to heal.\nEnjoy feeding and weighing the newborn baby in the nursery.\nHelp the doctor treat the patients as she does her rounds with the medical cart.\nInvent endless stories around caring and nurturing people back to health.\nBuild and rebuild this modular set in many different ways.\nHospital measures over 10” high, 11” wide and 2” long.\nAmbulance measures over 2” high, 4” long and 1” wide.\nHelicopter with rotors measures over 2” high, 4” long and 1” wide.","review_difficulty":"Average","set":"Heartlake Hospital","star_rating":4.8,"theme":"Friends","val_star_rating":4.0,"country":"IT"}