{"ages":"5+","list_price":4.8678,"num_reviews":13.0,"piece_count":8.0,"play_star_rating":4.3,"prod_short_desc":"Discover new heroes and villains in LEGO® Minifigures—THE LEGO BATMAN MOVIE Series 2.","prod_id":71020.0,"prod_long_desc":"Bring exciting new play possibilities to existing LEGO® sets with LEGO Minifigures. This new, awesome lineup of exclusive, Limited Edition collectible characters makes a perfect addition to first THE LEGO BATMAN MOVIE series. Enjoy all-new action-packed adventures with Swimsuit Batman™, Vacation Robin™, Vacation The Joker™, Disco Harley Quinn™, Vacation Alfred Pennyworth™, Vacation Batgirl™, Doctor Phosphorus™, Clock King™, Mermaid Batman™, Killer Moth™, Jor-El™, General Zod™, Apache Chief™, Bat-Merch Batgirl™, Hugo Strange™, Disco Alfred Pennyworth™, Black Canary™, Black Vulcan™, Wonder Twin Zan™ and Wonder Twin Jayna™. Each LEGO DC minifigure comes in a sealed ‘mystery’ bag, together with one or more accessory elements, plus a collector's leaflet and a new-for-January-2018 display plate with a printed Batman™ logo.\nEvery collectible LEGO DC minifigure in this series comes with one or more accessory elements, plus a collector’s leaflet and a new-for-January-2018 display plate with a printed Batman™ logo.\n20 limited edition LEGO® Minifigure characters to build and play out your very own action-packed THE LEGO BATMAN MOVIE scenes!\nCombine with LEGO® building sets for endless play possibilities.\nHave fun trading minifigures with your friends to complete your collection.\nSuitable for ages 5+.\nPLEASE NOTE: Each ‘mystery’ bag contains one of the 20 characters available in this collection. Unfortunately, we cannot accommodate requests for specific minifigures. If you purchase more than one ‘mystery’ bag, you may receive two or more identical minifigures.","review_difficulty":"Very Easy","set":"THE LEGO® BATMAN MOVIE Series 2","star_rating":4.8,"theme":null,"val_star_rating":4.0,"country":"IE"}