{"ages":"12+","list_price":97.5878,"num_reviews":14.0,"piece_count":744.0,"play_star_rating":3.2,"prod_short_desc":"Recreate the Solomon R. Guggenheim Museum® with LEGO® Architecture!","prod_id":21035.0,"prod_long_desc":"Discover the architectural secrets of Frank Lloyd Wright’s Solomon R. Guggenheim Museum®. This accurately detailed LEGO® model faithfully recreates the curves and distinctive lines that have made this building an architectural icon for the last half-century. The simple, grid-patterned facade of the annex tower complements the main building with its circular rotundas, while buildable exterior elements depict a section of New York City’s 5th Avenue Museum Mile, complete with its signature yellow cabs. The Guggenheim sign, featuring Wright’s architectural lettering, has also been recreated in a similar typeface to heighten the authenticity of the model. This LEGO Architecture model has been designed to deliver a rewarding building experience for all with an interest in architecture, travel, history and design, and is suitable for display in the home and office.\nLEGO® Architecture interpretation of the real-world architectural landmark, the Solomon R. Guggenheim Museum®.\nFeatures the Guggenheim’s modernist facade with its circular rotundas and distinctive lines, plus the eight-story annex tower and a section of New York City's 5th Avenue Museum Mile including scaled yellow cabs.\nThe Guggenheim sign, featuring Wright's architectural lettering, has also been recreated in a similar typeface to complement the authenticity of the model.\nThe included booklet contains information about the design, architecture and history of the building (English language only. Other languages available for download at LEGO.com\/architecture).\nLEGO® Architecture celebrates the world of architecture through the medium of the LEGO brick, and is developed for all with an interest in travel, architecture, history and design.\nThis set includes over 740 LEGO® pieces and offers an age-appropriate building experience for ages 12+.\nMeasures over 4” high, 7” wide and 5” long.","review_difficulty":"Challenging","set":"Solomon R. Guggenheim Museum®","star_rating":4.6,"theme":"Architecture","val_star_rating":4.1,"country":"LU"}