{"ages":"7-12","list_price":207.3878,"num_reviews":63.0,"piece_count":847.0,"play_star_rating":3.8,"prod_short_desc":"Bring your LEGO® creations to life!","prod_id":17101.0,"prod_long_desc":"Combine the versatile LEGO® building system with advanced technology to boost your creativity with the awesome LEGO BOOST Creative Toolbox. Download the free tablet app to your device and follow the step-by-step instructions to build and code any of the 5 multifunctional models. Experience Vernie the Robot—a moving and talking robot; the M.T.R.4 (Multi-Tooled Rover 4)—a robust, versatile rover with 4 different tool attachments including a spring-loaded shooter; the Guitar4000—a musical instrument with pitch bend and sound effects; Frankie the Cat—an interactive pet that plays, purrs and expresses its mood; or the AutoBuilder—an automated production line that really builds miniature LEGO models! Bring your creations to life with the app’s intuitive, icon-based coding interface and complete an array of exciting activities designed for each model. This set also includes a playmat for use with specific activities, and a LEGO BOOST wall poster!\nIncludes over 840 LEGO® pieces, plus a LEGO Move Hub, Interactive Motor and a Color & Distance Sensor.\nMove Hub features Bluetooth Low Energy (BLE) connectivity, 2 encoded motors, activation button, internal tilt sensor and a light.\nInteractive Motor is an encoded motor.\nColor & Distance Sensor detects distance, motion and color, and can also function as a light.\nCheck out the cool white, orange and blue color scheme.\nRotate Vernie's head to activate its shoulder-mounted spring-loaded shooter.\nBuild the M.T.R.4 (Multi-Tooled Rover 4) and try out the different tool and customization attachments to prepare the vehicle for an array of exciting activities.\nLearn how to play a song and rock out with the Guitar4000.\nLook after your own pet with Frankie the Cat. Be sure to feed it the right food—or it might get upset!\nConstruct, code and operate the AutoBuilder to produce real miniature LEGO® models.\nBuild and code robots and models, and complete exciting activities with the playmat and intuitive LEGO® BOOST app, available for iOS and Android tablet devices.\nEasy-to-use intuitive software with icon-based drag-and-drop coding interface.\nBuilding instructions for all 5 models are included with the free LEGO® BOOST app.\nThis product requires batteries (not included). Please refer to the product packaging for type and quantity.\nGo to LEGO.com\/DeviceCheck for a list of compatible devices. Ask your parents' permission.\nVernie the robot standsover 10” tall.\nM.T.R.4 (Multi-Tooled Rover 4) measures over 4” high, 9” long and 5” wide.\nGuitar4000 measures over 1” high, 16” long and 5” wide.\nFrankie the Cat stands over 6” tall.\nThe AutoBuilder measures over 10” high, 7” long and 6” wide.","review_difficulty":"Average","set":"BOOST Creative Toolbox","star_rating":3.4,"theme":"BOOST","val_star_rating":3.5,"country":"IT"}