{"ages":"8-14","list_price":79.2878,"num_reviews":3.0,"piece_count":604.0,"play_star_rating":4.3,"prod_short_desc":"Deploy Axl's Rolling Arsenal for the biggest battles!","prod_id":72006.0,"prod_long_desc":"Get ready for a heavy-duty LEGO® NEXO KNIGHTS™ battle with Axl's Rolling Arsenal, featuring hidden flick missiles and opening drawbridge. Pitch the Jestroyer with its dual 6-stud rapid shooters against the Vyro Glyder. Lock up the critters in the Critter Trapper's storage chest and save Knighton from the tech infection. This popular kids toy includes 4 minifigures and 3 scannable shields.\nIncludes 4 minifigures: Axl, Jestro, VanByter No. 407 and a MegaByter.\nAxl's Rolling Arsenal features a lowering drawbridge, minifigure cockpit, 2 flick missiles and a shield holder, plus the Critter Trapper mini-tank with a storage chest and shield holder.\nJestroyer features a minifigure cockpit, 2 movable wings mounted with 6-stud rapid shooters and 2 detachable daggers.\nVyro Glyder features a minifigure cockpit, dual critter shooters, 2 detachable sabers and a shield holder.\nFlip out the tank’s dual flick missiles and push the lever to shoot!\nActivate the drawbridge function to release the Critter Trapper.\nWeapons include Axl’s axe and the MegaByter’s spear.\nPlace the Merlok Power in the shield holder to upgrade your knight or vehicle in the battle against the bad guys!\nDownload the free LEGO® NEXO KNIGHTS™: MERLOK 2.0 app to your smartphone or tablet. Ask your parents' permission.\nScan shields for the NEXO Powers Drop the Beat and Standing Ovation, and Merlok Power The Axe of Merlok, and power up in the LEGO® NEXO KNIGHTS™ game!\n7 Merlok Powers to collect to stop Monstrox and his army from spreading their digital infection across Knighton.\nThis popular kids toy is suitable for ages 8-14.\nAxl's Rolling Arsenal measures over 5” high, 5” long and 8” wide, and over 9” wide and 7” long in attack mode.\nJestroyer measures over 2” high, 3” long and 6” wide.\nCritter Trapper measures over 1” high, 2” long and 2” wide.\nVyro Glyder measures over 1” high, 4” long and 3” wide.","review_difficulty":"Challenging","set":"Axl's Rolling Arsenal","star_rating":4.0,"theme":"NEXO KNIGHTS™","val_star_rating":4.0,"country":"IT"}