{"ages":"2-5","list_price":90.87,"num_reviews":null,"piece_count":98.0,"play_star_rating":null,"prod_short_desc":"Explore the Town Square for endless fun and play opportunities!","prod_id":10836.0,"prod_long_desc":"Play out real-life scenarios in LEGO® DUPLO® My Town: a recognizable world with modern DUPLO figures. Discover the Town Square with your toddler—there’s so much to see and do! Turn the gearwheels to rotate the car for the mechanic, buy fresh produce at the bakery and greengrocer, or go to the doctor for a checkup! Includes five DUPLO figures.\nIncludes five LEGO® DUPLO® figures: a mechanic, shopkeeper, doctor, mom and a child.\nFeatures a garage with a car and rotating turntable with gearwheel function, greengrocer, doctor, bakery with opening oven, roof with opening dormer windows.\nIncludes bricks decorated as a pretzel, fruit, vegetables, cake, oven door, eye test chart, bakery sign and mechanic’s sign as story starters.\nAccessory elements include a wheelchair, two cash registers, baguettes, gumball machine, fruit baskets, bananas, flowers, traffic cone and a petrol pump.\nUse the modern characters, accessories and decorated bricks to have fun and help play out everyday scenarios with your toddler.\nTurn the gearwheels to make the car spin on the turntable, or bake baguettes in the bakery oven.\nBuild your town with this easy-to-build set that encourages early construction skills and presents endless play opportunities.\nToddlers will love playing as they learn how to pay for baked goods at the shop, visit the doctor, fill a car with gas, and cross the street.\nLEGO® DUPLO® products are specially designed to be safe and suitable for small hands.\nThis set offers an age-appropriate build and play experience for ages 2-5.\nTwo-story building measures over 11” high, 14” wide and 3” long.\nBakery measures over 7” high, 4” wide and 4” long.\nGarage measures over 6” high, 7” wide and 4” long.\nCar measures over 1” high, 3” long and 2” wide.\nThere are several My Town products to collect and play out your child’s everyday life in a recognizable LEGO® DUPLO® world.","review_difficulty":null,"set":"Town Square","star_rating":null,"theme":"DUPLO®","val_star_rating":null,"country":"NO"}