{"ages":"7-14","list_price":18.962,"num_reviews":2.0,"piece_count":58.0,"play_star_rating":4.5,"prod_short_desc":"Become one with Spinjitzu Master Sensei Wu!","prod_id":71234.0,"prod_long_desc":"Bolster your LEGO® DIMENSIONS™ gameplay with the buildable Sensei Wu Fun Pack. Place the wise and powerful ninja on the LEGO® Toy Pad to bring him to life in the game, then deploy his Spinjitzu skills and other special abilities to solve puzzles and defeat enemies. Add the 3-in-1 Flying White Dragon to boost your gameplay, and rebuild it into a Golden Fire Dragon and Ultra Destruction Dragon for upgraded in-game abilities. The set includes a buildable Sensei Wu minifigure with his golden staff.\nIncludes a buildable Sensei Wu minifigure with his golden staff and 3-in-1 Flying White Dragon, both with a detachable LEGO® Toy Tag.\nRebuild the 3-in-1 Flying White Dragon into a Golden Fire Dragon and Ultra Destruction Dragon for upgraded in-game abilities.\nPlace Sensei Wu and his 3-in-1 model on the LEGO® Toy Pad and set out on exciting in-game adventures.\nActivate Sensei Wu’s special Acrobat, Spinjitzu, Stealth and Pole Vault abilities to solve puzzles and defeat enemies.\nCollect your favorite LEGO® DIMENSIONS™ characters and use them in-game together for a crazy mash-up multiverse.\nVisit LEGO.com\/DIMENSIONS for more information on this exciting LEGO® building and video-gaming experience. Ask your parents’ permission before going online.\nLEGO® DIMENSIONS™ Starter Pack and internet connection required.\nLEGO® DIMENSIONS™ expansion packs unlock additional content.\nLEGO® DIMENSIONS™ characters and vehicles are required to interact with LEGO DIMENSIONS video game.\nFlying White Dragon measures over 1” high, 3” long and 2” wide (alternative 3-in-1 builds vary in size).","review_difficulty":"Easy","set":"Sensei Wu Fun Pack","star_rating":4.5,"theme":"DIMENSIONS™","val_star_rating":4.0,"country":"AU"}