{"ages":"6-12","list_price":103.87,"num_reviews":8.0,"piece_count":622.0,"play_star_rating":4.6,"prod_short_desc":"Make cakes ready for a party at Stephanie’s House!","prod_id":41314.0,"prod_long_desc":"Explore and play in LEGO® Friends Stephanie’s House, featuring a kitchen with bay window, opening fridge and oven, lounge with television and spiral staircase up to a bedroom with curved balcony, shower room and an office. Share friendship moments on the swing chair on the porch, and look after the baby rabbit in his hutch. Includes three mini-doll figures plus a baby rabbit figure.\nIncludes three mini-doll figures: Stephanie, dad James and mom Alicia, plus Chili the baby rabbit figure.\nFeatures a modular two-story house with a kitchen, porch, lounge, spiral staircase, bedroom, bathroom, office and a rabbit hutch.\nDownstairs features an opening front door, hallway with opening door, kitchen with bay window, opening oven, hob, cooker hood, sink and table with chair and window seat, and a lounge with opening door, sofa, coffee table and a TV.\nUpstairs features a bedroom with bed, desk and opening door to a curved balcony, a shower room with toilet, shower and basin, and an office with desk, swivel chair and a laptop.\nOutside area features a porch with swing chair to seat three mini-dolls, mailbox and a rabbit hutch.\nAccessory elements include a cake, two cupcakes, frying pan, three plates, bowl, kitchen utensils, storage jar, buildable vacuum cleaner, shampoo bottle, perfume bottle, brush, two magazines, basket, carrot, flowers and a vase.\nBuildand customize this beautiful, modular house with stained glass windows.\nGet busy in the kitchen with Stephanie making tasty treats for all her friends.\nHelp mom Alicia feed the baby rabbit while dad James vacuums the lounge.\nClimb the open spiral staircase and head to the balcony to watch out for guests arriving or share friendship moments on the swing chair in the porch.\nThis set offers an age-appropriate build and play experience for ages 6-12.\nStephanie's House measures over 8” high, 9” wide and 10” long.\nRabbit hutch measures over 1” high, 1” wide and 1” long.","review_difficulty":"Average","set":"Stephanie's House","star_rating":4.1,"theme":"Friends","val_star_rating":3.3,"country":"NO"}