{"ages":"2-5","list_price":73.1878,"num_reviews":null,"piece_count":104.0,"play_star_rating":null,"prod_short_desc":"Enjoy a visit to the adventure farm and feed the animals!","prod_id":10869.0,"prod_long_desc":"Play out real-life scenarios in LEGO® DUPLO® Town: a recognizable world with modern DUPLO figures. Visit the adventure farm with your toddler and help to feed all the friendly animals. Little farmers will love to pull the string to make the bell go up and down, then have some fun on the slide. Put all the animals to bed in the barn and head into the farmhouse for waffles and a sleepover! This great learning toy for toddlers includes 3 DUPLO figures plus 5 animal figures.\nIncludes 3 LEGO® DUPLO® figures: a farmer and 2 children, plus 5 animal figures: a sheep, cow, goat, rooster and a rabbit.\nFeatures a farmhouse with an upstairs bedroom and toilet, barn with a bell and string function to make it go up and down, tractor, picnic bench and a slide.\nAccessory elements include waffles, a trough, milk bottle, hay brick and a pitchfork.\nPlay out a visit to the adventure farm with this great learning toy for toddlers.\nTalk with your preschool child about the different animals they meet there, what they eat and what noises they make.\nUse the modern characters, accessories and decorated bricks to have fun while helping your toddler learn about caring for animals in a farmyard setting with this versatile toy.\nHelp your child master basic construction skills with this easy-to-build model.\nMakes an ideal gift for preschool children.\nLEGO® DUPLO® products are specially designed to be fun and easy for little hands.\nCombine with the 10867 Farmers' Market, 10868 Farm Pony Stable and 10870 Farm Animals for more fun on the farm.\nSuitable for ages 2-5.\nFarmhouse measures over 9” high, 8” wide and 3” long.\nBarn measures over 6” high, 7” wide and 3” long.\nTractor measures over 3” high, 3” long and 2” wide.","review_difficulty":null,"set":"Farm Adventures","star_rating":null,"theme":"DUPLO®","val_star_rating":null,"country":"LU"}