{"ages":"16+","list_price":426.9878,"num_reviews":171.0,"piece_count":4080.0,"play_star_rating":4.5,"prod_short_desc":"Welcome to the magical Disney Castle!","prod_id":71040.0,"prod_long_desc":"Bring the magical world of Disney to your home with The Disney Castle. This highly detailed LEGO® model with over 4,000 pieces offers a rewarding build and play experience, and comes with an array of exciting Disney-themed features and functions. The intricately detailed facade and towers replicate the iconic Walt Disney World® Resort Cinderella Castle, and each accessible castle room includes special features inspired by some of Disney’s greatest animated feature films, providing endless play possibilities with the included minifigures: Mickey Mouse, Minnie Mouse, Donald Duck, Daisy Duck and Tinker Bell, or other characters from your collection.\nIncludes 5 minifigures: Mickey Mouse with a tuxedo, Minnie Mouse with red dress, Donald Duck with classic outfit, Daisy Duck with pink skirt, lavender colored shoes and a bow, and Tinker Bell with wig element, skirt, wings and a magic wand.\nThe Disney Castle features a detailed facade with a stone bridge, clock, wide arched entrance, ornate balconies, spired towers, plus a four-story main building and a five-story, golden-spired main tower, both containing rooms with assorted Disney-inspired features and elements.\nCastle main building first floor features the main hall with large arched doorway, mosaic floor tiling, ornate chandelier, suits of armor, shield-decorated walls, grandfather clock, floor-standing vase with buildable flower elements, magic carpet and a golden lamp.\nCastle main building second-floor room features buildable dark-blue curtains with curtain pole, ornate buildable candelabra and rose, and glass case elements.\nCastle main building third-floor room features a chest with book of spells, mop and bucket elements, and access to the main tower second-floor room.\nCastle main building fourth-floor bedroom features a detailed bed with decorative golden headboard elements.\nMain tower first-floor kitchen features a large redbrick-patterned stove, workbench, buildable broom and pumpkin, plus pots, pans and assorted kitchen and food elements.\nMain tower second-floor room includes a spinning wheel and access to the castle main building third-floor room.\nMain tower third-floor room features a chest containing brush, scissor and lock of black hair elements, plus a balcony with 2 stud shooters for a firework-display function.\nMain tower fourth-floor room features a golden mirror, plus red apple and glass vase elements.\nMain tower fifth-floor room features a window bench and an arched window.\nAlso includes 2 frogs and a golden crown element.\nRemove part of the roof section to discover the glass slipper element and fairy-tale book element with printed cover.\nLaunch the fireworks and let the magic begin!\nCombine with other LEGO® minifigure characters for endless adventures!\nThis set offers an age-appropriate building experience for ages 16 and over.\nThis set includes over 4,000 LEGO® pieces.\nThe Disney Castle measures over 29” high, 18.8” wide and 12” long.","review_difficulty":"Challenging","set":"The Disney Castle","star_rating":4.7,"theme":"Disney™","val_star_rating":4.5,"country":"LU"}