{"ages":"11-16","list_price":181.87,"num_reviews":19.0,"piece_count":2382.0,"play_star_rating":4.5,"prod_short_desc":"Traverse uncharted territory with the Extreme Adventure!","prod_id":42069.0,"prod_long_desc":"Experience the ultimate in traction and maneuverability with the Extreme Adventure vehicle, featuring 4 high-grip tracks with working suspension, upswing doors with lowering running board function, raisable roof tent, working winch, front steering, opening hood, detailed V8 engine with moving pistons and a lockable tailgate. Also includes a sliding storage drawer, side storage compartment with a first aid kit and 2 fire extinguishers, and a roof rack with 2 jerry cans in a rare dark-green color. This 2-in-1 LEGO® Technic model comes in a yellow, black and purple color scheme with decorative sticker detailing, and can be rebuilt to create a Mobile Base Vehicle.\nFeatures 4 high-grip tracks with working suspension, upswing doors with lowering running board function, a raisable roof tent, lockable tailgate, working winch, front steering, opening hood, detailed V8 engine with moving pistons, sliding storage drawer with shovel, opening side storage compartment with a first aid kit and 2 fire extinguishers, and a roof rack with 2 dark-green jerry cans.\nCheck out the yellow, black and purple color scheme with decorative sticker detailing.\nManeuver the Extreme Adventure to rotate the high-grip tracks.\nTurn the crank to raise the integrated roof tent.\nOpen the upswing doors and see the running boards lower into place.\nLoad the jerry cans onto the roof rack, open the side storage compartment to access the first aid kit and 2 fire extinguishers, and slide out the drawer to access the shovel.\nA uniquely decorated LEGO® Technic 40th Anniversary brick is included with this model.\nThis LEGO® Technic model is designed to provide an immersive and rewarding building experience.\nDesigned for indoor use only.\n2-in-1 model: rebuilds into a Mobile Base Vehicle.\nExtreme Adventure (with roof tent raised and doors open) measures over 11” high, 17” long and 9” wide, and 10” high and 9” wide with roof tent lowered and doors closed.\nMobile Base Vehicle measures over 7” high, 18” long and 7” wide.","review_difficulty":"Average","set":"Extreme Adventure","star_rating":4.9,"theme":"Technic","val_star_rating":4.7,"country":"NO"}