{"ages":"6-12","list_price":67.0878,"num_reviews":3.0,"piece_count":380.0,"play_star_rating":4.3,"prod_short_desc":"Sail off to new adventures with Disney Ariel and Eric.","prod_id":41153.0,"prod_long_desc":"LEGO® l Disney Ariel’s Royal Celebration Boat has everything you need to play out a happy ending for Disney’s The Little Mermaid’s Ariel and Prince Eric. Dance on the revolving dancefloor under the gazebo, spin Sebastian’s starfish decks, discover secret treasure and launch the colored firework bricks. Get creative using the modular design of this great children's toy to easily move and swap sections within the model, or integrate the gazebo with other compatible LEGO l Disney toys to build your own dream creations. Includes 2 mini-doll figures plus Sebastian and Max figures.\nIncludes 2 mini-doll figures: Prince Eric and Ariel with her dress and white fabric cape, plus Sebastian the crab and Max the dog figures.\nAriel’s Royal Celebration Boat features a gazebo with revolving dancefloor, ship’s wheel, vanity desk and firework launcher, plus a dock and Sebastian's island with turning starfish decks.\nAccessory elements include a cake, glasses, crown, treasure chest, jewel, telescope, Ursula's contract tile, trident, hair bow, bone, firework pieces and a perfume bottle.\nCustomize this great children's toy by easily swapping and rearranging internal features such as the vanity, cake table and drinks table.\nMove and rearrange the gazebo and dock to customize the boat, or combine, swap and mix this model with other compatible LEGO® l Disney toys to build your own dream creations.\nRecreate the final wedding scenes from Disney's The Little Mermaid on this ornate boat full of features and secret places.\nHelp Ariel get ready for new adventures at the vanity desk, then put on her white wedding cape.\nSpin Sebastian’s starfish and help Eric and Ariel dance on the revolving dancefloor, then launch the colorful firework pieces as the celebrations continue!\nSuitable for ages 6-12.\nAriel’s Royal Celebration Boat measures over 6” high, 9” long and 4” wide.\nSebastian's island measures over 1” high, 1” wide and 1” long.","review_difficulty":"Average","set":"Ariel's Royal Celebration Boat","star_rating":4.3,"theme":"Disney™","val_star_rating":3.3,"country":"LU"}