{"ages":"14+","list_price":280.5878,"num_reviews":61.0,"piece_count":2028.0,"play_star_rating":4.6,"prod_short_desc":"Join the Ninja at the beautiful Temple of Airjitzu!","prod_id":70751.0,"prod_long_desc":"Enjoy the ultimate LEGO® NINJAGO™ building experience as you construct the majestic Temple of Airjitzu and surrounding village! The highly detailed Temple building has many delightful architectural features including Oriental–style decorated windows and sliding doors. The intricate wooden-frame-style walls of the nearby Blacksmiths and beautiful curved roofs of the Smugglers Market will also test your LEGO building skills. And with every Ninja included in one set for the first time, plus loads of other key characters, you can role-play all your favorite NINJAGO adventures. Take tea in the reception area of the Temple, practice your Ninja moves in the training room or join Wu in his study to read or paint. Discover the Ninja glider upstairs at the Blacksmith’s workshop, cross the bridge guarded by the stone dragons and seek out hidden treasure at the Smugglers’ Market. Then turn off the lights in your room to watch the Temple’s illuminated spinning shadow theater! Includes 12 minifigures with assorted weapons: Lloyd, Kai, Jay, Zane, Cole, Nya, Wu, Misako, Dareth, Postman, Jesper and Claire.\nIncludes 12 minifigures with assorted weapons: Lloyd, Kai, Jay, Zane, Cole, Nya, Wu, Misako, Dareth, Postman, Jesper and Claire.\nVillage features the Temple of Airjitzu, Blacksmith’s workshop and Smugglers’ Market connected by paths, steps and bridge with 2 stone-style dragons on either side, plus a statue of Sensei Yang and grass stalk elements\nTemple of Airjitzu features transparent plastic windows with Oriental-style decoration (new for fall 2015) and sliding doors, reception area with a geometric floor carpet, table, teapot and bowl, shadow theater with a light brick and spinning elements, Ninja training room with weapon holders, 2 Ninja swords, Ninja bow and a practice target, Wu’s study with 3 books and art canvas elements, and an attic with storage box for Cole’s stuff\nBlacksmith’s workshop features wooden-frame-style walls, opening door, sign with anvil and hammer image, realistic interior with anvil, hammer and other assorted tool elements, upper floor with Ninja glider relic with detachable spear elements, rat element in the attic, 2 trees outside with fallen leaves on the roof and grass stalk elements\nSmugglers’ Market features curved Oriental-style roof, golden Oriental details, 2 hidden treasure chests filled with assorted golden weapon elements, sign with bread image, sign with fish image, plus assorted elements including: 2 Ninjago trading cards in a sack, barrel with 2 fish, 2 fishing rods, food and grass stalk elements\nWeapons include Katanasfor Lloyd, Kai, Jay, Zane, Cole and Nya\nLloyd, Kai, Jay, Zane, Cole and Nya minifigures all come in black Ninja outfits that are new for fall 2015\nMisako, Dareth and Postman minifigures are new to LEGO® NINJAGO™ sets for fall 2015\nWu minifigure outfit is new for fall 2015\nGet all six Ninja in one set for the first time!\nDrink tea, train to be a Ninja and study with Wu at the Temple!\nFind the Ninja glider at the Blacksmith’s workshop\nSeek hidden treasure chests at the Smugglers’ Market!\nPut on a show for your friends with the illuminated spinning shadow theater!\nRecreate your favorite scenes from the NINJAGO™: Masters of Spinjitzu TV show\nVillage measures over 16” high, 20” wide and 13” long\nTemple of Airjitzu measures over 16” high, 7” wide and 7” long\nBlacksmith’s workshop measures over 5” high, 5” wide and 7” long\nSmugglers’ Market measures over 5” high, 5” wide and 7” long","review_difficulty":"Challenging","set":"Temple of Airjitzu","star_rating":4.8,"theme":"NINJAGO®","val_star_rating":4.3,"country":"LU"}