{"ages":"6-12","list_price":45.5924,"num_reviews":3.0,"piece_count":322.0,"play_star_rating":4.7,"prod_short_desc":"Help Disney Aurora turn the spinning wheel in her Fairytale Castle!","prod_id":41152.0,"prod_long_desc":"LEGO® l Disney Sleeping Beauty’s Fairytale Castle is easy to build and perfect for playing out favorite moments from Disney’s Sleeping Beauty. There’s a bedroom, spinning wheel, vanity and a special birthday cake. Maleficent’s lair adds drama and excitement to the role-play action. Get creative using the modular design of this fun toy to easily move and swap sections within the model, or rearrange the rooms of the castle and integrate them with other compatible LEGO l Disney toys to build your own dream creations. Includes 2 mini-doll figures plus Merryweather and bunny figures.\nIncludes Aurora and Maleficent mini-doll figures, plus a good fairy and a bunny figure.\nFeatures a modular Fairytale Castle with a balcony, vanity and a bed with hidden storybook tile, plus Maleficent’s lair with throne.\nAccessory elements include a magic wand, crown, spinning wheel, hair bow, flowers, cake, mixing bowl, scissors, hairbrush, perfume bottle, basket, carrot, cherries and Maleficent's staff.\nCustomize the set by easily swapping and rearranging internal features such as the spinning wheel, vanity and cake table.\nMove and rearrange the rooms and Maleficent’s lair to create a new castle every time, or combine, swap and mix this model with other compatible LEGO® l Disney toys to build your own dream creations.\nRecreate favorite moments from Disney's Sleeping Beauty with iconic details such as the spinning wheel, giant cake and birthday dress decoration.\nCreate your own stories about life in the castle with this fun toy, and discover a secret storybook tile under Aurora’s bed.\nSuitable for ages 6-12.\nSleeping Beauty’s Fairytale Castle measures over 11” high, 4” wide and 2” long.\nMaleficent’s lair measures over 4” high, 2” wide and 2” long.","review_difficulty":"Easy","set":"Sleeping Beauty's Fairytale Castle","star_rating":4.3,"theme":"Disney™","val_star_rating":4.3,"country":"AU"}