{"ages":"9-14","list_price":207.3878,"num_reviews":52.0,"piece_count":2295.0,"play_star_rating":4.7,"prod_short_desc":"Join the ninja aboard Wu’s flying ship!","prod_id":70618.0,"prod_long_desc":"Construct Wu’s huge ninja training base, Destiny’s Bounty. This highly detailed THE LEGO® NINJAGO® MOVIE™ model consists of 3 modular levels and features a double-headed dragon figurehead, decorated sails, wind-up-and-release anchors, dojo area for ninja training, a bathroom and Wu’s bedroom in the hull. This amazing model also includes hidden weapons including the ultimate weapon— the laser-style pointer, plus 7 minifigures with assorted weapons to bolster the exciting role-play possibilities.\nIncludes 7 minifigures: Wu, Kai, Lloyd, Zane, Nya, Jay and Cole.\nDestiny’s Bounty features 3 modular levels (top deck, Wu’s dojo and mid-deck\/hull), a double-headed dragon figurehead, 3 decorated sails, a chain of lanterns, 2 wind-up-and-release anchors, sky pirates skull handle, 2 barrels and 3 crates, Wu's bedroom with a bed for a minifigure, and a bathroom in the hull, dojo with a scroll, training dummy and 3 training weapons, plus hidden weapons under the deck.\nWeapons aboard Destiny's Bounty include the laser-style pointer, 4 golden sais, 2 golden katanas, 2 silver katanas, crossbow, black stone warrior sword, 2 golden shurikens and an Aeroblade with golden blades.\nMinifigure weapons include Wu’s staff, Kai’s 2 katanas, Lloyd's tasseled sword, Zane's bow and arrow, Nya's tasseled spear, Jay's spiked flail and Cole's hammer.\nAccessory elements include 3 books, a broom, shovel, big telescope, handheld telescope and 2 fishing rods, Vermillion armor, Garmadon's skeletonhelmet, Anacondrai skull helmet, letter to Misako, 4 fish, 2 collectible cards, map of NINJAGO® world and a sextant.\nRecreate and role-play exciting THE LEGO® NINJAGO® MOVIE™ scenes.\nDestiny’s Bounty measures over 17” high, 21” long and 6” wide.","review_difficulty":"Challenging","set":"Destiny's Bounty","star_rating":4.9,"theme":"THE LEGO® NINJAGO® MOVIE™","val_star_rating":4.8,"country":"LU"}