{"ages":"16+","list_price":128.0878,"num_reviews":66.0,"piece_count":1167.0,"play_rating":4.5,"prod_desc":"Head for the beach with the VW Beetle!","prod_long_desc":"Celebrate the iconic VW Beetle with this awesome LEGO® Creator Expert reproduction. This detailed model comprises a number of special features and elements that help recreate the distinctive Beetle characteristics, including an azure-blue colour scheme, curved fenders, flat windshield, VW logo, and an authentic 4-cylinder air-cooled engine and fuel tank. The accessible interior features beige-coloured, forward-tilting seats, dashboard and steering wheel, and the roof-mounted surfboard and a cooler box can be removed. This model has been designed to provide a challenging and rewarding building experience with a touch of nostalgia.\n1960s VW Beetle with surfer theme features an array of brick-built details including an azure-blue color scheme, curved fenders, white rims with distinctive hubcaps, round headlights, wing-mounted turn signals and opening hood, trunk and doors.\nChoose from four different license plate stickers to customize your model.\nRemove the cooler box and surfboard from the roof rails.\nTilt the rear seat forward to access the storage space with fabric beach towel.\nLift the hood to access the spare tire and fuel tank.\nOpen the trunk to reveal the authentic, 4-cylinder air-cooled engine.\nOpen the doors or remove the roof section to access the detailed beige-colored interior with dashboard, steering wheel and tiltable front and back seats.\nCheck out the awesome brick-built details!\nSpecial elements include a round tile with printed VW logo, arched fender elements and an updated windshield design.\nThis set includes over 1,000 LEGO® pieces\nThis set offers an age-appropriate building experience for ages 16+.\nVW Beetle including surfboard and cooler measures over 5” high, 11” long and 4” wide.","review_difficulty":"Average","set_name":"Volkswagen Beetle","overall_rating":4.9,"theme_name":"Creator Expert","value_rating":4.7}