{"ages":"7-12","list_price":58.4922,"num_reviews":3.0,"piece_count":637.0,"play_rating":5.0,"prod_desc":"Explore the secret Goblin Village without getting caught!","prod_long_desc":"Take part in exciting new Elvendale adventures in the Goblin Village, featuring three buildings loaded with accessories, including a crystal workshop with magnifying glass and rotating crystal platform, cage-making workshop with lookout perch and dungeon with exploding gate function, activated by pulling down on the plant. Includes two mini-doll figures plus three goblins, a panther and a chameleon figure.\nIncludes two mini-doll figures: Azari and Farran, plus three goblin figures: Bieblin, Fibblin and Smilin, and Panthara the Panther and Hidee the Chameleon figures.\nFeatures three Goblin Village buildings: a crystal workshop, a cage-making workshop and a dungeon.\nCrystal workshop includes an opening door, treasure chest, magnifying glass and rotating crystal platform, toilet, bed with secret drawer to hold strawberries, evil plants, secret stairs and a catapult with carnivore plant garden.\nCage-making workshop features an opening door, lookout, cage-making tools and a fireplace.\nDungeon includes an exploding gate function and a goblin slide.\nAlso includes a large cage on wheels with room for an animal figure.\nFire evil seeds from the catapult on the crystal workshop to try and distract the elves.\nPull down on the carnivore plant to break out the gate and free the panther.\nSend Smilin the guard down the dungeon slide to chase after the elves.\nAccessory elements include a magnifying glass, newspapers, guitar, chicken leg, firewood, evil instructions, mug, dynamite, axe, map, watering can, spyglass, bug jar, hammer, fireplace, capture net, fire power and earth power studs, two strawberries, three evil seeds and two crystals.\nThis set offers an age-appropriate build and play experience for ages 7-12.\nOther mischievous goblins can be collected in select LEGO® Elves sets\nGoblin village, with three main buildings in a row, measures over 5” high, 15” wide and 1” long.","review_difficulty":"Average","set_name":"Magic Rescue from the Goblin Village","overall_rating":5.0,"theme_name":"Elves","value_rating":4.5}