{"ages":"8-12","list_price":42.5929,"num_reviews":2.0,"piece_count":451.0,"play_rating":4.5,"prod_desc":"Join forces with Aira and Lumia to protect the Wind Dragon!","prod_long_desc":"Seek the magic within to help Aira, Lumia and the Guardian Wind Dragon face the shadow bat! This amazing LEGO® Elves toy for girls and boys features a fully posable and buildable wind dragon with transparent wings and space for 2 mini-doll figures. The set also includes a bat airship with shooting function and spinning propeller, and a ‘floating' island music school with opening entrance door, hidden chest and rotating sign. Includes 2 mini-doll figures, plus bat and bird figures.\nIncludes Aira and Lumia mini-doll figures, plus Sebastian the bird and Phyll the shadow bat figures.\nFeatures a buildable Cyclo the Guardian Wind Dragon figure with transparent wings, movable head, legs and tail, opening jaw, space for 2 mini-doll figures, and space on the head for a magic Wind ‘diamond'.\nAlso includes a 3-level music school with opening entrance door, rotating sign and 2 hiding places, ‘floating' island that moves by sliding the lever, and a bat airship with shooting function and spinning propeller.\nSlide the lever on the back of the music school to move the ‘floating’ island from one side of the school to the other.\nLift the special ground section in the music area to find the secret plans to the cyclone bow.\nDiscover the hidden box in the basement of the music school to retrieve and construct the cyclone bow.\nAccessory elements include 2 shooting studs, a cherry, harp, music notes, conductor's baton, bow instructions, magical Wind ‘diamond', Lumia's power-up staff, bed, cherry cupcake, lute, organ and a chest, plus a buildable cyclone bow.\nThis amazing toy for girls and boys is suitable for ages 8-12.\nOther mischievous little bats can be collected in selected LEGO® Elves sets.\nGuardian Wind Dragon measures over 2” high, 8” long and 9” wide.\nMusic School measures over 5” high, 3” wide and 1” long.\nAirship measures over 3” high, 2” long and 3” wide.","review_difficulty":"Average","set_name":"Aira & the Song of the Wind Dragon","overall_rating":5.0,"theme_name":"Elves","value_rating":4.5}