{"ages":"7-12","list_price":44.99,"num_reviews":1.0,"piece_count":351.0,"play_rating":5.0,"prod_desc":"Help Batgirl™ nab Mad Harriet™ and recover the microchip!","prod_long_desc":"Join in the action-packed LEGO® DC Super Hero Girls™ world as Batgirl™ and her Bat-Bot encounter Mad Harriet™ and the green Kryptomite™ when they break into the Batgirl Secret Bunker! This great set features an opening bunker with 2 levels including a workout area, IT lab, gear-up area, zipline, Bat-Wagon with foldout wings and foldup wheels, and plenty of accessory elements.\nIncludes Batgirl™ and Mad Harriet™ mini-doll figures, plus the Batgirl Bat-Bot and a green Kryptomite™ figure.\nFeatures a bunker that opens to reveal rooms inside, with a rotating periscope and opening gate, dangling punching bag and weight bench in the training area on the first level, gear-up area with accessories, IT lab with view screen and window, plus a zipline from the top level down to the Bat-Wagon.\nAlso includes Batgirl’s ‘flying’ Bat-Wagon with folding wings, tires that fold up for flight and a holding cell.\nWork out in the training area with the punching bag and weight bench.\nRotate the periscope to keep an eye on the surrounding area.\nSlide down the zipline for a shortcut to the Bat-Wagon, then extend the wings and fold up the tires to take off.\nAccessory elements include a water bottle, weight, handcuffs, bat surveillance camera, Batarang, microchip, punching bag, training mat and a display hanger for foil wings.\nConnect the zipline system with the 41238 Lena Luthor™ Kryptomite™ Factory to expand your Super Hero play!\nCute but evil Kryptomites are included in every LEGO® DC Super Hero Girls™ set.\nBunker measures over 5” high, 8” wide and 1” long.\nBat-Wagon measures over 2” high, 4” long and 2” wide.","review_difficulty":"Average","set_name":"Batgirl™ Secret Bunker","overall_rating":5.0,"theme_name":"DC Super Hero Girls","value_rating":5.0}