{"ages":"6-12","list_price":85.3878,"num_reviews":8.0,"piece_count":722.0,"play_rating":4.6,"prod_desc":"Plot mission after mission together at the Friendship House!","prod_long_desc":"The LEGO® Friends Friendship House is the ultimate base for special moments between the friends of Heartlake City—whether starting adventures or enjoying some downtime. This popular kids’ toy features a kitchen, living room with craft table, bedroom with double-sided TV screen, terrace with speakers, barbecue, hot tub, juice bar and a lookout tower on the roof. Outside, there's a swing, a bike with a trailer full of tools and lots of cool features in this converted fire station building including a working pulley, alarm, pole, slide and a garage with opening door. Includes 3 mini-dolls plus 3 animal figures.\nIncludes Olivia, Emma and Andrea mini-doll figures, plus Dash the dog, Rumble the hamster and Cinnamon the bunny figures.\nFeatures a 4-story converted fire station building with a garage, kitchen, living area, bedroom, roof terrace, performance terrace, side balcony with barbecue, working pulley system, mailbox, spinning fireman's pole and a slide, plus a friendship tree with swing and a bicycle with trailer.\nGarage features a hamster wheel and tube system.\nKitchen features a refrigerator, microwave, sink, cooker and worktop.\nLiving room features a craft table with 5 stools and opening cupboards.\nBedroom features 5 beds and a double-sided TV screen\/secret mission screen.\nRoof terrace features a hot tub, juice bar, music dock and a lookout tower with ladder and telescope.\nAccessory elements include 2 walkie-talkies, tools, guitar, popcorn, pizza, teapot, washing-up liquid bottle, craft box, scissors, artwork tiles, 5 fabric blankets, mp3 player, cocktail glasses and a carrot.\nHangout at the Friendship House with the girls from Heartlake City and enjoy a relaxing day listening to music in the hot tub, doing crafts with Emma, or cheering on Andrea’s latest musical performance with this popular kids’ toy.\nUse the working pulley to help lift supplies into the house.\nJump into action when a mission comes in, spin the TV in the bedroom around to see the secret mission screen, and formulate a plan to save the day!\nSlide down the fireman's pole, jump on the bike and speed off with Olivia’s trailer full of tools.\nWatch the hamster go round on his wheel, give the dog a little swing under the friendship tree, and feed the bunny a juicy carrot.\nSuitable for 6-12 years.\nFriendship House measures over 11” high, 9” wide and 4” long.\nFriendship tree measures over 3” high, 7” wide and 1” long.\nBicycle with trailer measures over 3” long, 1” wide and under 1” high.\nPark 41330 Olivia's Mission Vehicle in the garage, ready for even speedier rescue missions!","review_difficulty":"Average","set_name":"Friendship House","overall_rating":4.0,"theme_name":"Friends","value_rating":4.0}