{"ages":"12-16","list_price":311.952,"num_reviews":75.0,"piece_count":3929.0,"play_rating":3.9,"prod_desc":"Experience the huge Bucket Wheel Excavator!","prod_long_desc":"Enter the world of mining on a colossal scale with the massive Bucket Wheel Excavator—the largest LEGO® Technic set to date! This highly detailed 2-in-1 model has been designed to provide an immersive and rewarding build and play experience, and comes with an array of motorised functions, including forward and reverse driving, moving conveyor belts, working boom with revolving bucket wheel, and a rotating superstructure. You can even rebuild the model to create a Mobile Aggregate Processing Plant.\nFeatures a LEGO® Power Functions motor for an array of motorised functions, including forward and reverse driving, rotating bucket wheel, moving conveyor belts and rotating superstructure, plus a working bucket wheel boom.\nAlso features hand-railed walkways, lights, mined-material elements and a rugged mine truck.\nSwitch on the LEGO® Power Functions motor and maneuver the huge tracked structure into position.\nActivate the motorised conveyor belts and bucket wheel.\nMove the joystick to rotate the massive superstructure.\nRaise and lower the huge bucket wheel boom.\nFollow the mined material from the bucket wheel to the moving conveyor belts and all the way to the waiting mine truck!\nThis LEGO® Technic model is designed to provide an immersive and rewarding building experience.\nThis set includes over 3,900 pieces, making it the largest LEGO® Technic set to date.\n2-in-1 model: rebuilds into a Mobile Aggregate Processing Plant.\nThis set offers an age-appropriate building experience for ages 11-16.\nBucket Wheel Excavator measures over 16” high, 28” long and 11” wide.\nMobile Aggregate Processing Plant with boom retracted measures over 8” high, 34” long and 8” wide, and over 12” high with boom extended.\nMine Truck measures over 3” high, 7” long and 3” wide.","review_difficulty":"Challenging","set_name":"Bucket Wheel Excavator","overall_rating":4.6,"theme_name":"Technic","value_rating":4.6}