{"ages":"10-16","list_price":121.9878,"num_reviews":14.0,"piece_count":1327.0,"play_rating":4.6,"prod_desc":"Discover new horizons with the Ocean Explorer!","prod_long_desc":"Enjoy seafaring adventures with this LEGO® Technic Ocean Explorer set, featuring a ship with a dark-blue, red and white color scheme, plus a buildable submarine with movable arms and spinning propeller, and a buildable helicopter with spinning rotors. The ship features a large captain’s bridge with radar and funnel detailing, plus a landing pad, working crane and an opening deck hatch for access to the ship’s hull, complete with bulbous bow and two fenders. This detailed 2-in-1 set has been designed to provide an immersive and rewarding building experience and can be rebuilt to create a Push Boat and Barge.\nFeatures a ship with a bulbous bow, large captain’s bridge with radar and funnel detailing, landing pad and a working crane, plus a buildable submarine and helicopter.\nCheck out the ship’s authentic dark-blue, red and white color scheme.\nSubmarine features a bubble cockpit, movable arms, spinning propeller and a yellow and black color scheme.\nHelicopter features a bubble cockpit, spinning rotors and an orange, gray and white color scheme.\nPractice takeoffs and landings from the ship's landing pad.\nUse the submarine’s movable arms to carry out underwater investigations.\nTurn the ship’s steering to adjust the rudders.\nOpen the deck hatch to access the ship’s hull.\nA uniquely decorated LEGO® Technic 40th Anniversary brick is included with this model.\nThis LEGO® Technic model is designed to provide an immersive and rewarding building experience.\nThis set includes over 1,300 pieces and offers an age-appropriate building experience for ages 10-16.\n2-in-1 set: rebuilds into a Push Boat and Barge.\nShip with crane boom extended to the side measures over 7” high, 22” long and 9” wide, and over 7” high and 4” wide with crane boom retracted.\nSubmarine measures over 2” high, 5” long and 2” wide.\nHelicopter measures over 2” high, 5” long and 4” wide.\nPush Boat measures over 6” high, 9” long and 5” wide.\nBarge measures over 3” high, 15” long and 5” wide.","review_difficulty":"Challenging","set_name":"Ocean Explorer","overall_rating":4.6,"theme_name":"Technic","value_rating":4.8}