{"ages":"11-16","list_price":304.9878,"num_reviews":45.0,"piece_count":1862.0,"play_rating":3.7,"prod_desc":"Harness the power of the mighty 6x6 All Terrain Tow Truck!","prod_long_desc":"Carry out vehicle rescue operations with the fully remote-controlled 6x6 All Terrain Truck. This authentic 2-in-1 LEGO® Technic model features a blue, red, yellow and black color scheme, large chunky tires, heavy-duty bull bar with chain and hook, movable lights and a detailed driver’s cab with opening doors. Remote-controlled functions include forward and reverse drive, front steering, extendable outriggers, and a working crane and winch. Rebuild this model to create a Research Explorer Vehicle for a double build-and-play experience.\nFeatures a LEGO® Power Functions large motor, medium motor, battery box, receiver and a remote for an array of remote-controlled functions, including forward and reverse drive, front steering, extendable outriggers and a working crane and winch.\nAlso features large chunky tires, heavy-duty bull bar with chain and hook, movable lights and a detailed driver’s cab with opening doors.\nCheck out the vibrant blue, red, yellow and black color scheme.\nActivate the LEGO® Power Functions and use the remote control to maneuver the vehicle into position, extend the outriggers, rotate, raise and lower the crane or raise and lower the winch.\nA uniquely decorated LEGO® Technic 40th Anniversary brick is included with this model.\nThis LEGO® Technic model is designed to provide an immersive and rewarding building experience.\nDesigned for indoor use only.\nThis product requires batteries (not included). Please refer to the product packaging for types and quantities.\n2-in-1 model: rebuilds into a Research Explorer Vehicle.\n6x6 All Terrain Tow Truck with boom raised and outriggers extended measures over 20” high, 24” long and 14” wide, and 10” high and 7” wide with boom lowered and outriggers retracted.\nResearch Explorer Vehicle measures over 9” high, 18” long and 9” wide.","review_difficulty":"Challenging","set_name":"6x6 All Terrain Tow Truck","overall_rating":3.5,"theme_name":"Technic","value_rating":2.9}