{"ages":"8-14","list_price":67.152,"num_reviews":7.0,"piece_count":521.0,"play_rating":4.7,"prod_desc":"Get all fired up at Garmadon’s Volcano Lair!","prod_long_desc":"Join Zane’s mission to infiltrate evil Garmadon’s Volcano Lair and take on the shark army, with this exciting THE LEGO® NINJAGO® MOVIE™ set. The base includes a minifigure-launch function at the tip of the volcano, Garmadon’s throne room, computer lab with a mini piranha mech prototype, construction zone with an exploding wall function and rotating crane to lift the included shark figure, plus a drone launch pad. This building toy also includes 5 minifigures.\nIncludes 5 minifigures: Garmadon, Zane, General #1, Steve and Four Eyes, plus a shark figure.\nGarmadon’s Volcano Lair features an entrance shaped like Garmadon’s face, minifigure-launch function at the tip of the volcano, Garmadon’s throne room, computer lab, construction zone, drone launchpad, translucent-orange lava elements and blue water-style baseplates.\nGarmadon's throne room features a big seat, teapot and pot elements, fish tank with 2 fish elements and a weapon rack with arrow and sai weapons.\nUse the fish elements to create a buildable shark army weapon.\nComputer lab features a computer keyboard and screen elements, mini piranha mech prototype and a coffee machine with cup element.\nConstruction zone features a rotating crane to lift the shark figure, a wheel-operated exploding wall function and a flick missile.\nAlso includes a drone launchpad and shell drone with foldout wings.\nEvade the shark's snapping jaws.\nWeapons include Garmadon's staff and katana, Zane’s bow and arrow, General #1’s fish sai and Four Eyes’ fish spear.\nAlso includes Zane’s quiver element.\nGeneral #1, Steve and Four Eyes minifigures are all new for December 2017.\nRecreate and role-play exciting THE LEGO® NINJAGO® MOVIE™ scenes.\nThis building toy is suitable for ages 8-14.\nMeasures over 10” high, 12” wide and 6” long.","review_difficulty":"Average","set_name":"Garmadon's Volcano Lair","overall_rating":4.3,"theme_name":"THE LEGO® NINJAGO® MOVIE™","value_rating":5.0}