{"ages":"14+","list_price":383.952,"num_reviews":19.0,"piece_count":3444.0,"play_rating":4.9,"prod_desc":"Dare to enter The Joker™ Manor!","prod_long_desc":"Help Batman™, Barbara Gordon, Alfred Pennyworth™ (in his classic Batsuit) and Nightwing™ regain control of the jokerized Wayne Manor with this massive THE LEGO® BATMAN MOVIE set. The Joker™ Manor is packed with iconic details from the movie and cool functions, including a rollercoaster encircling the whole building, a huge buildable The Joker head with trapdoor and slide, punching boxing gloves, a rocking ‘The Joker’ sign and rotating ‘big eye’ tower. The interior includes a cinema room with a romantic DVD element, kitchen with buildable microwave plus lobster and lemon-slice decorated tile elements, living room with a buildable grand piano, fireplace and bust, swimming pool room, and a music studio with guitar element and buildable mixing desk and loudspeakers. Build this magnificent manor and then recreate your favorite scenes from the movie with 10 included minifigures.\nIncludes 10 minifigures: The Joker™, Batman™, Barbara Gordon, Harley Quinn™, Nightwing™, Alfred Pennyworth™ Classic Batsuit, Disco Batman™, Disco The Joker™, Disco Batgirl™ and Disco Robin™.\nFeatures a grand entrance flanked by 2 buildable bombs with translucent spark-style elements, 2-level and 3-level towers with turrets and flag elements on top, a rollercoaster track and train with 3 cars (each with a minifigure seat), rotating ‘big eye’ tower with lever-operated iris to ‘look’ up and down, huge buildable The Joker™ head with trapdoor and slide, rocking ‘The Joker’ sign, ‘Ha! Ha!’ sign, 2 wheel-operated punching boxing gloves, plus many multicolored, translucent light-style decorative elements.\nActivate the trapdoor to send a minifigure tumbling from the top of the The Joker™ head, down the slide and out through the mouth.\nInterior includes an entrance hall with 4 plastic, bendy ‘mirror’ elements; living room with a buildable grand piano and stool, bust, and fireplace with translucent-red fire-style elements; cinema room with a screen, minifigure seat and assorted elements including a romantic DVD; kitchen with cup, pot and pan elements, and a buildable microwave with lobster, lemon and plate elements inside; music studio with a buildable mixing desk and loudspeakers, seat and a guitar element; swimming pool room with translucent-blue water-style elements; and an attic with 2 buildable boxes and a rat figure.\nWeapons include Batman’s Batarang, Barbara Gordon’s revolver and Harley Quinn’s bat.\nDisco Batman™, Disco The Joker™, Disco Batgirl™ and Disco Robin™ minifigures are new for January 2018.\nThis set includes over 3,435 pieces.\nRecreate and reimagine memorable scenes from THE LEGO® BATMAN MOVIE.\nThe Joker™ Manor measures over 21” high, 25” wide and 10” long.\nRollercoaster train measures over 1” high, 5” long and 1” wide.","review_difficulty":"Challenging","set_name":"The Joker™ Manor","overall_rating":5.0,"theme_name":"THE LEGO® BATMAN MOVIE","value_rating":4.9}