{"ages":"7-14","list_price":54.8878,"num_reviews":2.0,"piece_count":156.0,"play_rating":4.5,"prod_desc":"Fight crime with Batgirl™ and Robin™ in THE LEGO® BATMAN MOVIE!","prod_long_desc":"Fight crime with Batgirl™ and Robin™ in the streets of Gotham with the all-new THE LEGO® BATMAN MOVIE Story Pack! Build an all-new Bat-Computer gateway for your LEGO Toy Pad and then activate Batgirl’s and Robin’s special abilities to solve puzzles and battle enemies. Take flight with the Batwing to accelerate your gameplay, and then rebuild it into The Black Thunder and Bat-Tank for enhanced in-game powers. This set includes a Bat-Computer gateway build, buildable Batgirl and Robin minifigures, a 3-in-1 Batwing vehicle, six new game levels and THE LEGO BATMAN MOVIE Adventure World with a Battle Arena.\nIncludes buildable Batgirl™ and Robin™ minifigures, rebuildable 3-in-1 Batwing vehicle, and Bat-Computer gateway build.\nUnlocks six levels of action-packed THE LEGO® BATMAN MOVIE gameplay and an Adventure World with a Battle Arena.\nCharacters and models include a detachable LEGO® Toy Tag\nRebuild the Batwing into The Black Thunder and Bat-Tank.\nPlace Batgirl™, Robin™ and their vehicle on the LEGO® Toy Pad to bring them to life in the game.\nActivate Batgirl™ and Robin’s stealth and agile abilities to help save the city of Gotham.\nCollect your favorite LEGO® DIMENSIONS™ characters and use them in-game together for a mash-up multiverse of your favorite characters.\nVisit LEGO.com\/DIMENSIONS for more information on this exciting LEGO® building and video-gaming experience. Ask your parents’ permission.\nLEGO® DIMENSIONS™ Starter Pack and internet connection required.\nLEGO® DIMENSIONS™ expansion packs unlock additional content.\nLEGO® DIMENSIONS™ characters and vehicles are required to interact with the LEGO DIMENSIONS video game.\nBatwing measures over 1” high, 1” long and 2” wide (alternative 3-in-1 vehicle builds vary in size).","review_difficulty":"Easy","set_name":"THE LEGO® BATMAN MOVIE Story Pack","overall_rating":4.5,"theme_name":"DIMENSIONS™","value_rating":3.5}