{"ages":"8-14","list_price":60.939,"num_reviews":3.0,"piece_count":506.0,"play_rating":5.0,"prod_desc":"Suit up for a Tech Wizard Showdown with Clay’s 3-in-1 mech!","prod_long_desc":"Pitch Monstrox against Merlok 2.0 and Clay in their highly posable mech, featuring a cockpit for Clay’s battle suit, buildable sword, 6-stud rapid shooter, Combo NEXO POWER shield and a detachable Merlok 2.0 hologram figure attached to a flyer with a sword and shield holder. The Monstrox hologram is on a critter base with 4 legs and 2 critter shooters. This cool toy for kids includes 2 minifigures, a CyberByter figure and 3 scannable shields.\nIncludes 2 minifigures: Clay and InfectoByter, plus a CyberByter figure and Merlok 2.0 and Monstrox hologram figures.\nClay’s mech features a minifigure cockpit, sword, shield with 6-stud rapid shooter, Combo NEXO POWER shield, plus a detachable Merlok 2.0 hologram figure attached to a flyer featuring a sword and a shield holder.\nMonstrox hologram's critter base features 4 posable legs and 2 critter shooters.\nWeapons include 2 buildable swords, Clay's sword, an axe and a scythe.\nDetach the Merlok flyer from Clay’s mech and attach it to Clay’s battle suit.\nAttach Monstrox to the back of Clay’s mech to inject the tech infection.\nPlace the Merlok Power in a shield holder to upgrade your knight or vehicle in the battle against the bad guys!\nDownload the free LEGO® NEXO KNIGHTS™: MERLOK 2.0 app to your smartphone or tablet. Ask your parents before going online.\nScan shields for the NEXO Powers Whirlwind, Jungle Dragon and Merlok Power The Sword of Merlok, and power up in the LEGO® NEXO KNIGHTS™ game!\n7 Merlok Powers to collect to stop Monstrox and his army from spreading their digital infection across Knighton.\nCombine with the 72003 Berserker Bomber and place the Vyro Suit inside the mech’s cockpit, or place Clay's battle suit under the Berserker Bomber!\nThis cool toy for kids is suitable for ages 8-14.\nClay's mech stands over 9” high.\nClay's battle suit stands over 3” tall.\nMerlok flyer with sword and shield measures over 3” high, 4” long and 2” wide.\nMonstrox base measures over 3” high, 2” wide and 2” long.","review_difficulty":"Average","set_name":"Tech Wizard Showdown","overall_rating":5.0,"theme_name":"NEXO KNIGHTS™","value_rating":5.0}