{"ages":"16+","list_price":487.9878,"num_reviews":130.0,"piece_count":4634.0,"play_rating":4.7,"prod_desc":"Get ready to bust some ghosts at the Firehouse Headquarters!","prod_long_desc":"Recreate iconic Ghostbusters™ scenes with the 2-storey Firehouse Headquarters, featuring laboratory, living quarters, containment unit and much more. Capture the ghosts with the proton packs and restore order, or solve other supernatural cases! Includes 9 minifigures: Peter Venkman, Raymond Stantz, Egon Spengler, Winston Zeddemore, Janine Melnitz, Dana Barrett, Louis Tully, Library Ghost and Zombie Driver.\nIncludes 9 minifigures: Peter Venkman, Raymond Stantz, Egon Spengler, Winston Zeddemore, Janine Melnitz, Dana Barrett, Louis Tully, Zombie Driver and Library Ghost.\nAlso comes with Slimer, Pink Ghost and Blue Ghost.\nSlide the Ghostbusters™ heroes down the fire pole into action.\nChase the ghosts and secure them in the containment unit.\nTurn the librarian old lady into a scary ghost with the double-sided face and extra wig!\nRun tests on Louis in the lab to see if he's possessed!\nSuspend ghosts around the building's exterior with attachable transparent arms.\nDodge the slime oozing up through cracks in the pavement.\nAccessory elements include an alarm bell, fire extinguisher, computer, phone, toolbox, tools, jars of slimes, magnifying glass, camera, camera rolls, arcade game, toaster with slime, fridge with frozen pizza, milk and cheese, and much more!\nFeatures opening walls for easy play access.\nFeatures over 4,600 pieces.\nGhostbusters™ minifigures comewith decorated arms.\nMeasures over 14” high, 9” wide and 14” long.\nWith walls opened out, measures over 14” high, 18” (46 cm) wide and 14” long.\nFirehouse Headquarters doors can open to fit the 21108 LEGO® Ideas Ghostbusters Ecto-1 inside!","review_difficulty":"Challenging","set_name":"Firehouse Headquarters","overall_rating":4.8,"theme_name":"Ghostbusters™","value_rating":4.7}