{"ages":"7-12","list_price":39.99,"num_reviews":null,"piece_count":397.0,"play_rating":null,"prod_desc":"Rescue Blue the Velociraptor from Wheatley and the pilot!","prod_long_desc":"Unite Owen with the faithful Velociraptor in this thrilling Blue’s Helicopter Rescue set, inspired by Jurassic World™. Wheatley has trapped Blue in a cage and attached it to his helicopter, featuring rotating blades, 6-stud shooter and dual searchlights. Set off in the quad bike with trailer and fire the crossbow, rescue the dinosaur and retrieve the dinosaur eggs. This cool toy for kids includes 3 minifigures and a Velociraptor figure.\nIncludes 3 minifigures: Owen, Wheatley and a pilot, plus a Blue the Velociraptor figure.\nFeatures an open-door helicopter with rotating blades, belly hook, 6-stud shooter, dual searchlights and space for a storage chest, plus a cage with folding sides and frame with attachment for helicopter cable, and a quad bike with a spare tire.\nVelociraptor features posable limbs and snapping jaws.\nTurn the handle to set the helicopter blades spinning!\nPlace the Velociraptor in the trap, fold up the sides and then lift it up using the helicopter’s belly hook and fly off.\nShoot Owen’s crossbow stud shooter at the helicopter to make it land, then release Blue from the cage and retrieve the stolen dinosaur eggs.\nWeapons include a tranquilizer gun with a syringe, a handgun stud shooter and a crossbow stud shooter.\nAccessory elements include Owen's backpack, dinosaur tooth, chicken leg and a dinosaur egg.\nThis cool toy for kids is suitable for ages 7-12.\nHelicopter measures over 4” high, 10” long and 7” wide.\nQuad bike with trailer measures over 1” high, 3” long and 1” wide.\nTrap\/cage measures over 3” high, 4” wide and 4” long when open, and 2” wide and 2” long when closed.\nVelociraptor stands over 2” tall.","review_difficulty":null,"set_name":"Blue's Helicopter Pursuit","overall_rating":null,"theme_name":"Blue's Helicopter Pursuit","value_rating":null}