{"ages":"16+","list_price":317.1878,"num_reviews":99.0,"piece_count":4002.0,"play_star_rating":4.7,"prod_short_desc":"Celebrate ten years of Modular Building with the Assembly Square!","prod_id":10255.0,"prod_long_desc":"Take a trip to the amazing Assembly Square, developed to celebrate ten years of LEGO® Modular Buildings, featuring a wealth of unsurpassed, intricate details and hidden surprises. Easy-to-remove building sections provide access to the highly detailed interior, comprising a ground level with a bakery, florist’s shop and café, a middle level with a music store, photo studio and dental office, and an upper-level dance studio and apartment with access to a rooftop terrace with barbecue. The exterior of the building features a detailed sidewalk with outdoor café furniture, fountain, streetlamps and a highly elaborate facade with beautifully detailed windows and doors, three buildable shop signs, spired tower and a decorative roofline. Collect and build an entire town with the LEGO Creator Expert Modular Building series 10243 Parisian Restaurant, 10246 Detective’s Office and 10251 Brick Bank. Includes eight minifigures and a baby figure.\nIncludes eight minifigures: a dentist, barista, baker, florist, music store assistant, dancer, photographer and a LEGO® fan, plus a baby figure.\nThe three-level Assembly Square features an authentic, elaborate facade with detailed windows and doors, three buildable shop signs, spired tower, decorative roofline and a rooftop terrace, plus a detailed tiled sidewalk with a fountain, outdoor café furniture and two streetlamps. The highly detailed interior includes a bakery, florist’s shop, café, music store, photo studio, dental office, apartment and a dance studio.\nGround level features a bakery with counter, cash register, shelves, opening oven, wedding cake and assorted buildable pastries and treats; a florist’s shop with counter, cash register, garden tools, flower arrangements, bouquets and a blue and yellow macaw parrot element; and a café with espresso machine, counter, bench seating and pie elements.\nMiddle level features a music store with a buildable drum set, two guitars and saxophone element; photo studio with buildable classic camera and adjustable tripod; and a dental office with buildable reclining chair, waiting area, telephone and a sink.\nUpper level features a dance studio with buildable piano and reflective mirror element; an apartment with buildable foldout sofa bed, detailed kitchen, toilet, micro LEGO® train, modular buildings and Eiffel Tower, and access to a rooftop terrace with buildable barbecue, table and a neglected plant.\nAccessory elements include a ballerina skirt, Chihuahua, pretzel, ornamental chicken and candy. Also includes a buildable telephone, grill, baby carriage and buildable lamps.\nRemove the building sections to access the detailed interior.\nAdjust the camera tripod and take photos all around the square.\nRecline the dentist chair and reveal those pearly whites!\nOpen the oven door to remove your freshly-baked pastries.\nFold out the sofa bed and relax while you admire your modular buildings collection!\nCelebrate Modular Buildings with this awesome 10th anniversary LEGO® Creator Expert set!\nThis set offers an age-appropriate build and play experience for ages 16+.\nWith over 4,000 LEGO® pieces, this model will really put your LEGO® building skills to the test!\nNew-for-spring-2017 decorated elements include a dentist torso, dentist window and 2x3 tile with the 10182 Café Corner box front.\nIncludes lots of curved and corner angle tiles, garage doors used as box windows and LEGO® Technic excavator scoops used as roofing elements.\nCollect and build an entire town with the LEGO® Creator Expert Modular Building series 10243 Parisian Restaurant, 10246 Detective’s Office and 10251 Brick Bank.\nMeasures over 13” high, 14” wide and 9” long.","review_difficulty":"Challenging","set":"Assembly Square","star_rating":4.8,"theme":"Creator Expert","val_star_rating":4.5,"country":"NL"}