{"ages":"1½-3","list_price":36.5878,"num_reviews":null,"piece_count":34.0,"play_star_rating":null,"prod_short_desc":"Make an animal train with these fun and colorful models.","prod_id":10863.0,"prod_long_desc":"Toddlers will have so much fun building their own animal train with the My First Animal Brick Box! Help them sort the bricks into different colors and talk about each iconic animal as you build them and enjoy creative play together: an elephant with a slide for a trunk, a crocodile with hinged jaws, a lion with opening mouth, a giraffe with a bendy neck and a white bird. The bright and chunky LEGO® DUPLO® bricks are specially designed to be fun and safe for small hands and come in a handy storage box.\nFeatures 5 buildable animals: an elephant on wheels with a slide for a trunk, a crocodile on wheels with hinged jaws, a lion on wheels with opening mouth, a giraffe on wheels with a bendy neck and a bird.\nHave fun together as your child learns how to recognize and sort colors, and help develop language skills by talking about the iconic animals as you build them.\nJoin 4 of the animals together to make an animal parade and drive the train around the room.\nInspire creative play and imagination as toddlers make up their own stories about the animals with this versatile toy.\nUse the handy storage box to keep all your LEGO® DUPLO® bricks together.\nMakes an ideal gift for preschool children.\nLEGO® DUPLO® products are specially designed to be fun and easy for small hands.\nSuitable for ages 1½-3.\nElephant measures over 4” high, 7” long and 2” wide.\nCrocodile measures over 4” high, 3” long and 4” wide.\nLion measures over 4” high, 7” long and 2” wide.\nGiraffe measures over 6” high, 4” long and 2” wide.\nBird measures over 4” high, 3” wide and 4” long.\nCombine with 10859 My First Ladybug to extend the animal train.\nAs seen in the LEGO® DUPLO® Create and Connect TV commercial.","review_difficulty":null,"set":"My First Animal Brick Box","star_rating":null,"theme":"DUPLO®","val_star_rating":null,"country":"NL"}