{"ages":"5-8","list_price":60.9878,"num_reviews":1.0,"piece_count":266.0,"play_star_rating":5.0,"prod_short_desc":"Race with Disney•Pixar’s Lightning McQueen for the trophy!","prod_id":10745.0,"prod_long_desc":"Start your engines and take part in the exciting Florida 500 Final Race from Disney•Pixar Cars 3, featuring an Easy to Build crew chief’s stand with raising red and green race flags and Start\/Finish line arch, trackside barriers and a winners’ podium with checkered flags and a trophy. Includes a simple guide to build and play, and bigger pieces help build confidence in younger kids. LEGO® Juniors is an age-appropriate build and play experience for ages 4-7. Includes 5 LEGO Juniors characters.\nIncludes 5 characters from Disney•Pixar Cars 3: Lightning McQueen, Cruz Ramirez, Jackson Storm, Guido and Mack.\nFeatures a crew chief’s stand with room for Guido, a race monitor and raising flag bars, plus a Start\/Finish line arch and trackside barriers.\nAlso includes a winners’ podium and gas and air pump elements.\nMack can carry 2 cars inside the trailer.\nOpen Mack’s back to unload the cars at the racetrack.\nHead to the gas pump to fuel up before the race.\nAccessory elements include a trophy, tools, 2 checkered flags and red and green race flags.\nIncludes Easy to Build models with bigger pieces and a simple guide to get kids building and playing quickly.\nLightning McQueen measures over 1” high, 2” long and 1” wide.\nCruz Ramirez measures over 1” high, 2” long and 1” wide.\nJackson Storm measures over 1” high, 2” long and 1” wide.\nGuido measures over 1” high, 1” long and 1” wide.\nMack measures over 3” high, 9” long and 1” wide.\nCrew chief’s stand excluding flags measures over 2” high, 2” wide and 3” long.\nStart\/Finish line arch measures over 4” high, 6” wide and 1” long.","review_difficulty":"Challenging","set":"Florida 500 Final Race","star_rating":5.0,"theme":"Juniors","val_star_rating":5.0,"country":"PT"}