{"ages":"12-16","list_price":197.5924,"num_reviews":20.0,"piece_count":1628.0,"play_star_rating":3.5,"prod_short_desc":"Break into Arkham Asylum with Batman™!","prod_id":70912.0,"prod_long_desc":"Bust into Arkham Asylum with Batman™ and banish The Joker™ and the other Super-Villains with the Phantom Zone Projector element. This highly detailed set from THE LEGO® BATMAN MOVIE features the massive Arkham Asylum model with many different areas—including Dr. Harleen Quinzel’s office, ward office, four cells, an ‘x-ray’ security scanner, canteen, visitors’ room and laundry room—plus a separate five-story lookout tower, police car and loads of play-inspiring accessories. With 12 minifigures—and plenty of Super-Villain characters among them—also included in the set, the role-play possibilities are endless.\nIncludes 12 minifigures: Batman™, Robin™, Aaron Cash, Dr. Harleen Quinzel™, Barbara Gordon, Poison Ivy™, The Joker™, The Riddler™, Two-Face™, Catwoman™ and two GCPD officers.\nThis action-packed set features a hugely detailed Arkham Asylum with a guard tower, plus a police car.\nThe Arkham Asylum features a roof with chimney, decorative and snow elements, adjustable exterior searchlight-style elements, a statue in front of the large opening entrance doors, ‘x-ray' security scanner, Dr. Harleen Quinzel’s office, ward office, visitors’ room, four cells with opening doors and hanging vines outside Poison Ivy’s cell, canteen, laundry room, red phone box with a phone element, plus a separate lookout tower.\nReveal a skeleton ‘x-ray image’ as you guide a minifigure through the security scanner.\nHelp to run Arkham Asylum from Dr. Harleen Quinzel's office, featuring assorted elements including a computer, rotating chair and two syringes.\nMonitor Arkham Asylum with Aaron Cash in the ward office with assorted elements including a desk, computer, safe, donut and video tapes.\nFeed the prisoners in the canteen featuring a table and assorted elements including trays, plates, sausages, pretzels, donut, cheese, watermelon, and juice and milk cartons, plus a separate picnic table build with four minifigure seats.\nVisit the inmates in the visitors' room featuring a partition wall with window element and a phone element on each side.\nThe laundry room includes two washing machines, washing powder box, broom and other assorted elements.\nAlso includes weight training equipment elements like a bench for a minifigure with a barbell stand and barbell, plus two dumbbell hand weights.\nThe lookout tower features five levels and assorted play-inspiring elements including a basketball hoop, two boxes of TNT explosives, three computer monitors and two loudspeakers.\nPolice car features a removable roof to easily place three minifigures inside, opening doors, an opening trunk and translucent police-light-style elements.\nAccessory elements include Batman’s Phantom Zone Projector, cape and new-for-spring-2017 molded utility belt, Robin’s cape, Dr. Harleen Quinzel’s clipboard, Aaron Cash’s hook, and the GCPD officers’ two walkie-talkies and two handcuffs\nThis set offers an age-appropriate build and play experience for ages 12+.\nArkham Asylum measures over 11” high, 18” wide and 9” long.\nLookout tower measures over 11” high, 3” wide and 1” long.\nPolice car measures over 1” high, 5” long and 1” wide.","review_difficulty":"Average","set":"Arkham Asylum","star_rating":3.8,"theme":"THE LEGO® BATMAN MOVIE","val_star_rating":3.3,"country":"AU"}