{"ages":"8-12","list_price":121.9878,"num_reviews":6.0,"piece_count":813.0,"play_star_rating":4.5,"prod_short_desc":"Discover the secrets of the jungle with the LEGO® City explorers!","prod_id":60161.0,"prod_long_desc":"Uncover amazing things at the Jungle Exploration Site, featuring a plane wreck with opening cockpit, amphibious helicopter with minifigure cockpit, spinning rotors and winch, heavy observation truck with minifigure cab, folding crane arm, observation room and space for the included motorbike on the back, plus an amphibious vehicle with minifigure cab, and cave and temple build. Includes 7 minifigures, plus leopard, crocodile, snake, frog and 2 spider figures.\nIncludes 7 minifigures: a pilot, 2 drivers and 4 scientist\/explorers, plus leopard, crocodile, snake, frog and 2 spider figures.\nFeatures an amphibious helicopter with minifigure cockpit, winch, spinning rotors and pontoons, plus a heavy observation truck with an articulated crane arm, room for the kayak on top and motorcycle on the back, and an amphibious vehicle with minifigure cockpit and storage compartments.\nAlso includes a plane wreck build with opening cockpit and room for a box, a cave with leopard pounce function, a temple with boulder release and trapdoor functions, plus a buildable Venus flytrap with closing ‘mouth’.\nRemove the top of the truck to access the observation room.\nLift up the plane’s cockpit with the crane arm to discover the treasure.\nPush the release function on the back of the cave to make the leopard pounce.\nLower the helicopter winch and haul away the treasure.\nPull the vine to send the boulder tumbling.\nPull the lever to release the temple trapdoor.\nPush the top of the Venus flytrap down to trap the spider.\nAccessory elements include a map, 2 boxes, one red crystal, one red diamond, 2 golden frog statues, boulder, shovel, crowbar, chicken leg, machete, compass, axe, paddle and a buildable campfire.\nHelicopter with rotors measures over 3” high, 9” long and 7” wide.\nHeavy observation truck measures over 3” high, 7” long and 2” wide.\nAmphibious vehicle measures over 1” high, 4” long and 2” wide.\nMotorbike measures over 1” high and 2” long and under 1” wide.\nKayak measures over 4” long.\nPlane and temple build measures over 7” high, 12” wide and 6” long.\nVenus flytrap build measures over 2” high, 1” wide and 1” long.\nCrocodile figure measures over4” long.\nLeopard figure measures over 3” long.","review_difficulty":"Average","set":"Jungle Exploration Site","star_rating":4.3,"theme":"City","val_star_rating":4.0,"country":"NL"}