{"ages":"5-12","list_price":42.5929,"num_reviews":2.0,"piece_count":347.0,"play_star_rating":4.5,"prod_short_desc":"Race to the rescue on land and sea!","prod_id":60165.0,"prod_long_desc":"Join the rough and ready crew of the LEGO® City coast guard and their 4x4 Response Unit, featuring a 4x4 truck with opening minifigure cab, opening rear compartment with space for tools and gear, and a detachable trailer for the included rescue craft with room for 2 minifigures, drop-down engines and spinning propellers, radio antennas, toolbox and life preservers. There’s also a diver’s dinghy with dive gear, engine and fire elements. Includes 3 minifigures, plus an octopus figure.\nIncludes 3 minifigures: a captain\/driver, female coast guard member and a diver, plus an octopus figure.\nFeatures a 4x4 truck with minifigure cab, radio antenna, opening rear compartment for tools and gear, and a detachable trailer for the rescue craft with a toolbox, 2 radio antennas and drop-down engines with spinning propellers.\nAlso includes a small diver’s dinghy with engine and a buildable buoy.\nRescue craft and dinghy float!\nHitch the trailer to the 4x4 truck and head off on a rescue call.\nGrab the fire extinguisher and put out the fire.\nRescue the diver before the octopus grabs him!\nAccessory elements include 2 life preservers, 2 fire elements, 2 walkie-talkies, camera, binoculars, box, megaphone, 2 bottles, 2 life vests, dive mask, flippers and a fire extinguisher.\n4x4 truck measures over 4” high, 4” long and 2” wide.\nTrailer measures over 1” high, 7” long and 2” wide.\nRescue craft measures over 3” high, 7” long and 2” wide.\nDiver’s dinghy measures over 1” high, 3” long and 1” wide.\nOctopus figure measures over 2” long, 1” wide and under 1” high.\nBuoy measures over 3” high, 1” wide and 1” long.","review_difficulty":"Very Easy","set":"4 x 4 Response Unit","star_rating":5.0,"theme":"City","val_star_rating":5.0,"country":"NZ"}