{"ages":"16+","list_price":207.3878,"num_reviews":62.0,"piece_count":2480.0,"play_star_rating":4.4,"prod_short_desc":"Discover a place where music is on the menu!","prod_id":10260.0,"prod_long_desc":"Drop in at the LEGO® Creator Expert 10260 Downtown Diner, where you’ll discover a healthy portion of fun and surprises. This impressive model features removable building sections for easy access to the detailed interior, which comprises a ground-level 1950s-style diner with a large curved front window, red bar stools, jukebox, counter and an open-plan kitchen. The mid level has a gym with boxing ring, punching bag and weight training room, while on the upper-level you'll find a recording studio, complete with vocal booth, mixing desk and a refreshments cabinet. The facade of the building features pink-and-teal Streamline Moderne styling with a large ‘DINER’ sign. Other external features include arched windows, balconies and a staircase, plus a pink convertible car and a detailed sidewalk, complete with mailbox, parking meter, flowerpots and a streetlamp. This incredible collectible toy has been designed to provide a challenging and rewarding building experience with a touch of nostalgia and charm. Includes 6 minifigures.\nIncludes 6 minifigures: a chef, waitress, boxer, rock star, manager and a bodybuilder.\nThe 3-level Downtown Diner comes with an array of brick-built details, including a detailed facade with pink-and-teal Streamline Moderne styling and a large ‘DINER' sign, external staircase, arched windows, drainpipe, balconies, decorative roofline, opening skylight and a rooftop terrace, plus a detailed sidewalk with a mailbox, parking meter, flowerpots and an ornate streetlamp. This set also includes a pink 1950s-style convertible.\nGround level features 1950s downtown American diner styling with a large curved front window, red barstools, benches, jukebox, candy machine, counter, 2 soda dispensers, and a kitchen with a coffee machine, stove and a cooker hood.\nMid-level features a gym with a boxing ring, punching bag, weight training room, water dispenser and a wall clock.\nUpper level features a recording studio complete with vocal booth, soundproofed walls, mixing desk and a refreshments cabinet.\nTake a ride in the stylish convertible and head for a diner where fast food and music are on the menu.\nHelp the chef prepare the fastest food in town while the roller-skating waitress lines up the orders.\nDrop in at the gym for a couple of rounds in the boxing ring or a good workout on the punching bag.\nOpen the skylight and eavesdrop on the making of a hit album.\nAccessory elements include roller skates, guitar, golden record award and a buildable barbell.\nRemove the building sections to access the detailed interior.\nThis set includes over 2,480 pieces and is suitable for ages 16+.\nNew-for-January-2018 decorated elements include a decorated door, album cover, lots of teal-colored and pink-colored elements, and a dual-face minifigure with singing and smiling expressions.\nSpecial elements include new-for-January-2018 flower stalks and flower heads, plus 1x3 ‘jumper' plates, 2x2 plate with 2 studs and a minifigure torso with boxing gloves.\nCollect and build an entire town with the LEGO® Creator Expert Modular Buildings series 10243 Parisian Restaurant, 10246 Detective’s Office, 10251 Brick Bank and 10255 Assembly Square.\nMeasures over 13” high, 9” wide and 9” long.","review_difficulty":"Challenging","set":"Downtown Diner","star_rating":4.6,"theme":"Creator Expert","val_star_rating":4.3,"country":"PT"}