{"ages":"7-14","list_price":30.4878,"num_reviews":8.0,"piece_count":204.0,"play_star_rating":4.1,"prod_short_desc":"Help Batman™ to stop Scarecrow™ delivering a special scare pizza!","prod_id":70910.0,"prod_long_desc":"Save Gotham City Energy Facility from a fear gas attack with this action-packed THE LEGO® BATMAN MOVIE: Scarecrow™ Special Delivery set, featuring Scarecrow’s pizza delivery bike with cart and a security booth. Pop out the sides of the bike’s cart by turning the sign on the roof to reveal the fear gas canister. Move the security booth’s boom barrier up and down or smash through it with the bike. Includes three minifigures.\nIncludes three minifigures: Batman™, Scarecrow™ and a security guard.\nPizza delivery bike features a minifigure cockpit, translucent headlight elements, cart with a pop-out-sides function and a fear gas canister.\nRotate the pizza sign on the cart roof to pop out the sides and reveal the fear gas canister.\nThe security booth features a boom barrier which can move up and down and ‘explode' off when the bike drives through it. Also includes a roof for Batman™ to leap from, ‘Gotham Energy' sticker, and assorted elements including a security camera, mug and other translucent light-style elements.\nWeapons include Batman’s two Batarangs.\nAccessory elements include Batman’s cape and new-for-spring-2017 molded utility belt, Scarecrow’s helmet, pizza and pizza box, and the security guard's hat.\nThis set offers an age-appropriate build and play experience for ages 7+.\nConnect the security booth to other builds from 70900 The Joker™ Balloon Escape and 70901 Mr. Freeze™ Ice Attack to create an even bigger power station.\nPizza delivery bike with cart measures over 3” high, 4” long and 1” wide.\nSecurity booth with barrier lowered measures over 3” high, 3” wide, 3” long.","review_difficulty":"Average","set":"Scarecrow™ Special Delivery","star_rating":4.4,"theme":"THE LEGO® BATMAN MOVIE","val_star_rating":4.1,"country":"AT"}