{"ages":"16+","list_price":159.99,"num_reviews":177.0,"piece_count":2262.0,"play_star_rating":4.4,"prod_short_desc":"Discover hidden clues and surprises at the Detective's Office!","prod_id":10246.0,"prod_long_desc":"Discover a world of mystery and adventure with the LEGO® Creator Expert Detective’s Office! Step through the open archway and into the barbershop, where seated customers are pampered in the reflection of a large wall mirror, while next door, competitors play pool and darts beneath the comforting whir of a rotating ceiling fan. Venture to the first floor and you’ll find the detective’s office, his desk strewn with clues, a safe containing valuable evidence and a concealed wall compartment. Then visit the adjacent bathroom, featuring a classic pull-chain toilet, before taking the stairway to the well-equipped kitchen, from where you can access the roof terrace, complete with large water tower. This latest addition to the LEGO Modular Building series is packed with unsurpassed detail and hidden surprises. Easy-to-remove roof and ceilings provide access to the delightful interior, while the exterior of the building features a decorative roofline and a beautifully designed façade. Can you solve the smuggling mystery? Includes 6 minifigures with assorted accessories: Detective Ace Brickman, Al the barber, dart player, pool player, police woman and a mysterious lady in red.\nBuild Ace Brickman’s Office and solve the mystery of the lady in red!\nIncludes Detective Ace Brickman, Al the barber, dart player, pool player, police woman and a mysterious lady in red minifigures\nLEGO Creator Expert building toys are compatible with all LEGO construction sets for creative building\nThe building is over 10” high, 9” long and 9” wide\n2262 pieces – For LEGO fans over 16 years old","review_difficulty":"Challenging","set":"Detective’s Office","star_rating":4.6,"theme":"Creator Expert","val_star_rating":4.4,"country":"US"}