{"ages":"16+","list_price":391.5,"num_reviews":143.0,"piece_count":2704.0,"play_star_rating":4.2,"prod_short_desc":"Discover the iconic Porsche 911 GT3 RS!","prod_id":42056.0,"prod_long_desc":"Experience the iconic Porsche 911 GT3 RS with this authentic LEGO® Technic replica. Inside the box you’ll discover a special collector’s book chronicling the history of LEGO Technic and Porsche GT cars, together with 4 original-design rims bearing the RS emblem. The sets of elements are boxed, and the building sequence gives an insight into the real-life vehicle’s assembly process. The model features detailed, orange bodywork, red suspension springs, detailed headlights, taillights, brake calipers and rims with low-profile tires. The accessible cockpit features a detailed dashboard, working gearbox, steering wheel with gearshift paddles, racing seats and a glove compartment containing a unique serial number. Functions include opening doors and hood with storage compartment and suitcase, and an opening rear lid that houses a detailed flat 6 engine with moving pistons. This 1:8 scale model has been designed to provide an immersive and rewarding building experience.\nFeatures authentically designed aerodynamic bodywork, adjustable rear spoiler, headlights and taillights, red suspension springs, original-design rims with RS emblem, detailed brake calipers, low-profile tires, working gearbox, working steering wheel with gearshift paddles, detailed seating, glove compartment with unique model serial number, opening doors, opening hood containing a suitcase, and an opening rear lid with detailed flat 6 engine.\nIncludes a collection of authentic stickers.\nCheck out the orange color scheme.\nOpen the doors to access the detailed cockpit.\nLift the rear lid to access the detailed flat 6 engine with moving pistons.\nOpen the glove compartment to reveal the unique serial number.\nDelivered in luxurious box packaging.\nIncludes a special full-color collector’s book including the history of LEGO® Technic and Porsche GT cars, plus comprehensive building instructions.\nThis LEGO® Technic model is designed to provide an immersive and rewarding building experience.\nThis set includes over 2,700 pieces.\nThis set offers an age-appropriate building experience for ages 16+.\nPorsche 911 GT3 RS measures over 6” high, 22” long and 9” wide.","review_difficulty":"Challenging","set":"Porsche 911 GT3 RS","star_rating":4.7,"theme":"Technic","val_star_rating":4.3,"country":"PL"}