{"ages":"4-7","list_price":67.0878,"num_reviews":null,"piece_count":150.0,"play_star_rating":null,"prod_short_desc":"Defend the baby dinosaur and eggs from the angry T. rex!","prod_id":10758.0,"prod_long_desc":"Introduce your child to the thrill of a LEGO® Juniors Jurassic World adventure! This thrilling T. rex Breakout set features a posable, buildable T. rex with opening mouth, 2 Quick Start bases with gate, breakable fence and wall element, small science station and a truck with Quick Start chassis. This fun construction toy includes a simple guide to build and play, to help build confidence in children ages 4-5. Includes Claire, guard and scientist minifigures, a T. rex figure and a baby dinosaur figure.\nIncludes 3 minifigures: Claire, a guard and a scientist, plus T. rex and baby dinosaur figures.\nFeatures 2 Quick Start bases (one with an opening gate and the other with a wall element), movable robot arm and attached breakaway fence section, plus a small science station with case, screen and small fenced area.\nAlso includes a truck with Quick Start chassis, opening back and room for a crate, plus a posable, buildable T. rex with opening jaw.\nClimb the ladder by the gate to look for the T. rex.\nLower the robot arm with the attached hot dog to distract the T. rex from the fence.\nLoad the baby dinosaur or the dinosaur egg in the crate into the back of the truck before the T. rex breaks through the gate.\nBuild and rebuild the fence after the T. rex knocks it down.\nAccessory elements include 2 dinosaur eggs, box, tranquilizer gun, stick, 2 walkie-talkies and a hot dog.\nThis awesome construction toy is suitable for ages 4+.\nIncludes Easy to Build models with Quick-Start bases, plus a simple guide to get children building and playing quickly.\nLEGO® Juniors sets are fully compatible with all other LEGO sets.\nT. rex measures over 4” high, 11” long and 2” wide.\nTruck measures over 2” high, 3” long and 1” wide.\nMain gate with fence measures over 5” high, 8” wide and 4” long.\nScience station measures over 2” high, 3” wide and 1” long.","review_difficulty":null,"set":"T. rex Breakout","star_rating":null,"theme":"Juniors","val_star_rating":null,"country":"NL"}