{"ages":"8-12","list_price":149.99,"num_reviews":5.0,"piece_count":1277.0,"play_star_rating":5.0,"prod_short_desc":"Help out the volcano explorers and bring in the big equipment!","prod_id":60125.0,"prod_long_desc":"Take part in big discoveries with the massive Volcano Heavy-lift Helicopter, featuring 2 sets of spinning rotors, an opening rear hatch and lowering crane, plus a volcano with eruption function, mobile lab that opens at the front, mobile boulder cracker, lifter, dumper and 4 boulders that open to reveal a crystal element inside. Includes 8 minifigures.\nIncludes 8 minifigures: a female volcano explorer, female scientist, female volcano worker, 2 volcano adventurers, male volcano worker, pilot and a scientist with heatsuit.\nFeatures a Volcano Heavy-lift Helicopter, volcano with eruption function, mobile lab, dumper, mobile boulder cracker and a lifter.\nVolcano Heavy-lift Helicopter features a lowering crane, rear opening hatch, dual spinning rotors and space for a box and tools in the back.\nVolcano features an eruption function activated by a lever.\nMobile lab features rolling wheels and a front-opening panel.\nMobile boulder cracker includes a box to hold a crystal element.\nLifter features moving wheels and moving arms that can hold a boulder or box.\nDumper features rolling wheels and space in the back to carry items.\nUse the helicopter crane to carry and lower the mobile lab and other equipment.\nPush the lever on the volcano to make it erupt and release the lava boulders.\nSet a boulder in the mobile cracker and open it to find the crystal element inside.\nAccessory elements include 4 boulders with crystal element inside, a camera, walkie-talkie, shovel, pickaxe, jackhammer, metal detector and a box.\nHeadgear accessory elements include 4 hard hats, hard hat with headphones, adventurer's hat, pilot's helmet and a heatsuit helmet.\nHeavy-lift Helicopter measures over 6” high, 18” long and 10” wide.\nVolcano measures over 5” high, 7” wide and 3” long.\nMobile lab measures over 3” high, 5” wide and 3” long.\nMobile boulder cracker measures over 3” high, 5” wide and 3” long.\nLifter measures over 2” high, 5” long and 2” wide.\nDumper measures over 2” high, 4” long and 2” wide.","review_difficulty":"Average","set":"Volcano Heavy-lift Helicopter","star_rating":4.6,"theme":"City","val_star_rating":4.2,"country":"US"}