{"ages":"10-16","list_price":63.7971,"num_reviews":12.0,"piece_count":603.0,"play_star_rating":4.2,"prod_short_desc":"Experience the BMW R 1200 GS Adventure!","prod_id":42063.0,"prod_long_desc":"Explore the high-tech innovation of the BMW R 1200 GS Adventure with this authentic LEGO® Technic replica, featuring a blue and black color scheme, black spoke wheels with all-terrain tires, windshield and a detailed dashboard and exhaust. Functions include handlebar steering, front and rear suspension, two-cylinder boxer engine with moving pistons, visible shaft drive, opening top case and luggage panniers, and a kickstand. This 2-in-1 model has been designed to provide an immersive and rewarding building experience. It was developed in partnership with BMW and rebuilds into a unique concept model, created in collaboration with BMW designers. A free interactive, 3D digital LEGO® Building Instructions app is available online, for both models.\nFeatures black spoke wheels with all-terrain tires, windshield, detailed dashboard and exhaust, working steering, stabilizing telelever front suspension and rear suspension, 2-cylinder boxer engine with moving pistons, visible shaft drive, opening top case and luggage panniers, and a kickstand.\nCheck out the cool blue and black color scheme.\nIncludes a collection of authentic stickers.\nManeuver the BMW R 1200 GS Adventure and see the engine and shaft drive spring to life.\nA uniquely decorated LEGO® Technic 40th Anniversary brick is included with this model.\nThis LEGO® Technic model is designed to provide an immersive and rewarding building experience.\nThis set offers an age-appropriate building experience for ages 10-16.\nInteractive, 3D digital LEGO® Building Instructions app available online for both A and B models. Ask your parents' permission.\n2-in-1 model: rebuilds into a unique concept model, created in collaboration with BMW designers.\nBMW R 1200 GS Adventure measures over 7” high, 13” long and 3” wide.\nAlternative model measures over 4” high, 11” long and 7” wide.","review_difficulty":"Average","set":"BMW R 1200 GS Adventure","star_rating":4.7,"theme":"Technic","val_star_rating":4.4,"country":"PL"}