{"ages":"8-12","list_price":42.6878,"num_reviews":10.0,"piece_count":386.0,"play_star_rating":3.2,"prod_short_desc":"Enjoy eco-friendly adventures with the 3-in-1 Modern Home!","prod_id":31068.0,"prod_long_desc":"Build the bright and airy Modern Home, featuring a white, brown and pale-blue color scheme, large windows, solar skylight, upper-level bedroom and balcony with parasol, and a ground-level room with sofa and armchair. Mix and match the buildable modules to create a rooftop terrace, and easily swap the window, door and other modular sections to customize the house with the new-for-June-2017 LEGO® Creator modular system. Combine this set with the 31067 and 31069 modular-system sets to create a dream house with endless build and play opportunities! This 3‑in‑1 LEGO Creator model can also be rebuilt to create a Lakeside Home or a Garden Home. Includes 2 minifigures.\nIncludes 2 minifigures: a woman and a boy, plus a buildable dog figure.\nThe Modern Home features a smooth facade with large windows, solar skylight, upper-level bedroom and balcony with parasol, ground-level room, garden area with buildable outdoor wall lamp, trampoline, flowers and trees, plus a charging station and an electric car with minifigure cockpit.\nInterior details include 2 beds, sofa and an armchair.\nTake the modern electric car for a spin.\nLift the solar skylight to cool the house while capturing the power of the sun.\nHave fun on the trampoline.\nEnjoy a walk with the cute dog.\nMix and match the easy-to-connect, buildable modules to create a rooftop terrace, and easily swap the window, door and other modular sections to customize the house with the new-for-June-2017 LEGO® Creator modular system.\nIncludes a buildable toy helicopter.\nCombine with the 31067 and 31069 LEGO® Creator modular buildings to create a dream house with endless build and play opportunities!\n3-in-1 model: rebuild to create a Lakeside Home or a Garden Home.\nModern Home measures over 6” high, 5” wide and 3” long.\nLakeside Home with jetty measures over 4” high, 6” wide and 7” long.\nGarden Home measures over 5” high, 5” wide and 5” long.","review_difficulty":"Average","set":"Modular Modern Home","star_rating":3.8,"theme":"Creator 3-in-1","val_star_rating":3.9,"country":"PT"}