{"ages":"7-12","list_price":115.9971,"num_reviews":1.0,"piece_count":883.0,"play_star_rating":5.0,"prod_short_desc":"Head to the LEGO® City mine and dig up some gold!","prod_id":60188.0,"prod_long_desc":"Grab your hard hat and head out to the LEGO® City Mining Experts Site to make new discoveries! This thrilling children's toy features a large grinder\/crusher with minifigure cab and raising arm, a front loader with raising shovel and a dump truck with tilting bed. It also includes a large mine system with golden nugget elements, explode function, hidden golden nugget element and a chute and track system with rotating chute and 2 mine carts, plus a mobile lab. Includes 6 minifigures plus bear and glow-in-the-dark spider figures.\nIncludes 6 minifigures: 2 drivers, a demolition expert, miner, scientist and a chief, plus bear and spider figures.\nFeatures a massive grinder\/crusher with minifigure cab and raising arm, plus a small front loader with raising shovel and a dump truck with tilting bed.\nAlso includes a large mine with breakaway elements to reveal a hidden golden nugget, a turning chute, track system with 2 mine carts, and a mobile lab.\nSpider glows in the dark!\nTurn the knob on the side of the grinder\/crusher to spin the drill wheel.\nRaise the grinder\/crusher arm to lift or lower the drill wheel along the side of the mine.\nDrop nuggets down the chute into the mine cart, then empty the cart’s load into the dump truck’s bed.\nDump the golden nuggets out of the truck bed and use the front loader to haul them to the mobile lab, before you use the triggers to blow open the hidden cache in the mine.\nAccessory elements include a dynamite stick element, pickaxe, megaphone, chicken leg and 12 golden nugget elements.\nThis children's toy is suitable for ages 7-12.\nGrinder\/crusher measures over 6” high, 11” long and 4” wide.\nFront loader measures over 2” high, 3” long and 1” wide.\nDump truck measures over 2” high, 4” long and 1” wide.\nMine carts each measure over 1” high, 1” long and 1” wide.\nMine with track measures over 4” high, 5” wide and 14” long.\nMobile lab measures over 1” high, 1” wide and under 1” long.","review_difficulty":null,"set":"Mining Experts Site","star_rating":5.0,"theme":"City","val_star_rating":5.0,"country":"PL"}