{"ages":"2-5","list_price":49.6929,"num_reviews":null,"piece_count":69.0,"play_star_rating":null,"prod_short_desc":"Play out everyday scenes and routines in the Family House!","prod_id":10835.0,"prod_long_desc":"Play out real-life scenarios in LEGO® DUPLO® My Town: a recognizable world with modern DUPLO figures. There are endless play opportunities in this easy-to-build house—toddlers can have fun practicing activities and routines, from getting up in the morning, preparing and eating a meal to washing the car. Watch role-play skills develop as they play out everyday life with three DUPLO figures.\nIncludes three LEGO® DUPLO® figures: a mom, dad and a child.\nFeatures a modular house over three levels with a kitchen with opening oven, bathroom with toilet, basin and opening mirror cabinet, bedroom with beds, child’s room with opening dormer windows, roof terrace dining area, interior shelves, opening doors, and a car.\nIncludes bricks decorated as a mirror, toilet paper, alarm clock, oven and a teddy bear as story starters.\nAccessory elements include a cooking pot, plate, baguettes, jug, cup, brush and flowers.\nUse the modern characters, accessories and decorated bricks to help reinforce daily routines and play out everyday scenarios with your toddler.\nThis fun and easy-to-build family house encourages early construction skills and presents endless play opportunities.\nThe modular structure means this set can be rearranged and built in lots of different ways.\nToddlers will enjoy pretending to help dad wash the car or bake the baguettes in the oven.\nLEGO® DUPLO® products are specially designed to be safe and suitable for small hands.\nThis set offers an age-appropriate build and play experience for ages 2-5.\nFamily House measures over 11” high, 14” wide and 3” long.\nCar measures over 1” high, 3” long and 2” wide.\nThere are several My Town products to collect and play out your child’s everyday life in a recognizable LEGO® DUPLO® world.","review_difficulty":null,"set":"Family House","star_rating":null,"theme":"DUPLO®","val_star_rating":null,"country":"NZ"}