{"ages":"8-12","list_price":36.5878,"num_reviews":5.0,"piece_count":379.0,"play_star_rating":4.0,"prod_short_desc":"Enjoy seaside fun with the 3-in-1 Sunshine Surfer Van set!","prod_id":31079.0,"prod_long_desc":"Head out on summer adventures with the Sunshine Surfer Van set, featuring a camper with a bright yellow, white and blue color scheme, and a host of realistic details including a roof rack for storing the included surfboard, foldaway sun lounger and chair, parasol, table and barbecue. Remove the roof and side section for access to the detailed interior, complete with fold-down bed, TV and kitchenette. This 3-in-1 LEGO® Creator construction toy rebuilds into a Lifeguard Tower or a Beach Buggy for even more seaside fun, and includes 2 minifigures, both ready for summer adventures.\nIncludes 2 minifigures: a woman and a man, both ready for summer adventures.\nFeatures a camper van with a fold-down bed, TV, sofa and kitchenette, plus tinted windows, large wing mirrors and a roof rack with detachable accessories, including a brick-built parasol, barbecue, table and a foldaway sun lounger and chair, plus a surfboard.\nCheck out the summery yellow, white and blue color scheme.\nRemove the roof and side section for access to the detailed interior, where you can cook up a meal in the cozy kitchenette or watch some TV from the comfort of the fold-down bed.\nLoad up the Sunshine Surfer Van, jump aboard and head out on a summer adventure!\nFold out the sun lounger, table and chair, light up the barbecue and try a spot of surfing.\nContinue the adventure with this 3-in-1 model. Rebuild the Sunshine Surfer Van to create a Lifeguard Tower and rush to the rescue on a cool quad bike, or create an awesome Beach Buggy for racing over the dunes.\nThis construction toy is suitable for ages 7-12.\nSunshine Surfer Van measures over 3” high, 9” long and 3” wide.\nLifeguard Tower measures over 5” high, 5” wide and 6” long.\nBeach Buggy measures over 1” high, 5” long and 2” wide.","review_difficulty":"Easy","set":"Sunshine Surfer Van","star_rating":4.4,"theme":"Creator 3-in-1","val_star_rating":4.2,"country":"AT"}