{"ages":"5-12","list_price":35.4929,"num_reviews":2.0,"piece_count":222.0,"play_star_rating":5.0,"prod_short_desc":"Explore the secrets of the sea with Ariel and Flounder.","prod_id":41145.0,"prod_long_desc":"Slide back the glass door and step inside Disney Princess™ Ariel’s Cave. Swim over to Ursula’s grotto and place Ariel at the revolving stand to reveal her human legs. This set is easy to build and perfect for fans of Disney’s The Little Mermaid to reenact their favorite scenes or create new stories of their own. Includes 2 mini-doll figures plus a Flounder figure.\nIncludes 2 mini-doll figures from Disney’s The Little Mermaid: Ursula and Ariel with switchable mermaid tail or legs, plus a Flounder figure.\nFeatures Ariel’s Cave, Ursula’s grotto and a revolving stand to reveal Ariel’s human legs.\nAriel’s cave features a sliding door function, vanity, clamshell seat, hideout for Flounder, treasure chest and a ship’s wheel.\nUrsula’s grotto features a buildable crystal globe to contain Ariel’s voice.\nAccessory elements include a trident, coins, crystals, cookie, golden cup, potion bottles, lipstick, Ursula’s necklace, Ursula’s contract and a quill.\nRelive key moments from Disney’s The Little Mermaid or create new stories of your own with these iconic characters.\nHang out at Ariel’s cave, trying out new looks at the vanity or playing amongst the treasure with Flounder.\nWill the sea witch Ursula manage to persuade Ariel to sign the contract?\nTurn the revolving stand and swap Ariel’s mermaid tail for legs.\nAriel’s cave measures over 5” high, 5” wide and 3” long.\nUrsula’s grotto measures over 3” high, 3” wide and 3” long.\nRevolving stand measures over 3” high, 2” wide and 1” long.","review_difficulty":"Average","set":"Ariel and the Magical Spell","star_rating":5.0,"theme":"Disney™","val_star_rating":4.5,"country":"NZ"}