{"ages":"4-7","list_price":37.9924,"num_reviews":1.0,"piece_count":178.0,"play_star_rating":5.0,"prod_short_desc":"Capture Brick before she knocks the house down!","prod_id":10761.0,"prod_long_desc":"Fire up your child's imagination for some LEGO® Juniors The Incredibles 2 adventures with The Great Home Escape set. This exciting set features a house facade with Quick Start wall and baseplate, moving fireplace with secret control panel, waterfall with capture function, a pool area, lounge chair with catapult function, plus a buildable car with Quick Start chassis and removable catapult. This fun children's toy also includes a simple guide to build and play, to help build confidence in children ages 4-5. Includes 3 minifigures and a baby figure.\nIncludes 3 minifigures: Violet, Dash and Brick, plus a Jack-Jack figure.\nFeatures a house facade and wall with Quick Start baseplate, opening door, moving fireplace with control panel and a waterfall with a closing door. Set also includes a pool section with umbrella and ladder, and a lounge chair with catapult function.\nAlso includes a car with a Quick Start chassis and removable catapult.\nSlide the fireplace to access the secret control panel.\nFire bricks at the house with Brick's catapult.\nLaunch the Jack-Jack fireball at Brick’s car to slow her down.\nTrap Brick in the indoor waterfall by closing the door.\nAccessory elements include a force shield, water pistol, skateboard, The Incredibles’ phone, remote control, juice carton, hollow fireball, flotation device and 6 brick elements.\nThis exciting children's toy is suitable for ages 4+.\nIncludes Easy to Build models with Quick-Start bases, plus a simple guide to get children building and playing quickly.\nLEGO® Juniors sets are fully compatible with all other LEGO sets.\nHouse scene measures over 3” high, 7” wide and 3” long.\nPool measures over 2” high, 2” wide and 1” long.\nBrick’s car measures over 1” high, 3” long and 1” wide.","review_difficulty":"Very Easy","set":"The Great Home Escape","star_rating":5.0,"theme":"Juniors","val_star_rating":4.0,"country":"AU"}