{"ages":"12+","list_price":304.9878,"num_reviews":11.0,"piece_count":2863.0,"play_star_rating":4.3,"prod_short_desc":"Experience the Mountain Cave!","prod_id":21137.0,"prod_long_desc":"Build and experience the Mountain Cave, featuring an amazing minecart track with an integrated redstone‑powered minecart elevator, and an array of other features and functions, including TNT blasting, rotating spider‑spawner, charged Creeper™ explosion and a lava burst. Position the light brick to illuminate the rotating spider-spawner, wall of redstone, jack o’lantern, first-night shelter, furnace, lava or the torch above the cave entrance. Enjoy hands‑on Minecraft™ adventures featuring your favorite characters and objects with this easy-to-reconfigure, modular LEGO® Minecraft set designed for young fans of the highly successful sandbox video game. Includes Steve and Alex minifigures, plus 13 mobs including a charged Creeper™.\nIncludes 2 minifigures: Steve and Alex, plus a cave spider, wolf, baby wolf, slime, 2 small slimes, 2 bats, zombie, enderman, skeleton, sheep and a charged Creeper™.\nFeatures a minecart track with an integrated redstone-powered minecart elevator; 2 minecarts; first-night shelter with bed, crafting table and torch; a mountaintop shelter with bed, torch and furnace; plus a light brick, trees, waterfall, lava and extra torches.\nOpen up the model to access the detailed interior and remodel with easy-to-connect modular sections.\nRemove the diamond ore elements and activate the lava burst function.\nActivate the revolving cave-spider spawner.\nTrigger the charged Creeper™ explosion function.\nJump aboard the minecart and race around the track, and travel to the mountaintop aboard the redstone powered minecart elevator.\nBlast through the mountain with the TNT to extend the rail track.\nPosition the light brick to illuminate the rotating spider-spawner, wall of redstone, jack o’lantern, first-night-shelter, furnace, lava or the torch above the cave entrance.\nEnjoy easy access to the detailed interior.\nPut on your golden armor, grab your diamond sword and shield, and prepare for battle!\nWeapons include a sword and a bow.\nAccessory elements include a Minecraft™ clock, spider eyes, signs, map, golden armor, shield, TNT and 8 ore style elements, including diamond, lapis lazuli, emerald, redstone, golden, iron and 2 coal ores.\nEasy-to-reconfigure, modular design—choose from 3 different model configurations.\nSet your imagination free—rebuild the set for more LEGO® Minecraft™ creations!\nThis set includes over 2,860 pieces.\nMeasures over 12” high, 20” wide and 11” long.","review_difficulty":"Challenging","set":"The Mountain Cave","star_rating":4.5,"theme":"Minecraft™","val_star_rating":4.2,"country":"AT"}