{"ages":"7-14","list_price":11.6922,"num_reviews":1.0,"piece_count":64.0,"play_star_rating":5.0,"prod_short_desc":"Continue your wizarding adventures in LEGO® DIMENSIONS™ with your very own Harry Potter™ Fun Pack featuring Hermione Granger.","prod_id":71348.0,"prod_long_desc":"Enhance you LEGO® DIMENSIONS™ experience with your very own Harry Potter™ Fun Pack featuring Hermione Granger. Simply attach the minifigure to her LEGO Toy Tag and place her on the LEGO Toy Pad to bring her to life in the game, and then activate her special abilities to solve puzzles and battle enemies. Add Buckbeak and then rebuild him into the Giant Owl and Fierce Falcon to enhance your gameplay. This set includes a Hermione Granger minifigure, 3-in-1 vehicle, and the Harry Potter™ Adventure World with a Battle Arena.\nIncludes a buildable Hermione Granger minifigure and rebuildable 3-in-1 Buckbeak.\nCharacter and model includes a detachable LEGO® Toy Tag.\nRebuild Buckbeack into the Giant Owl and Fierce Falcon.\nPlace Hermione and Buckbeak on the LEGO® Toy Pad to bring them to life in the game.\nCast spells with Hermione including Wingardium Leviosa and Lumos.\nUnlocks the Harry Potter™Adventure World and Battle Arena.\nCollect your favorite LEGO® DIMENSIONS™ characters and use them in-game together for a mash-up multiverse of your favorite characters.\nVisit LEGO.com\/DIMENSIONS for more information on this exciting LEGO® building and video-gaming experience. Ask your parents’ permission.\nLEGO® DIMENSIONS™ Starter Pack and internet connection required.\nLEGO® DIMENSIONS™ expansion packs unlock additional content.\nLEGO® DIMENSIONS™ characters and vehicles are required to interact with the LEGO DIMENSIONS video game.\nBuckbeak measures over 2.5” (6.5cm) high, 2.3” (6.0cm) long and 2.1” (5.5cm) wide (alternative 3-in-1 vehicle builds vary in size).","review_difficulty":"Very Easy","set":"Harry Potter™ Fun Pack","star_rating":5.0,"theme":"DIMENSIONS™","val_star_rating":5.0,"country":"CA"}