{"ages":"2-5","list_price":109.99,"num_reviews":22.0,"piece_count":134.0,"play_star_rating":4.6,"prod_short_desc":"Take the rocks down the track with the Deluxe Train Set!","prod_id":10508.0,"prod_long_desc":"Take LEGO® DUPLO® train building to the next level with the Deluxe Train Set featuring a cool modern train! Jump aboard the locomotive with real sound effects and fill up the wagons with rocks at the quarry. Then unload them with the working crane before fueling up for the next trip! Set features more than 64” of track, a bridge with tunnel, truck, DUPLO-brick stone quarry, building with working crane and lots of colorful DUPLO elements and 3 DUPLO figures.\nIncludes 3 LEGO® DUPLO® figures\nFeatures modern DUPLO train with real sound effects, 2 wagons, truck, building with crane, DUPLO-brick stone quarry, tunnel\/bridge section and lots more track\nDecorated DUPLO elements include traffic light, fueling pump, fruit, tools, furniture, fencing and oil can\nExtra DUPLO bricks and flowers also included\nStone quarry features DUPLO-brick stones, tipping function, door and window\nLoad up with rocks at the quarry!\nUnload with the working crane\nOperate the working crane winch\nDrive over the bridge and through the tunnel\nRefuel the train and hear the real sound effects!\nTracks do not conduct electricity and therefore are not compatible with LEGO 9V trains\nFor use with DUPLO trains only\nDUPLO products are specially designed to be fun and and safe for younger hands\nIncludes over 68\" of track\nTrain measures over 3\" high, 5\" long and 2\" wide\nLong wagon measures over 3\" high, 6\" long and 2\" wide\nShort wagon measures over 2\" high, 6\" long and 2\" wide\nBuilding with crane measures over 11\" high, 9\" wide and 6\" long\nStone quarry measures over 6\" high, 11\" wide and 3\" long\nFueling station measures over 5\" high, 6\" wide and 2\" long\nTruck measures over 2\" high, 4\" long and 3\" wide","review_difficulty":"Average","set":"Deluxe Train Set","star_rating":4.1,"theme":"DUPLO®","val_star_rating":3.7,"country":"US"}