{"ages":"16+","list_price":402.5878,"num_reviews":88.0,"piece_count":4867.0,"play_star_rating":4.8,"prod_short_desc":"Live the life of a ninja in NINJAGO® City!","prod_id":70620.0,"prod_long_desc":"Enjoy endless role-play fun in NINJAGO® City, a hugely-detailed 3-level model connected by a sliding elevator. Level 1 features a traditional fish market, house, a bridge over a stream, and a fishing boat. The second level has a modern fashion store, comic book store, crab restaurant with ‘crab-grilling’ function and cash-dispensing ATM. The vertical city is topped off with Lloyd Garmadon and Misako’s apartment, a rooftop sushi bar with sushi conveyor belt, and a radio tower. This action-packed THE LEGO® NINJAGO MOVIE™ set also includes 16 minifigures and Sweep the maintenance robot.\nIncludes 16 minifigures: Jay, Kai and Lloyd Garmadon (each with new-for-August-2017 high school outfit decoration), Green Ninja Suit, Misako, Jamanakai Villager, Sally, Ivy Walker, Konrad, Severin Black, Tommy, Guy, Juno, Mother Doomsday, Shark Army Gunner and Officer Noonan, plus Sweep the maintenance robot.\nFeatures a 3-level model (each level lifts off for easy play) connected by a sliding elevator, plus a traditional fishing boat.\nLevel 1 features a bridge, sewer outlet, stream with translucent-blue and translucent-green water elements, sliding elevator with room for a minifigure, traditional fish market with fish and crab elements, house with dining room and bedroom with sliding screen doors and foldout ‘solar panels’, Sweep the maintenance robot's service station with assorted tool elements, and a taxi stand with telephone element.\nLevel 2 features a modern fashion store with 2 mannequins and assorted NINJAGO® product elements, a construction site with a bonsai tree, a comic book store with brick-built sign, cashier desk, comic book stand with assorted elements including collectible NINJAGO training cards, a crab restaurant with brick-built crab entrance sign and oven with ‘crab-grilling’ function, a cash-dispensing ATM, 15 bank note elements (ATM can dispense up to 13), and a movie poster display stand with 4 interchangeable movie poster elements.\nPlace the uncooked crab element in the oven, turn the dial and open the oven to reveal a cooked crab element.\nPress the handle behind the ATM to dispense bank note elements.\nLevel 3 features a radio tower, modern rooftop sushi bar with sushi conveyor belt function and brick-built food, bathroom with sliding door, and brick-built puffer fish and squid sculptures, Lloyd Garmadon and Misako's apartment with an opening window, bunk bed, kitchen unit and attic space for the Green Ninja Suit minifigure.\nTurn the dial to activate the sushi conveyor belt.\nWeapons include Jay's chain with spike and Shark Army Gunner’s fish flame.\nRecreate and role-play exciting THE LEGO® NINJAGO® MOVIE™ scenes.\nNINJAGO® City measures over 24” high, 12” wide and 16” long.\nTraditional fishing boat measures over 1” high, 3” long and 1” wide.","review_difficulty":"Challenging","set":"NINJAGO® City","star_rating":4.9,"theme":"THE LEGO® NINJAGO® MOVIE™","val_star_rating":4.8,"country":"BE"}