{"ages":"6-12","list_price":19.4922,"num_reviews":32.0,"piece_count":174.0,"play_star_rating":4.6,"prod_short_desc":"Zoom into orbit and recover Green Lantern’s lantern!","prod_id":76025.0,"prod_long_desc":"Sinestro has stolen Green Lantern’s lantern and whisked it away to his home planet of Korugar. Launch a recovery mission with Green Lantern, in his ultra-fast construct spaceship and super-jumping Space Batman™! But evil Sinestro has built a cage around the lantern and is guarding it with his staff. Fire the 2 powerful stud shooters and turn the rear control to activate 2 devastating spring-loaded shooters. Spring into action with Space Batman™ on the Super Jumper to topple Sinestro and explode the cage. With victory assured, leap out of the cockpit and reclaim the lantern! Includes 3 minifigures with accessories: Green Lantern, Space Batman™ and Sinestro.\nIncludes 3 minifigures with accessories: Green Lantern, Space Batman™ and Sinestro\nConstruct spaceship features an opening cockpit, 2 stud shooters, 2 spring-loaded shooters with rear control and translucent green elements\nCage features a plinth for the lantern and explode function\nAccessories include Space Batman’s space wings and exclusive new Super Jumper and Sinestro’s translucent yellow power staff\nGreen Lantern, Space Batman™ and Sinestro are all-new LEGO® minifigures and exclusive to this set!\nPlace Green Lantern in the cockpit and launch into orbit\nGear up Space Batman™ with the cool space wings\nTarget Sinestro with the dual stud shooter\nTurn the rear control to activate the spring-loaded shooters\nSpring open the cage with Space Batman™ on the Super Jumper!\nReclaim the lantern and place Sinestro in the cage\nConstruct spaceship measures over 1” high, 7” long and 6” wide\nCage measures over 4” high, 1” wide and 1” long ","review_difficulty":"Easy","set":"Green Lantern vs. Sinestro","star_rating":4.8,"theme":"DC Comics™ Super Heroes","val_star_rating":4.7,"country":"CA"}