{"ages":"8-14","list_price":67.0878,"num_reviews":8.0,"piece_count":631.0,"play_star_rating":4.7,"prod_short_desc":"Grab, lift, load and deliver at the Container Yard!","prod_id":42062.0,"prod_long_desc":"Enjoy a rewarding build-and-play experience with this robust and detailed 2-in-1 LEGO® Technic Container Yard set, featuring an articulated truck with working steering, opening doors, detachable trailer and two loadable containers, plus a container loader with working steering and extendable boom with working grabber. This set can be rebuilt to create a Container Straddle-Carrier with truck and container. Both models can be built using the free interactive, 3D digital LEGO Building Instructions app, available online.\nFeatures an articulated truck with working steering, opening doors, detachable trailer and two loadable containers, plus a container loader with working steering and an extendable boom with working grabber.\nTruck features a blue and white color scheme.\nContainer loader features an orange and black color scheme.\nSteer the articulated truck into position.\nOperate the loader's boom to grab the containers and lift them into position.\nA uniquely decorated LEGO® Technic 40th Anniversary brick is included with this model.\nThis LEGO® Technic model is designed to provide an immersive and rewarding building experience.\nThis set offers an age-appropriate building experience for ages 9+.\nFree interactive, 3D Digital LEGO® Building Instructions app available online for both A and B models. Ask your parents' permission.\n2-in-1 model: rebuilds into a Container Straddle-Carrier with truck and container.\nTruck with trailer measures over 4” high, 11” long and 2” wide.\nContainer loader with boom extended measures over 9” high, 11” long and 3” wide, and over 3” high and 9” long with boom retracted.\nEach container measures over 1” high, 3” long and 1” wide.\nContainer Straddle-Carrier (fully extended) measures over 9” high, 4” long and 9” wide, and over 6” high and 4” wide when retracted.\nContainer Straddle-Carrier truck with container measures over 3” high, 7” long and 2” wide, and over 2” high without the container.","review_difficulty":"Easy","set":"Container Yard","star_rating":4.8,"theme":"Technic","val_star_rating":4.3,"country":"BE"}