{"ages":"7-14","list_price":14.99,"num_reviews":null,"piece_count":56.0,"play_star_rating":null,"prod_short_desc":"Get ready to save the day in the LEGO® DIMENSIONS™ multiverse with Starfire in the Teen Titans Go!™ Fun Pack!","prod_id":71287.0,"prod_long_desc":"Enhance you LEGO® DIMENSIONS™ experience with your very own Teen Titans Go!™ Fun Pack featuring Starfire! Simply attach the minifigure to her LEGO Toy Tag and place her on the LEGO Toy Pad to bring her to life in the game, and then activate her special abilities to solve puzzles and battle enemies. Add the Titan Robot and then rebuild it into the T-Rocket or Robot Retriever for even more fun! This set includes a Starfire minifigure, 3-in-1 vehicle, and the Teen Titans Go! Adventure World with a Battle Arena with an exclusive Teen Titans Go! episode!\nIncludes a buildable Starfire minifigure and rebuildable 3-in-1 Titan Robot.\nCharacter and model includes a detachable LEGO® Toy Tag.\nRebuild Titan Root into the T-Rocket or Robot Retriever.\nPlace Starfire and Titan Robot on the LEGO® Toy Pad to bring them to life in the game.\nUnleash powerful energy blasts and regain health with Starfire.\nUnlocks the Teen Titans Go!™ Adventure World and Battle Arena.\nCollect your favorite LEGO® DIMENSIONS™ characters and use them in-game together for a mash-up multiverse of your favorite characters.\nVisit LEGO.com\/DIMENSIONS for more information on this exciting LEGO® building and video-gaming experience. Ask your parents’ permission before going online.\nLEGO® DIMENSIONS™ Starter Pack and internet connection required.\nLEGO® DIMENSIONS™ expansion packs unlock additional content.\nLEGO® DIMENSIONS™ characters and vehicles are required to interact with the LEGO DIMENSIONS video game.\nThe Titan Robot measures over 3” high, 1” long and 1” wide (alternative 3-in-1 vehicle builds vary in size).","review_difficulty":null,"set":"Teen Titans Go!™ Fun Pack","star_rating":null,"theme":"DIMENSIONS™","val_star_rating":null,"country":"US"}