{"ages":"8-12","list_price":85.7922,"num_reviews":7.0,"piece_count":712.0,"play_star_rating":3.7,"prod_short_desc":"Train your skills and learn how to become a Super Hero!","prod_id":41232.0,"prod_long_desc":"Join in the action-packed LEGO® DC Super Hero Girls™ world as Supergirl™ and Poison Ivy™ battle Lena Luthor™. This great set features three mini-doll figures, a three-level school building with swiveling classrooms, café, extending ramp, chain and disc shooters, Poison Ivy’s motorbike and Lena’s jet with rotating thrusters and a gripping claw at the front, plus two hypnotized purple Kryptomites.\nIncludes 3 mini-doll figures: Supergirl™, Poison Ivy™ and Lena Luthor™, plus Poison Ivy’s plant Frankie™ and 2 purple Kryptomites.\nFeatures a three-level school building with a large amethyst element on top, two swiveling classrooms with tables, seats and rotating screens, and a café with a TV screen at the top level of the school.\nSchool transforms into defense mode with a ramp that lowers, rotating flags at the front, disc shooter on the roof of one classroom and a chain shooter on top of the school.\nLena Luthor’s jet includes an opening cockpit, rotating thrusters and a rotating gripping claw on the front.\nPoison Ivy’s motorbike includes a plant shooter.\nDefend Super Hero High School and the valuable amethyst from Lena Luthor™ and the Kryptomites with the help of Supergirl™, Poison Ivy™ and her plant Frankie™.\nTransform the school into defense mode by turning the knob on the top level and launch Poison Ivy™ down the ramp on her motorbike.\nAim the chain shooter and shoot at Lena’s jet.\nFire the disc shooter at the Kryptomites.\nTransform the school back to normal after the battle, and celebrate in the café.\nWeapons include three laser pistols, Poison Ivy’s disc, Supergirl’s disc and two chains.\nAccessory elements include a tool cabinet, wrench, growth potion bottle, Supercups, extra cape, amethyst fragment, vine powers, Poison Ivy’s flower, Supergirl’s phone, scissors and a piece of sushi.\nThis set offers an age-appropriate build and play experience for ages 8-12.\nConnect 41235 Wonder Woman™ Dorm to the school to explore dorm life as a Super Hero!\nCute but evil Kryptomites are included in every LEGO® DC Super Hero Girls™ set.\nSchool measures over 11” high, 12” wide and 3” long.\nPoison Ivy’s motorbike measures over 1” high, 3” long and 1” wide.\nLena’s jet measures over 2” high, 5” long and 3” wide","review_difficulty":"Average","set":"Super Hero High School","star_rating":3.9,"theme":"DC Super Hero Girls","val_star_rating":3.6,"country":"CA"}