{"ages":"8-12","list_price":58.4922,"num_reviews":15.0,"piece_count":528.0,"play_star_rating":4.7,"prod_short_desc":"Meet the wildlife at the brightly lit Lighthouse Point!","prod_id":31051.0,"prod_long_desc":"Have fun with this charming model, featuring a lighthouse and a lightkeeper's cottage with detailed interior, including a table, chair, lamp and a painting. The lighthouse includes a LEGO® light brick, and the seashore features lapping waves, a bench, open-air fire, rocks and a pier. This 3-in-1 LEGO Creator set features an easy-to-remodel modular system for extended play scenarios and can be rebuilt to create a house with pier and speedboat or a boathouse. Includes 2 minifigures, plus an orca and 2 seagulls.\nIncludes 2 minifigures, plus a buildable orca and 2 buildable seagulls.\nFeatures a Lighthouse and a lightkeeper's cottage with a detailed interior and seashore theme.\nLighthouse features a functioning light brick, circular lookout balcony, windows and a classic red and white color scheme.\nFold out the model to access the detailed interior.\nLightkeeper's cottage can also fold out to produce 2 blue facades, each with a green door, window and wall lamp.\nLightkeeper's cottage interior includes a chair, table, lamp and a painting.\nSeashore features a beach, bench, open-air fire, rocks, dock, flowers, barrel and a lifesaver.\nUse the camera to take photographs of the friendly wildlife.\nAccessory elements include a camera, 2 cups, sextant and 2 fish.\nUtilize the easy-to-rebuild modular functionality to remodel the set.\nInteractive, 3D Digital LEGO® Building Instructions app available online for this model.\nThis set offers an age-appropriate building experience for ages 8-12.\nThis set includes over 500 LEGO® pieces.\n3-in-1 model: rebuilds into a house with pier and speedboat or a boathouse.\nLighthouse Point measures over 9” high, 9” wide and 5” long.\nHouse with pier and speedboat measures over 4” high, 3” wide and 5” long.\nBoathouse measures over 3” high, 3” wide and 5” long.","review_difficulty":"Average","set":"Lighthouse Point","star_rating":4.7,"theme":"LEGO® Creator 3-in-1","val_star_rating":4.3,"country":"CA"}