{"ages":"7-14","list_price":24.99,"num_reviews":2.0,"piece_count":92.0,"play_star_rating":4.0,"prod_short_desc":"Get devious with DC Comics' The Joker™ & Harley Quinn™!","prod_id":71229.0,"prod_long_desc":"Enhance your LEGO® DIMENSIONS™ experience with the DC Comics™ Team Pack, featuring the demented duo of The Joker™ & Harley Quinn™. Simply attach the minifigures to their LEGO Toy Tags and place them on the LEGO Toy Pad to bring them to life in the game. Then use their special abilities to solve puzzles and battle enemies. Add The Joker's 3-in-1 Chopper and Harley's 3-in-1 Quinn-mobile to boost your gameplay, and then rebuild them into the Mischievous Missile Blaster and The Joker's Lock ‘n Laser Jet or the Quinn Ultra Racer and Missile Launcher for upgraded abilities in the game. This set includes buildable The Joker and Harley Quinn minifigures, each with a weapon.\nIncludes buildable The Joker™ & Harley Quinn™ minifigures, each with a weapon.\nAlso includes rebuildable 3-in-1 The Joker’s Chopper and Quinn-mobile models.\nAll characters and models include a detachable LEGO® Toy Tag.\nRebuild the Joker’s Chopper into a Mischievous Missile Blaster and The Joker’s Lock ‘n Laser Jet.\nRebuild the Quinn-mobile into a Quinn Ultra Racer and Missile Launcher.\nPlace each character and model on the LEGO® Toy Pad and join the action in the game.\nActivate The Joker’s special Grappler, Target, Hazard and Electricity abilities, and Harley Quinn’s Acrobat and Super Strength abilities to solve puzzles and battle enemies.\nCollect your favorite LEGO® DIMENSIONS™ characters and use them in-game together for a crazy mash-up multiverse.\nVisit LEGO.com\/DIMENSIONS for more information on this exciting LEGO® building and video-gaming experience. Ask your parents’ permission before going online.\nLEGO® DIMENSIONS™ Starter Pack and internet connection required.\nLEGO® DIMENSIONS™ expansion packs unlock additional content.\nLEGO® DIMENSIONS™ characters and vehicles are required to interact with the LEGO DIMENSIONS video game.\nThe Joker’s Chopper measures over 1” high, 1” long and 1” wide (alternative 3-in-1 vehicle builds vary in size).\nHarley Quinn’s Quinn-Mobile measures over 1” high, 2” long and 1” wide (alternative 3-in-1 vehicle builds vary in size).","review_difficulty":"Easy","set":"DC Comics™ Team Pack","star_rating":4.0,"theme":"DIMENSIONS™","val_star_rating":3.5,"country":"US"}