{"ages":"7-14","list_price":23.3922,"num_reviews":2.0,"piece_count":118.0,"play_star_rating":5.0,"prod_short_desc":"Search for treasure while avoiding the Fratelli family in the Goonies™ Level Pack!","prod_id":71267.0,"prod_long_desc":"Enjoy more LEGO® DIMENSIONS™ gameplay with the Goonies™ Level Pack featuring Sloth. Simply attach the minifigure to his LEGO Toy Tag and place him on the LEGO Toy Pad to bring him to life in the game. Then use his special abilities to solve puzzles and battle enemies. Add the 3-in-1 One-Eyed Willy’s Pirate Ship and Skeleton Organ to boost your gameplay, and then rebuild them into the Fanged Fortune and Inferno Cannon or Skeleton Jukebox and Skele-Turkey for upgraded abilities in the game. This set includes a buildable Sloth minifigure, two 3-in-1 rebuildable vehicles, a new game level, and a Goonies Adventure World with a Battle Arena.\nIncludes buildable Sloth minifigure, and rebuildable One-Eyed Willy’s Pirate Ship and Skeleton Organ.\nUnlocks an exclusive Goonies™ level of gameplay.\nAll characters and models include a detachable LEGO® Toy Tag.\nRebuild One-Eyed Willy’s Pirate Ship into the Fanged Fortune and Inferno Cannon.\nRebuild the Skeleton Organ into the Skeleton Jukebox and Skele-Turkey.\nPlace Sloth and his vehicles on the LEGO® Toy Pad to join the action in the game.\nUse Sloth's Super Strength to smash through walls and make an escape.\nCollect your favorite LEGO® DIMENSIONS™ characters and use them in-game together for a crazy mash-up multiverse.\nVisit LEGO.com\/DIMENSIONS for more information on this exciting LEGO® building and video-gaming experience. Ask your parents' permission.\nLEGO® DIMENSIONS™ Starter Pack and internet connection required.\nLEGO® DIMENSIONS™ expansion packs unlock additional content.\nLEGO® DIMENSIONS™ characters and vehicles are required to interact withthe LEGO DIMENSIONS video game.\nOne-Eyed Willy’s Pirate Ship measures over 3.3” (8,5cm) high, 3” (7.8cm) long and 1.5” wide (alternative 3-in-1 vehicle builds vary in size).\nSkeleton Organ measures over 3.1” high, 1.2” (3.2cm) long and 1.2” (3.2cm) wide (alternative 3-in-1 vehicle builds vary in size).","review_difficulty":"Average","set":"Goonies™ Level Pack","star_rating":5.0,"theme":"DIMENSIONS™","val_star_rating":5.0,"country":"CA"}