{"ages":"2-5","list_price":23.3922,"num_reviews":2.0,"piece_count":26.0,"play_star_rating":5.0,"prod_short_desc":"Rush to save the burning building in the LEGO® DUPLO® Fire Truck!","prod_id":10592.0,"prod_long_desc":"Jump onto the LEGO® DUPLO® Fire Truck and save the day! Rush to the burning building and help the firefighter winch himself up in the crane. When he’s high enough to tackle the flames, use the retractable hose to put out the fire. Then climb through the window to make sure the building is all clear. Young children will love creating endless rescue adventures with this easy to build set, designed to encourage early construction skills. Use this set to talk to children about fire safety and the important work of firefighters in our communities. DUPLO bricks are made to be fun and safe for smaller hands. Includes a firefighter LEGO DUPLO figure. Combine with the 10591 Fire Boat and 10593 Fire Station for even more fire rescue adventures.\nIncludes a firefighter LEGO® DUPLO® figure\nFeatures a buildable Fire Truck with a hinged rear section with rotating and moving crane and a building with opening window\nAccessories include a retractable hose and a flame\nThe LEGO® DUPLO® Fire Truck will inspire exciting role play opportunities for young children\nUse this set to talk to children about the dangers of fire and the important work of firefighters in our communities\nThe model is easy to build, encouraging early construction skills\nLEGO® DUPLO® products are specially designed to be fun and safe for younger hands\nMakes an ideal addition to any LEGO® DUPLO® Town collection\nCombine with the 10591 Fire Boat and 10593 Fire Station for even more fire rescue adventures\nFire Truck (with crane extended) measures over 9\" high, 10\" long and 2\" wide\nBuilding measures over 5\" high, 2\" wide and 1\" long","review_difficulty":"Very Easy","set":"Fire Truck","star_rating":5.0,"theme":"DUPLO®","val_star_rating":5.0,"country":"CA"}