{"ages":"7-14","list_price":35.598,"num_reviews":4.0,"piece_count":102.0,"play_star_rating":4.8,"prod_short_desc":"Help Finn battle foes through an Adventure Time™ level!","prod_id":71245.0,"prod_long_desc":"Enjoy more LEGO® DIMENSIONS™ gameplay with the Adventure Time™ Level Pack featuring Finn the Human. Simply attach the minifigure to his LEGO Toy Tag and place him on the LEGO Toy Pad to bring him to life in the game. Then use his special abilities to solve puzzles and battle enemies. Add the 3-in-1 Ancient War Elephant and Jakemobile to boost your gameplay, and then rebuild them into the Cosmic Squid and Psychic Submarine or Snail Dude Jake and Hover Jake for upgraded abilities in the game. This set includes a buildable Finn the Human minifigure and his sword, two rebuildable vehicles, a new game level, and an Adventure World with a Battle Arena.\nIncludes buildable Finn the Human minifigure with his sword, and rebuildable Ancient War Elephant and Jakemobile vehicles.\nUnlocks an exclusive Adventure Time™ level of gameplay.\nAll characters and models include a detachable LEGO® Toy Tag.\nRebuild the Ancient War Elephant into the Cosmic Squid and Psychic Submarine.\nRebuild the Jakemobile into Snail Dude Jake and Hover Jake.\nPlace Finn and his vehicles on the LEGO® Toy Pad to join the action in the game.\nActivate Finn's sword to grapple and deflect lasers when solving puzzles and fighting enemies.\nCollect your favorite LEGO® DIMENSIONS™ characters and use them in-game together for a crazy mash-up multiverse.\nVisit LEGO.com\/DIMENSIONS for more information on this exciting LEGO® building and video-gaming experience. Ask your parents' permission.\nLEGO® DIMENSIONS™ Starter Pack and internet connection required.\nLEGO® DIMENSIONS™ expansion packs unlock additional content.\nLEGO® DIMENSIONS™ characters and vehicles are required to interact with the LEGO DIMENSIONS video game.\nThe Ancient War Elephant measures over 1” high, 3” long and 1” wide (alternative 3-in-1 vehicle builds vary in size).\nThe Jakemobile measures over 1” high, 2” long and 1” wide (alternative 3-in-1 vehicle builds vary in size).","review_difficulty":"Very Easy","set":"Adventure Time™ Level Pack","star_rating":4.5,"theme":"DIMENSIONS™","val_star_rating":4.0,"country":"CH"}