{"ages":"9-14","list_price":58.4922,"num_reviews":6.0,"piece_count":564.0,"play_star_rating":4.7,"prod_short_desc":"Don’t get on the wrong side of the Two-Face™ Excavator!","prod_id":70915.0,"prod_long_desc":"Stop the mighty Two-Face™ Excavator with Batman’s Batcycle in this thrilling THE LEGO® BATMAN MOVIE: Two-Face™ Double Demolition set. The Two-Face Excavator has a minifigure cabin, operational excavator arm and bucket, articulated design for smooth steering. It might look like a normal digger from one side, but check out the ‘bad side’ featuring spikes on the huge wheels and a 6-stud rapid shooter. The Batcycle features an opening minifigure cockpit, rotating double stud shooter and rotating flick missile shooter. The set includes 4 minifigures who are equipped with assorted weapons and accessories to inspire endless action-packed role-play scenarios.\nIncludes four minifigures: Batman™, Two-Face™ and two GCPD officers.\nTwo-Face™ Excavator features a ‘good-and-bad-side’ design, minifigure cabin, removable roof and opening weapon storage compartment with a pistol, four huge wheels (two with spikes on the ‘bad’ side), operational excavator arm and bucket, articulated design for smooth steering, six–stud rapid shooter, rotor blade and rear storage compartment.\nBatcycle has two big wheels, an opening minifigure cockpit with translucent-yellow windshield and Batwing doors, rotating double stud shooter and rotating flick missile shooter.\nAlso includes two road barrier elements.\nScoop up minifigures—and even the Batcycle—with the excavator!\nWeapons include Batman’s two Batarangs, Two-Face’s tommy gun and the GCPD officers’ shotgun and pistol.\nAccessory elements include Batman’s cape and molded utility belt and the GCPD officers’ two protective vests, police hat and walkie-talkie.\nTwo-Face™ Excavator measures over 4” high, 11” long and 5” wide.\nBatcycle measures over 1” high, 5” long and 2” wide.\nRoad barriers each measure over 1” high, 1” wide and under 1” long.","review_difficulty":"Average","set":"Two-Face™ Double Demolition","star_rating":4.8,"theme":"THE LEGO® BATMAN MOVIE","val_star_rating":4.8,"country":"CA"}