{"ages":"8+","list_price":77.9922,"num_reviews":14.0,"piece_count":571.0,"play_star_rating":3.6,"prod_short_desc":"Battle the hostile mobs at The Nether Fortress!","prod_id":21122.0,"prod_long_desc":"You’re running low on supplies that the Overworld just can’t offer… light the obsidian portal and step through to reach The Nether Fortress! This forbidding structure is protected by an array of hostile mobs. Help Alex defeat the Blaze that guards the fortress. Take your diamond pickaxe and mine glowstone to light your way, but be careful not to trigger a lava flow! Build an access point to breach the fortress wall, grab your diamond sword and spring a surprise attack on the Zombie Pigman. Take on the red-eyed, fireball-shooting Ghast to obtain the chest containing 2 diamonds and a golden sword, collect mushrooms and Nether wart, and mine Nether quartz ore. It’s all in a day’s work for a LEGO® Minecraft™ hero! Rebuild the set for more LEGO Minecraft creations! Includes 3 minifigures with assorted weapons and accessories: Steve, Alex and a Zombie Pigman, plus a Blaze and a Ghast.\nIncludes 3 minifigures with assorted weapons and accessories: Steve, Alex and a Zombie Pigman, plus a Blaze and a Ghast\nFeatures a Nether portal with light-up effect, 2 brick-built glow-in-the-dark glowstone elements, Ghast with changeable expression and fireball-shooting function, lava flow function, 3 brick-built portable fires, mushroom and Nether wart elements, 2 Nether quartz brick-built ores and a chest with 2 diamond elements\nFortress bridge can be set to 90 or 180 degrees for an alternative build\nWeapon elements include 3 swords and a pickaxe\nSet your imagination free!\nExperience The Nether Fortress!\nLight your way with the glow-in-the-dark glowstone!\nActivate the lava flow!\nShoot fireballs from the Ghast’s mouth!\nBuild your own LEGO Minecraft creations!\nThe perfect gift for fans of LEGO building and Minecraft\nMeasures 7” high, 15” wide and 4” long\nCombine this biome with othersin the series to create your own LEGO Minecraft world","review_difficulty":"Easy","set":"The Nether Fortress","star_rating":3.5,"theme":"Minecraft™","val_star_rating":2.2,"country":"CA"}