{"ages":"16+","list_price":141.78,"num_reviews":53.0,"piece_count":1686.0,"play_star_rating":4.1,"prod_short_desc":"All aboard the London Bus!","prod_id":10258.0,"prod_long_desc":"Celebrate iconic design with this charming double-decker London Bus, featuring a wealth of authentic details, including a bright-red color scheme, panoramic windshield, specially made standard-tread tires, destination sign, and an open rear boarding deck with a hand pole, ticket bin, fire extinguisher and a half-spiral staircase that leads to the upper sightseeing deck. Functions include an opening hood with engine, detailed driver’s cab with a sliding door, and a removable roof and upper deck for access to the detailed interior with worn look seating and additional authentic details, including a forgotten umbrella, newspaper, empty beverage can and discarded chewing gum. Reversible transit advertising posters are also provided as printed labels with a 1950s or present-day London promotion. This LEGO® Creator Expert model has been designed to provide a challenging and rewarding building experience with a touch of nostalgia and charm.\nThe London Bus comes with an array of brick-built features and details, including large windows, bright red curved bodywork, panoramic windshield, reversible transit advertising posters provided as printed labels, specially made standard-tread tires and a destination sign. It also has an opening hood with engine, detailed driver’s cab with sliding door, and a removable roof and upper deck for access to the detailed interior.\nInterior details include worn look seating, open rear boarding deck with a hand pole, ticket bin, fire extinguisher and a half-spiral staircase that leads to the sightseeing deck. Additional authentic detailing includes a forgotten umbrella, newspaper, empty beverage can and discarded chewing gum elements.\nChoose your favorite decade with the miniature, reversible transit advertising posters, featuring a 1950s or present day London promotion.\nRemove the roof and upper deck for full access to the detailed interior.\nSlide open the driver’s door to access the detailed cab with panoramic windscreen.\nLift the hood to access the engine.\nSpecial elements include a new-for-August-2017 tire with standard tread, quarter bows and arches in red, and 1x1x1 A2\/3 bricks with vertical studs.\nThis model includes more than 1,680 pieces.\nThis model is scaled for shelf display alongside other models in the LEGO® Creator Expert vehicle series.\nMeasures over 7” high, 13” long and 5” wide.","review_difficulty":"Average","set":"London Bus","star_rating":4.6,"theme":"Creator Expert","val_star_rating":4.3,"country":"CH"}