{"ages":"7-12","list_price":91.4878,"num_reviews":2.0,"piece_count":603.0,"play_star_rating":5.0,"prod_short_desc":"Jump aboard the luxury Sunshine Catamaran with friends!","prod_id":41317.0,"prod_long_desc":"Take a luxury cruise on the LEGO® Friends Sunshine Catamaran, with a sun deck, pool, bridge, slide, spiral stairs, garage and sliding doors into the living quarters. Lift the top off the boat for easy access to the kitchen, bedrooms and lounge with a clear bottom. Use the personal water scooter to pull the banana boat or inflatable ring, and play with the friendly dolphin all day long. Includes 3 mini-doll figures and 2 dolphin figures.\nIncludes 3 mini-doll figures: Olivia, Stephanie and Liam, plus Sheen and Sapphire the dolphin figures.\nFeatures a 3-level catamaran, personal water scooter and a banana boat.\nCatamaran features a sun deck with 2 sun loungers and a pool, bridge with steering controls and a seating area, slide into and spiral stairs up from the water, opening garage for the personal water scooter, and living quarters with a kitchen, bedrooms and lounge with sofa and transparent-brick floor.\nAccessory elements include an inflatable ring, life preservers, flippers, ice creams, popsicle, baskets, newspaper, smartphone and an mp3 player.\nTake a luxury vacation on the LEGO® Friends Catamaran and enjoy the pool on deck.\nTake the top off the boat to play in the living quarters and see the clear bottom in the lounge.\nHave fun with friends on the banana boat or inflatable ring towed by the personal water scooter.\nMake friends with the dolphins as they swim alongside the catamaran.\nLEGO® Friends Sunshine Catamaran does not float on water.\nCatamaran with sail measures over 12” high, 11” long and 6” wide.\nPersonal water scooter measures over 1” long and 1” wide, and under 1” high.\nBanana boat measures over 3” long and under 1” high and 1” wide.","review_difficulty":"Challenging","set":"Sunshine Catamaran","star_rating":4.5,"theme":"Friends","val_star_rating":5.0,"country":"DE"}