{"ages":"4-7","list_price":57.552,"num_reviews":2.0,"piece_count":191.0,"play_star_rating":5.0,"prod_short_desc":"Roll up for a demolition derby at the Disney•Pixar Thunder Hollow Crazy 8 Race!","prod_id":10744.0,"prod_long_desc":"Throw out the racing rulebook in this action-packed LEGO® Juniors set, featuring an Easy to Build ‘Fritter Time’ road sign with breakable barriers, ramps, flaming tires and assorted demolition derby accessories to set the pulse racing of any Disney•Pixar Cars 3 fan. Includes a simple guide to build and play, and bigger pieces help build confidence in younger kids. LEGO Juniors is an age-appropriate build and play experience for ages 4-7. Includes 4 LEGO Juniors characters.\nIncludes Lightning McQueen and Cruz Ramirez with mud-splash decoration, Broadside and Miss Fritter characters from Disney•Pixar Cars 3.\nFeatures an Easy to Build ‘Miss Fritter’ road sign with movable barriers and 2 buildable floodlights.\nSpeed Miss Fritter through the road sign barrier and chase after Lightning McQueen and Cruz Ramirez!\nRace the cars in a figure 8 pattern and bang them into the oil drums, spare tires and each other.\nIncludes Easy to Build models with bigger pieces and a simple guide to get kids building and playing quickly.\nAccessory elements include Miss Fritter’s rotating stop sign, 3 orange road cones, 3 oil drums, 4 tires, 2 flames and assorted car parts.\nLightning McQueen measures over 2” long, 1” wide and over 1” high.\nCruz Ramirez measures over 1” high, 2” long and 1” wide.\nBroadside measures over 1” high, 2” long and 1” wide.\nMiss Fritter measures over 2” high, 3” long and 2” wide.\nMiss Fritter road sign measures over 2” high, 4” wide and 3” long.\nFloodlights measure over 3” high, 1” wide and under 1” long.","review_difficulty":"Average","set":"Thunder Hollow Crazy 8 Race","star_rating":5.0,"theme":"Juniors","val_star_rating":4.5,"country":"CZ"}