{"ages":"9-14","list_price":134.1878,"num_reviews":15.0,"piece_count":1403.0,"play_star_rating":4.5,"prod_short_desc":"Evade the traps inside the Temple!","prod_id":70617.0,"prod_long_desc":"Join a ninja mission to infiltrate THE LEGO® NINJAGO® MOVIE™ Temple of The Ultimate Ultimate Weapon. The temple features a secret entrance, trapdoor function, rock-dropping and dynamite-dropping functions, blade-shooting and chopping-sword traps, dungeon, a hanging cage to capture a minifigure inside, and a pull-out section with poles for minifigures to leap between to reach the treasure chest. This set includes 7 minifigures with assorted weapons and 2 buildable temple guardian figures for endless action role-play fun.\nIncludes 7 minifigures: Kai, Nya, Cole, Zane, Lloyd, Jay and Jungle Garmadon (with 4 arms and new-for-August-2017 jungle outfit decoration) and 2 buildable temple guardian figures.\nFeatures large main entrance doors, trapdoor, rock-dropping and dynamite-dropping functions, dungeon with secret entrance\/escape route, library with a scroll and hidden blade-shooter (shoots discs with blade decoration), room with gold-colored sword and chopping-sword trap, storage room with a sword and buildablevase, 2 attic rooms, a hanging cage that fits a minifigure inside, beacon with translucent-blue flame-style element, pull-out section with poles for minifigures to leap between to get to the treasure chest, statue, plus assorted elements including a skeleton, spider and 2 snakes.\nRelease the rock to knock over a minifigure and then turn the dial to pull up the chain ready to drop it again!\nPress the lever to open the dungeon's secret entrance\/escape route.\nActivate the hidden blade shooter under the scroll to topple a minifigure.\nTurn the dial to bring down the chopping sword and knock over a minifigure.\nWeapons include Kai’s 2 katanas, Nya’s tasseled spear, Cole’s hammer, Zane’s bow and arrow, Lloyd’s Chinese tasseled sword, Jay's chain with spike and Jungle Garmadon's 4 swords.\nAccessory elements include Kai's sword holster and Zane's quiver.\nRecreate and role-play exciting THE LEGO® NINJAGO® MOVIE™ scenes.\nTemple of The Ultimate Ultimate Weapon measures over19” high, 14” wide and 11” long.\nTemple guardians each stand over 3” tall.","review_difficulty":"Average","set":"Temple of The Ultimate Ultimate Weapon","star_rating":4.8,"theme":"THE LEGO® NINJAGO® MOVIE™","val_star_rating":4.8,"country":"DE"}