{"ages":"6-12","list_price":107.88,"num_reviews":10.0,"piece_count":894.0,"play_star_rating":4.2,"prod_short_desc":"Throw the crooks back in jail after they break out!","prod_id":60141.0,"prod_long_desc":"Be part of the action with the LEGO® City police as they try to keep the crooks in jail, featuring a three-level Police Station loaded with accessory elements, a jail cell with exploding wall function, watchtower, garage and offices, helicopter, police pursuit car and police motorbike, plus the crooks’ truck with rotating, extendable cherry picker. Includes seven minifigures plus a police dog figure.\nIncludes seven minifigures: four police officers and three crooks, plus a police dog figure.\nFeatures a three-section Police Station, police helicopter, police pursuit car, police motorbike and crooks’ truck.\nPolice Station features three levels, including two jail cells with toilets, vent with opening grill and exploding wall function, rooftop helipad, satellite dish and antenna, searchlights, ramp, garage with tools and opening door, watchtower, overhead walkway, three offices and a barrier gate.\nHelicopter features spinning rotors and an opening cockpit.\nCrooks’ truck features a rotating, extendable cherry picker.\nExtend the cherry picker to put the dynamite in the vent.\nBlow the wall off the cell with the dynamite to free the crook.\nRaise the garage door, push the lever and launch the police pursuit car.\nAccessory elements include three sets of handcuffs, two walkie-talkies, megaphone, four mugs, camera, lollypop stop sign, crowbar, wrench and two dynamite sticks.\nThis set offers an age-appropriate build and play experience for ages 6-12.\nPolice Station measures over 9” high, 14” wide and 14” long.\nHelicopter measures over 3” high, 7” long and 1” wide.\nPolice pursuit car measures over 1” high, 4” long and 1” wide.\nPolice motorbike measures over 1” high, 2” long and under 1” wide.\nCrooks’ truck measures over 2” high, 4” long and 1” wide.","review_difficulty":"Easy","set":"Police Station","star_rating":4.7,"theme":"City","val_star_rating":4.0,"country":"DN"}