{"ages":"8-14","list_price":53.88,"num_reviews":6.0,"piece_count":366.0,"play_star_rating":3.7,"prod_short_desc":"Protect Gotham City from Bane’s toxic attacks!","prod_id":70914.0,"prod_long_desc":"Stop Bane™ and Mutant Leader’s toxic attacks with Batman™ in this exciting THE LEGO® BATMAN MOVIE: Bane™ Toxic Truck Attack set, including Bane’s Toxic Truck, Batman’s Whirly-Bat flyer and a toxic waste mini-build with explode function. The 6-wheel truck features rear 4-wheel suspension and a mounted 6-stud rapid shooter and detachable toxic tank element. Includes 2 minifigures, a big figure and assorted play-inspiring weapons and accessory elements including Batman’s Batarang, Mutant Leader’s torch and Bane’s Venom backpack.\nIncludes two minifigures: Batman™ and Mutant Leader™, plus a Bane™ big figure.\nBane’s 6x6 Toxic Truck features a minifigure cockpit, space for Bane™, six big wheels with rear-four-wheel suspension, mounted adjustable six-stud rapid shooter with target-sighting element, and a detachable translucent-green toxic tank element.\nBatman’s Whirly-Bat features a minifigure seat, rotating rotor, two adjustable Batwings and two wheels.\nAlso includes a toxic waste mini-build with a silo, three toxic bomb elements and explode function.\nThe Bane™ big figure features posable arms and legs, and has a Venom backpack.\nWeapons include Batman’s Batarang and Mutant Leader’s torch.\nAccessory elements include Batman’s cape and molded utility belt.\nBane™ stands over 2” tall.\nToxic Truck measures over 4” high, 6” long and 3” wide.\nWhirly-Bat measures over 3” high, 2” long and 1” wide.\nToxic waste mini-build measures over 2” high, 1” wide and 1” long.","review_difficulty":"Average","set":"Bane™ Toxic Truck Attack","star_rating":4.0,"theme":"THE LEGO® BATMAN MOVIE","val_star_rating":3.0,"country":"DN"}