{"ages":"2-5","list_price":47.88,"num_reviews":null,"piece_count":61.0,"play_star_rating":null,"prod_short_desc":"Turn the carousel for a day of fun at the fair!","prod_id":10841.0,"prod_long_desc":"Help your toddler build the iconic fairground carousel and play out a day of family fun. Young children will love using the special gearwheel function or spinning the top of the carousel to watch the 4 horses go round and round. Have fun practicing role-play and storytelling as they push the LEGO® DUPLO® figures down the slides or buy a ticket at the stand. Includes 4 DUPLO figures.\nIncludes 4 LEGO® DUPLO® figures: mom, dad and 2 children.\nFeatures a rotating carousel with 4 horse figures and gearwheel function, stand with 2 wavy slides, ticket stand with opening window and a drinks machine with table and chairs.\nIncludes bricks decorated as a height chart, gumball machine, ice creams and a funfair entrance sign as story starters.\nAccessory elements include a camera and a cup.\nHelp your child use the special gearwheels or turn the top of the carousel to watchthe 4 horse figures go round.\nHave fun racing the LEGO® DUPLO® figures down the wavy slides.\nPractice everyday scenarios, such as buying a ticket or getting a drink from the machine, in a fun a colorful setting.\nUse the modern characters, accessories and decorated bricks to play out family fun in a fun fair environment.\nLEGO® DUPLO® products are specially designed to be safe and suitable for small hands.\nThis set offers an age-appropriate build and play experience for ages 2-5.\nCarousel measures over 9” high, 8” wide and 7” long.\nStand with slides measures over 5” high, 3” wide and 7” long.\nTicket stand measures over 5” high, 2” wide and 1” long.\nCombine with the 10839 Shooting Gallery to extend the fair environment.\nThere are several My Town products to collect and play out family fun in a recognizable LEGO® DUPLO® world.","review_difficulty":null,"set":"Fun Family Fair","star_rating":null,"theme":"DUPLO®","val_star_rating":null,"country":"DN"}