{"ages":"8-14","list_price":107.88,"num_reviews":2.0,"piece_count":841.0,"play_star_rating":5.0,"prod_short_desc":"Build, display and race iconic Ferrari race cars!","prod_id":75889.0,"prod_long_desc":"Create the Ferrari Ultimate Garage with a workshop\/museum, attachable racetrack section and LEGO® Speed Champions versions of the classic Ferrari 250 GTO, 488 GTE and historic 312 T4 cars. Build the cars in the workshop, featuring an adjustable car ramp, vintage-style fuel pump and a tool rack, display a car in the museum, and race around the curbs and under the arch on the racetrack section. This construction toy includes 7 minifigures for endless role-play options.\nIncludes 7 minifigures: a classic Ferrari 250 GTO racing driver, Ferrari 488 GTE racing driver, historic Ferrari 312 T4 racing driver, race marshal, race mechanic and 2 visitors.\nFeatures 3 iconic Ferrari racing cars, a workshop\/museum and an attachable racetrack section.\nThe race-ready and buildable classic Ferrari 250 GTO, 488 GTE and historic 312 T4 cars each feature a minifigure cockpit, wheels with rubber tires, authentic design details, racing colors and race-graphics stickers.\nRemove the windshields on the Ferrari 250 GTO and 488 GTE to place a minifigure in each car.\nThe Ferrari 312 T4 comes with an extra interchangeable wing, like the one used to change the downforce on the 1979 world-championship-winning car.\nWorkshop features an adjustable car ramp, tool rack with assorted tool elements, vintage-style fuel pump, storage cabinet, track exit, decorative arch with Ferrari logo and green-white-and-red Italian flag stickers, plus wall poster stickers.\nMuseum features a ‘roped-off’ display area for a car, trophy cabinet with a trophy element and 3 model car elements.\nRacetrack section features buildable Italian-flag-style green-white-and-red curbs, and an arch with Ferrari logo and checkered stickers.\nAccessory elements include the 3 racing drivers' helmets, race marshal's checkered flag and the visitor's camera.\nThis construction toy is suitable for ages 8-14.\nWorkshop\/museum measures over 3” high, 8” wide and 7” long, and 19” wide when opened out.\nRacetrack measures over 5” high, 11” wide and 19” long.\nFerrari 250 GTO measures over 1” high, 6” long and 2” wide.\nFerrari 488 GTE measures over 1” high, 6” long and 2” wide.\nFerrari 312 T4 measures over 1” high, 6” long and 2” wide.","review_difficulty":"Average","set":"Ferrari Ultimate Garage","star_rating":5.0,"theme":"Speed Champions","val_star_rating":4.5,"country":"DN"}