{"ages":"7-14","list_price":30.4878,"num_reviews":null,"piece_count":93.0,"play_star_rating":null,"prod_short_desc":"Sugar, spice and everything nice! Bring Townsville to life in the LEGO® DIMENSIONS™ multiverse with Blossom™ and Bubbles™!","prod_id":71346.0,"prod_long_desc":"Fight crime and battle the forces of evil in the LEGO® DIMENSIONS™ multiverse with Blossom™ and Bubbles™ from The Powerpuff Girls™! Simply attach the minifigures to their LEGO Toy Tags and place them on the LEGO Toy Pad to bring them to life in the game. Then use their special abilities to solve puzzles and battle enemies. Add the iconic PPG Smartphone and Octi to boost your gameplay, and then rebuild them into the Super Skunk or Sonic Squid and PPG Hotline and Powerpuff Mag-Net for upgraded abilities in the game. This set includes buildable Blossom and Bubbles minifigures, two 3-in-1 rebuildable vehicles, and an Adventure World with a Battle Arena.\nIncludes buildable Blossom and Bubbles minifigures, and rebuildable PPG Smartphone and Octi.\nAll characters and models include a detachable LEGO® Toy Tag.\nRebuild the PPG Smartphone into the PPG Hotline and Powerpuff Mag-Net.\nRebuild Octi into the Super Skunk or Sonic Squid.\nPlace each character and their vehicle on the LEGO® Toy Pad and join the action in the game.\nUse ultra-super powers like Blossom's Heat Vision and Bubble's Rainbow Beam to fight crime and battle the forces of evil.\nUnlocks The Powerpuff Girls™ Adventure World and Battle Arena.\nCollect your favorite LEGO® DIMENSIONS™ characters and use them in-game together for a crazy mash-up multiverse.\nVisit LEGO.com\/DIMENSIONS for more information on this exciting LEGO® building and video-gaming experience. Ask for your parents' permission before going online.\nLEGO® DIMENSIONS™ Starter Pack and internet connection required.\nLEGO® DIMENSIONS™ expansion packs unlock additional content.\nLEGO® DIMENSIONS™ characters and vehicles are required to interact with the LEGO DIMENSIONS video game.\nThe PPG Smartphone measures over 2” high, 1” long and 1” wide (alternative 3-in-1 vehicle builds vary in size).\nOcti measures over 1” high, 1” long and 1” wide (alternative 3-in-1 vehicle builds vary in size).","review_difficulty":null,"set":"The Powerpuff Girls™ Team Pack","star_rating":null,"theme":"DIMENSIONS™","val_star_rating":null,"country":"FR"}