{"ages":"5+","list_price":4.819,"num_reviews":15.0,"piece_count":7.0,"play_star_rating":4.8,"prod_short_desc":"Get the party started with LEGO® Minifigures!","prod_id":71021.0,"prod_long_desc":"Bring exciting new play possibilities to existing LEGO® sets with the celebratory LEGO Minifigures Party series. This festive series of fun collectibles comes with an array of new-for-April-2018 accessories and costumes, and features a host of brightly dressed characters, all ready to party. The Party series lineup includes the Dragon Suit Guy, Firework Guy, Elephant Costume Girl, LEGO Brick Suit Guy, LEGO Brick Suit Girl, Cactus Girl, Party Clown, Cake Guy, Unicorn Guy, Flowerpot Girl, Birthday Party Girl, Birthday Party Boy, Spider Suit Boy, Cowboy Costume Guy, Race Car Guy, Cat Costume Girl and, last but not least, a rare replica of one of the first minifigures ever produced—the 1978 Police Officer. Each minifigure comes in a sealed ‘mystery' bag, together with one or more accessory elements, plus a collector's leaflet and a unique display baseplate.\nEvery minifigure in this series comes with one or more accessory elements, plus a collector’s leaflet and a unique display baseplate.\nThe LEGO® Minifigures Party series features an array of exciting new-for-April-2018 costumes and accessories, including a LEGO brick costume torso that functions like a real brick, ‘gift box' element, spider hat and back piece, dragon head and dragon tail, flower hat, flowerpot hip piece, firework costume, cactus costume with new cactus arms, race car hip piece, handheld balloon animal, cat mask, elephant mask, updated boy and girl wigs, updated retro male wig that works with a party hat, balloon on a string element, balloon dog, tiny mouse with soft tail, and a cake that a minifigure can jump out of!\nGet ready to host the biggest LEGO minifigure party in town!\nCombine with LEGO® building sets for endless play possibilities.\nHave fun trading minifigures with your friends to complete your collection.\nThese fun collectibles are suitable for ages 5+.\nPLEASE NOTE: Each ‘mystery’ bag contains one of the 17 characters available in this collection. Unfortunately, we cannot accommodate requests for specific minifigures. If you purchase more than one ‘mystery’ bag, you may receive two or more identical minifigures.","review_difficulty":"Very Easy","set":"Series 18: Party","star_rating":4.5,"theme":"Minifigures","val_star_rating":4.4,"country":"FI"}