{"ages":"9-14","list_price":79.2878,"num_reviews":23.0,"piece_count":792.0,"play_star_rating":4.7,"prod_short_desc":"Head for sunnier climes with the Vacation Getaways set!","prod_id":31052.0,"prod_long_desc":"Explore exciting destinations with this awesome camper, complete with trailer, motorboat and an array of brick-built features and accessories. Remove the roof, windshield or rear section to access its detailed interior, complete with toilet, fold up bed, kitchen, sofa and a TV. The set also includes a foldaway barbecue, table and chairs, which can be transported on the camper's roof. This versatile 3-in-1 LEGO® Creator model can be rebuilt to create a summer home or a yacht. Includes 2 minifigures, plus a buildable bear.\nIncludes 2 minifigures, plus a brick-built bear.\nFeatures a camper, trailer with a motorboat and 2 trees with grass and flowers.\nCamper features a white color scheme with dark-blue and red stripes, yellow striped foldout awning, and a detailed interior including a toilet, fold up bed, kitchen, sofa, TV and luggage, plus roof storage for a foldaway barbecue and table, and 2 foldaway chairs.\nFold up the bed to access the storage area.\nTrailer features a removable boat with outboard motor.\nRemove the camper roof, windshield or rear section to access the detailed interior.\nAttach the trailer to the camper and head for the open road.\nFold out the table, chairs and barbecue and prepare a delicious meal in the country air.\nAccessory elements include sandwiches, fish, chicken leg, life preserver, map and suitcases.\nThis set offers an age-appropriate building experience for ages 8-12.\nThis set includes over 750 LEGO® pieces.\n3-in-1 model: rebuilds into a summer home or a yacht.\nCamper with trailer measures over 3” high, 14” long and 3” wide.\nSummer home measures over 6” high, 6” wide and 4” long.\nYacht measures over 5” high, 9” long and 3” wide.","review_difficulty":"Average","set":"Vacation Getaways","star_rating":4.9,"theme":"Creator 3-in-1","val_star_rating":4.3,"country":"IE"}