{"ages":"7-14","list_price":41.986,"num_reviews":6.0,"piece_count":76.0,"play_star_rating":4.2,"prod_short_desc":"Hang by a thread with Ethan on a Mission: Impossible™ level!","prod_id":71248.0,"prod_long_desc":"Secret agent Ethan Hunt is being framed for the theft of highly classified materials from IMF and needs your help to find the true villain! Infiltrate your way through the American Embassy, CIA Headquarters and more in this thrilling game level. Build Ethan and use his Camera Spectacles for the perfect disguise, and wear the Magno Gloves to sneak your way up walls. When you need a quick escape, hop onto the IMF Scrambler or IMF Sport Car, and then rebuild the vehicles into the ShockCycle and IMF Covert Jet, and the IMF Tank and The IMF-Splorer to access a host of new super-spy abilities. Unlock the exclusive Mission: Impossible™ Adventure World and Battle Arena.\nIncludes buildable Ethan Hunt minifigure with his Infrared Binoculars and rebuildable 3-in-1 IMF Sport Car and IMF Scrambler.\nUnlocks the exclusive Mission: Impossible™ level of gameplay and Adventure World with a Battle Arena.\nAll characters and models include a detachable LEGO® Toy Tag.\nRebuild the IMF Sport Car into the IMF Tank and The IMF-Splorer.\nRebuild the IMF Scrambler into the ShockCycle and IMF Covert Jet.\nPlace Ethan and his vehicle on the LEGO® Toy Pad and join the action in the game.\nUse Ethan’s Camera Spectacles for the perfect disguise and wear the Magno Gloves to sneak your way up walls.\nCollect your favorite LEGO® DIMENSIONS™ characters and use them in-game together for a crazy mash-up multiverse.\nVisit LEGO.com\/DIMENSIONS for more information on this exciting LEGO® building and video-gaming experience. Ask your parents' permission.\nLEGO® DIMENSIONS™ Starter Pack and internet connection required.\nLEGO® DIMENSIONS™ expansion packs unlock additional content.\nLEGO® DIMENSIONS™ characters and vehicles are required to interact with the LEGO DIMENSIONS video game.\nThe IMF Sport Car measures over 1” high, 2” long and 1” wide (alternative 3-in-1 vehicle builds vary in size).\nThe IMF Scrambler measures over 2” high, 1” long and 1” wide (alternative 3-in-1 vehicle builds vary in size).","review_difficulty":"Easy","set":"Mission: Impossible™ Level Pack","star_rating":4.5,"theme":"DIMENSIONS™","val_star_rating":3.4,"country":"GB"}