{"ages":"7-14","list_price":41.986,"num_reviews":3.0,"piece_count":96.0,"play_star_rating":5.0,"prod_short_desc":"Explore the Land of Ooo with Jake and Lumpy Space Princess!","prod_id":71246.0,"prod_long_desc":"Enhance your LEGO® DIMENSIONS™ experience with the Adventure Time™ Team Pack, featuring Jake the Dog and Lumpy Space Princess. Simply attach the minifigures to their LEGO Toy Tags and place them on the LEGO Toy Pad to bring them to life in the game. Then use their special abilities to solve puzzles and battle enemies. Add the 3-in-1 Lumpy Car and BMO to boost your gameplay, and then rebuild them into the Lumpy Truck and Lumpy Land Whale or DOGMO and SNAKEMO for upgraded abilities in the game. This set includes buildable Jake the Dog and his torch, and Lumpy Space Princess and her mobile phone, two 3-in-1 vehicles, and an Adventure World with a Battle Arena.\nIncludes buildable Jake the Dog and Lumpy Space Princess minifigures, and rebuildable Lumpy Car and BMO.\nAll characters and models include a detachable LEGO® Toy Tag.\nRebuild the Lumpy Car into the Lumpy Truck and Lumpy Land Whale.\nRebuild BMO into DOGMO and SNAKEMO.\nPlace each character and their vehicle on the LEGO® Toy Pad and join the action in the game.\nActivate their abilities like Slurp Access, Grapple Swing and Shape Shift to solve puzzles and fight off enemies.\nUnlocks the Adventure Time™ Adventure World and Battle Arena\nCollect your favorite LEGO® DIMENSIONS™ characters and use them in-game together for a crazy mash-up multiverse.\nVisit LEGO.com\/DIMENSIONS for more information on this exciting LEGO® building and video-gaming experience. Ask your parents' permission.\nLEGO® DIMENSIONS™ Starter Pack and internet connection required.\nLEGO® DIMENSIONS™ expansion packs unlock additional content.\nLEGO® DIMENSIONS™ characters and vehicles are required to interact with the LEGO DIMENSIONS video game.\nThe Lumpy Car measures over 1” high, 1” long and 1” wide (alternative 3-in-1 vehicle builds vary in size).\nBMO measures over 2” high, 1” long and 2” wide (alternative 3-in-1 vehicle builds vary in size).","review_difficulty":"Easy","set":"Adventure Time™ Team Pack","star_rating":4.7,"theme":"DIMENSIONS™","val_star_rating":4.0,"country":"GB"}