{"ages":"7-14","list_price":36.5878,"num_reviews":7.0,"piece_count":115.0,"play_star_rating":4.4,"prod_short_desc":"Fight ghosts with the LEGO® DIMENSIONS™ The Ghostbusters™ Level Pack!","prod_id":71228.0,"prod_long_desc":"Spookify your LEGO® DIMENSIONS™ experience with The Ghostbusters™ Level Pack. Build misfit parapsychologist Peter Venkman, attach him to the LEGO® Toy Tag, place him on the LEGO® Toy Pad to bring him to life in the game, and then help him fight Gozer and save New York City with the rest of The Ghostbusters! Use his Laser Deflector, Suspend Ghosts and Hazard Protection abilities to solve puzzles and battle enemies, and boost your gameplay with rebuildable 3-in-1 Ecto-1 or Ghost Trap. This set includes a buildable Peter Venkman minifigure and his proton pack.\nIncludes a buildable Peter Venkman minifigure and his proton pack.\nAlso includes rebuildable 3-in-1 Ecto-1 or Ghost Trap models.\nUnlocks exclusive The Ghostbusters™ “A Spook Central Adventure!” level.\nAll characters and models include a detachable LEGO® Toy Tag.\nRebuild the Ecto-1 into the Ecto-1 Blaster and Ecto-1 Water Diver.\nRebuild the Ghost Trap into a Ghost Stun ‘n Trap and Proton Zapper.\nPlace each character and model on the LEGO® Toy Pad and join the action in the game.\nActivate Peter Venkman’s Laser Deflector, Suspend Ghosts and Hazard Protection abilities to solve puzzles and overpower enemies.\nCollect your favorite LEGO® DIMENSIONS™ characters and use them in-game together for a crazy mash-up multiverse.\nVisit LEGO.com\/DIMENSIONS for more information on this exciting LEGO® building and video-gaming experience. Ask your parents' or guardians' permission before going online.\nLEGO® DIMENSIONS™ Starter Pack and internet connection required.\nLEGO® DIMENSIONS™ expansion packs unlock additional content.\nLEGO® DIMENSIONS™ characters and vehicles are required to interact with the LEGO DIMENSIONS™ video game.\nEcto-1 stands over 1” high, 1” long and 1” wide (alternative 3-in-1 vehicle builds vary in size).\nGhost Trap measures over 1” high, 1” wide and 1” long (alternative 3-in-1 builds vary in size).","review_difficulty":"Easy","set":"The Ghostbusters™ Level Pack","star_rating":4.7,"theme":"DIMENSIONS™","val_star_rating":4.3,"country":"IE"}