{"ages":"7-14","list_price":64.6478,"num_reviews":5.0,"piece_count":425.0,"play_star_rating":3.2,"prod_short_desc":"Dodge Harley Quinn’s cannonball attacks!","prod_id":70921.0,"prod_long_desc":"Stage a face-off between Batgirl™ and Harley Quinn™ with THE LEGO® BATMAN MOVIE: Harley Quinn Cannonball Attack set, featuring a truck and 2 mini builds of Gotham City buildings. Harley Quinn’s truck features an elevating and rotating Harley Quinn minifigure-shooting cannon, opening doors, and an opening hood. The 2 mini builds are packed with play-starting features such as an ATM, dynamite element and a hinged ladder. This LEGO Batman™ toy includes 4 minifigures and a rat figure.\nIncludes 4 minifigures: Batgirl™, Harley Quinn™, Gentleman Ghost™ and Crazy Quilt™, plus a rat figure.\nHarley Quinn’s truck features an elevating and rotating Harley Quinn™ minifigure-shooting cannon with a translucent flame-style element, minifigure driver's cabin with opening doors and lift-off roof for easy access, and an opening hood with engine elements underneath.\nLarge mini build features 2 levels, a hinged ladder, wall-mounted lamp with translucent-yellow light-style element, window, 2 ‘Wanted’ poster and 1 ‘Gotham Circus’ poster stickers, an opening door, and a balcony with railings on the upper level.\nSmall mini build features an ATM, adjustable security camera element, lamppost, trash can, opening door and a dynamite element clipped inside the building.\nFire the truck's cannon to blast Harley Quinn™ through a door, knock over minifigures or topple the lamppost.\nWeapons include Batgirl's Batarang and Gentleman Ghost's cane.\nAlso includes the Phantom Zone Remote element.\nConnect Harley Quinn’s 6-stud rapid-shooting cannon from 70916 The Batwing set to add even more firepower to the truck.\nThis LEGO® Batman™ toy is suitable for ages 7-14.\nHarley Quinn’s truck measures over 4” high, 7” long and 3” wide.\nLarge mini build measures over 5” high, 2” wide and 1” long.\nSmall mini build measures over 4” high, 2” wide and 1” long.","review_difficulty":"Average","set":"Harley Quinn™ Cannonball Attack","star_rating":3.2,"theme":"THE LEGO® BATMAN MOVIE","val_star_rating":2.6,"country":"IE"}