{"ages":"12+","list_price":37.9924,"num_reviews":53.0,"piece_count":321.0,"play_star_rating":3.2,"prod_short_desc":"Build your own LEGO® interpretation of the iconic Eiffel Tower!","prod_id":21019.0,"prod_long_desc":"Presenting the LEGO® Architecture interpretation of one of the most iconic landmarks ever constructed – The Eiffel Tower! Designed and built by French entrepreneur, Gustave Eiffel, the original 324-meter-tall masterpiece of wrought iron engineering formed the grand entrance to the 1889 World’s Fair, held in Paris to celebrate the 100th anniversary of the French Revolution. During construction, the 18,038 wrought iron elements making up the tower’s lattice structure were bolted together at Eiffel’s factory on the outskirts of Paris, before being transported to the site, hoisted into place by steam-powered cranes operating from the elevator shafts, and assembled using no less than 2.5 million individual rivets. The resulting structure was extremely rigid and over the years has withstood storms, floods and everything else mother nature has thrown at it. Today, The Eiffel Tower is one of the world’s most popular landmarks, attracting millions of curious visitors from around the world each year. With this exceptional model, you can now build your very own 321-piece Eiffel Tower in LEGO brick form and display it in your home, office or wherever you like!\nInterpretation of real-world architectural landmark The Eiffel Tower in LEGO® bricks \nBooklet included with details on design, architecture and history of the tower (English and French languages only. Other languages available for download at LEGO.com\/architecture) \nMeasures over 12” high, 4” wide and 4” long \nCollect the entire Landmark and Architecture series sets \nThe LEGO® Architecture product line is about celebrating the world of architecture through the medium of the LEGO brick and for all with an interest in design, architecture and history","review_difficulty":"Average","set":"The Eiffel Tower","star_rating":4.6,"theme":"Architecture","val_star_rating":4.4,"country":"AU"}