{"ages":"16+","list_price":220.87,"num_reviews":202.0,"piece_count":2469.0,"play_star_rating":4.7,"prod_short_desc":"Have an unforgettable evening at the amazing Parisian Restaurant!","prod_id":10243.0,"prod_long_desc":"It’s very busy in the Parisian Restaurant! As a scooter zips by, inside the waiter rushes between the tables as the nervous young man gets ready to propose with the ring! It’s just as hectic behind the scenes, with the chef busily preparing the food. This beautifully detailed building is the setting for so many stories and is a great addition to the modular building series. The Parisian Restaurant has a fully-stocked, blue and white tiled kitchen with tableware as well as a cozy apartment with pull-down bed, kitchenette and fireplace. On the top floor is the artist’s room with a studio that includes a cast iron heater, easel, paintbrush and two works of art by the aspiring artist. Outside, stairs lead down to the roof terrace lined with hanging lanterns and flowers where the diners eat alfresco-style. This amazing Parisian Restaurant model even includes a facade with croissants, clams and feather details that recapture the feel of Paris. Includes 5 minifigures: chef, waiter, girl and a romantic couple.\nIncludes 5 minifigures: chef, waiter, girl and a romantic couple\nAlso includes a rat and 2 clams\nKitchen features blue and white tiled floor, lots of kitchen units and a variety of utensils\nSecond-floor apartment features a pull-down bed, kitchenette and fireplace\nTop floor features an opening roof revealing an artist’s studio with heater, easel, paintbrush, palette and artwork\nIncludes lots of food items for the customers including croissants, a pie, 2 cupcakes, 2 grapes, 2 hotdogs, turkey, cheese wedges, milk carton and colored bottles\nAlso includes hard-to-find white croissants and bricks in olive green, dark blue and dark red\nIntricate exterior details include facade with croissant detailing, bus stop, sidewalk, scooter and even a dumpster and trash can at the back\nPut up the printed restaurant sign and menu to entice the customers in\nCollect and build an entire town with the LEGO® Modular Buildings collection: 10224 Town Hall and 10232 Palace Cinema!\nMeasures over 11” high, 9” long and 9” wide","review_difficulty":"Challenging","set":"Parisian Restaurant","star_rating":4.9,"theme":"Creator Expert","val_star_rating":4.7,"country":"NO"}