{"ages":"16+","list_price":227.9924,"num_reviews":53.0,"piece_count":2670.0,"play_star_rating":4.2,"prod_short_desc":"Discover the fairground’s star attraction with the Carousel!","prod_id":10257.0,"prod_long_desc":"Experience the majestic Carousel with a wealth of delightful features, including a large textile canopy, ornate reflective rounding boards with blue and gold detailing, reflective center panels, and a 2-tier deck comprising a raised boarding platform with handrail and a main platform with 5 buildable animal rides, including a white swan and 4 moving animals. Turn the crank and see the elephant, tiger, flamingo and frog move up and down as the carousel rotates. This delightful LEGO® Creator Expert model has an iconic elegance that evokes feelings of nostalgia, romance and adventure. Upgrade with LEGO Power Functions for fully motorized operation. Includes 7 minifigures.\nIncludes 7 minifigures: a ride operator, mom, dad, boy, girl, grandmother and a granddaughter.\nThe Carousel features a large textile canopy, ornate, reflective rounding boards with blue and gold detailing, reflective center panels, 2-level deck comprising a raised boarding platform with handrail and a main platform with 5 buildable animal rides, including a white swan and 4 moving animals: an elephant, tiger, flamingo and a frog.\nAlso features a sturdy, buildable base for easy transportation.\nBuy your ticket at the booth, take the stairs to the boarding platform and choose your favorite animal ride.\nTurn the crank and see the elephant, tiger, flamingo and frog move up and down as the carousel rotates.\nEnjoy an ice cream, candy or a delicious hot dog as you watch the whirling carousel.\nAccessory elements include a camera, ice cream, candy and a hot dog in a bun.\nThis set includes more than 2,660 pieces.\nNew-for-June-2017 decorated elements include printed tickets and printed storybook tiles.\nIncludes lots of molded golden elements, reflective golden labels and medium-blue\/dark-blue elements.\nMotorize the Carousel with the LEGO® Power Functions 8883 medium motor and 88000 AAA battery box (not included).\nCollect and build an entire fairground with the LEGO® Creator Expert 10247 Ferris Wheel.\nMeasures over 12” high, 14” wide and 13” long.","review_difficulty":"Challenging","set":"Carousel","star_rating":4.4,"theme":"Creator Expert","val_star_rating":4.2,"country":"AU"}