{"ages":"1½-3","list_price":24.3878,"num_reviews":null,"piece_count":28.0,"play_star_rating":null,"prod_short_desc":"Explore different emotions with these buildable characters.","prod_id":10861.0,"prod_long_desc":"Help your toddler learn to recognize and understand different emotions, using these bright, buildable characters made from chunky LEGO® DUPLO® bricks that are specially designed to be fun and safe for small hands. Turn the double-sided face bricks to explore different facial expressions, and use the double-sided story bricks to create your own tales around moods and feelings. There are hours of fun to be had together with these big bricks, developing language skills along the way.\nFeatures 4 buildable characters with double-sided face bricks and decorated body bricks portraying a range of emotions.\nAlso features double-sided story bricks as play starters, including an ice cream\/dropped ice cream, inflated\/burst football, happy\/injured teddy and a day\/night scene.\nHave fun together as your child learns how to recognize different and opposite emotions.\nCreate funny stories about feelings using the double-sided story bricks to help you.\nToddlers will love taking care of the characters who are feeling sad or tired, and turning the face brick around to show them feeling better.\nHelp your child master basic building skills with these simple puzzles made with big bricks.\nMakes an ideal gift for preschool children.\nLEGO® DUPLO® products are specially designed to be fun and easy for small hands.\nSuitable for ages 1½-3.\nBlue character measures over 6” high, 3” wide and 2” long.\nRed character measures over 5” high, 3” wide and 1” long.\nGreen character measures over 5” high, 3” wide and 1” long.\nWhite character measures over 3” high, 2” wide and 1” long.","review_difficulty":null,"set":"My First Emotions","star_rating":null,"theme":"DUPLO®","val_star_rating":null,"country":"LU"}