{"ages":"2-5","list_price":155.87,"num_reviews":8.0,"piece_count":163.0,"play_star_rating":4.9,"prod_short_desc":"Go Around the World on LEGO® DUPLO® adventures!","prod_id":10805.0,"prod_long_desc":"This special LEGO® DUPLO® Around the World set puts a world of animals at your fingertips! Little explorers can travel from place to place by boat or plane to learn about different animals and their natural habitats. With 5 LEGO® DUPLO® figures plus 17 animals from all around the world, including a whale with opening mouth function!\nIncludes 5 LEGO® DUPLO® figures plus 17 animals from all around the world!\nFeatures a buildable temple, savanna scene, forest scene, Antarctic scene and a buildable plane and boat.\nBuildable temple features a tiger, tiger cub and a panda, plus bricks decorated as bamboo.\nSavanna scene features a buildable cave with savanna tree, 2 lions with lion cub, 2 zebras and a hippo.\nForest scene features a buildable house with opening door and table, a tree with greenery and a hanging bridge, plus a bear, squirrel and 2 ducks.\nAntarctic scene features 'ice block' bricks, a fish, 2 penguins and a whale with opening mouth and water spout element, plus a slide, video camera element and a brick decorated as shrimp.\nWith 4 different habitats in this special set, children can focus on individual builds or combine them all for a customizable play experience.\nYoung adventurers will love bridging the world with the buildable plane and boat.\nLEGO® DUPLO® Around the World sets encourage early role play with lots of animal fun.\nUse LEGO® DUPLO® Wildlife sets to talk to your child about wild animals, their habitats, conservation, different places in the world and the people and animals who live there—there's so much to learn!\nLEGO® DUPLO® products are safe and specially designed to be fun and easy for little hands.\nTemple measures over 8” high, 7” wide and 3” long.\nSavanna scene measures over 8” high, 7” wide and 3” long.\nForest house measures over 6” high, 5” wide and 2” long.\nPlane measures over 4” high, 7” long and 7” wide.\nBoat measures over 5” high, 7” long and 4” wide.","review_difficulty":"Easy","set":"Around the World","star_rating":5.0,"theme":"DUPLO®","val_star_rating":4.8,"country":"NO"}