{"ages":"2-5","list_price":116.87,"num_reviews":1.0,"piece_count":106.0,"play_star_rating":4.0,"prod_short_desc":"Enjoy a day of family fun at LEGO® DUPLO® Big Fair!","prod_id":10840.0,"prod_long_desc":"Play out weekend family fun with modern LEGO® DUPLO® figures in the bright and colorful Big Fair. Toddlers will love to building the Ferris wheel and turning it to watch the cars go round, rotating the carousel with gearwheel function and 4 horses to ride on, and playing with the big wavy slides again and again. They can also drive the little train and visit the ice cream kiosk, detach the giant ice cream and give it to mom or dad! Includes 5 DUPLO figures.\nIncludes 5 LEGO® DUPLO® figures: 2 adults and 3 children.\nFeatures a Ferris wheel with 3 cars and turning function, rotating carousel with 4 horse figures and gearwheel function, stand with 2 wavy slides, train with carriage, ice cream kiosk with table and chairs, and a restroom block with toilet and sink.\nIncludes bricks decorated as ice creams, orange juice, measuring chart, toilet paper and soap bottles.\nAccessory elements include a camera, balloons, whipped cream and a cup.\nHelp your child use the turning functions to spin the Ferris wheel and carousel.\nToddlers will enjoy sliding the LEGO® DUPLO® figures down the wavy slide or pushing them along in the train.\nUse the modern characters, accessories and decorated bricks to play out family fun in a fun fair environment.\nLEGO® DUPLO® products are specially designed to be safe and suitable for small hands.\nThis set offers an age-appropriate build and play experience for ages 2-5.\nFerris wheel measures over 14” high, 7” wide and 6” long.\nCarousel measures over 7” high, 7” wide and 8” long.\nIce cream kiosk measures over 9” high, 4” wide and 3” long.\nTrain measures over 3” high, 9” long and 3” wide.\nCombine with the 10839 Shooting Gallery to extend the fair environment.\nThere are several My Town products to collect and play out family fun in a recognizable LEGO® DUPLO® world.","review_difficulty":"Easy","set":"Big Fair","star_rating":5.0,"theme":"DUPLO®","val_star_rating":4.0,"country":"NO"}