{"ages":"9-12","list_price":90.87,"num_reviews":2.0,"piece_count":646.0,"play_star_rating":5.0,"prod_short_desc":"Rescue the captured Guardian Earth Fox from Noctura’s tower!","prod_id":41194.0,"prod_long_desc":"Seek the magic within to help Farran free the Guardian Earth Fox and then together face Noctura and her evil shadow bats! This fantastic LEGO® Elves creative play set features a fully posable and buildable earth fox with opening jaw and movable legs, head and translucent tail, plus a 2-level tower with opening translucent bat wings, moving head, spiderweb trap\/door, disc shooter, space for the 4 Elemental ‘diamonds' and additional accessories. Includes 2 mini-doll figures plus spider and 2 bat figures.\nIncludes Farran and Noctura mini-doll figures, plus Molo and Hippo shadow bat figures and a spider figure.\nFeatures a fully posable and buildable Liska the Guardian Earth Fox figure with movable translucent tail, legs and head, opening jaw, and space on the head for a magic Earth ‘diamond.\nAlso includes a 2-level Tower of Shadows with large bat wings and head that lift up to reveal the upper floor, tipping potion bottles and cauldron, opening spiderweb trap\/door, shooter, chain release function, space on the front of the tower for the 4 Elemental ‘diamonds’ and a hanging nook for the bats.\nTurn the knob on the back of the tower to lift up the translucent bat wings and head to reveal the stolen Elemental ‘diamonds’.\nTurn the gear in the potion room to ‘mix' the potion bottles.\nRaise the spiderweb trap to capture Farran in the tower's lower level.\nTip the mushroom down to free the chain attached to the tower.\nAccessory elements include Farran's magical earth shield, 2 shooting web discs, Noctura’s shadow staff, map, lock, chain, 3 potion bottles, skull in a jar, chicken leg, 2 ‘golden’ keys, lettuce and 4 Elemental magic ‘diamonds’.\nThis awesome creative play set is suitable for ages 9-12.\nOther mischievous little bats can be collected in selected LEGO® Elves sets.\nGuardian Earth Fox measures over 3” high, 8” long and 3” wide.\nNoctura's tower measures over 11” high, 7” wide and 3” long.","review_difficulty":null,"set":"Noctura's Tower & the Earth Fox Rescue","star_rating":4.5,"theme":"Elves","val_star_rating":3.0,"country":"NO"}